{"input": "What is MTN Data bundle?", "response": "MTN Data bundles are affordable data plans designed to give access to the internet through data enabled devices. It is usually within a defined unit of bytes and at a pre-determined price for a definite period and MTN has a robust bouquet of bundles that suits all lifestyle."}
{"input": "Who can subscribe to MTN Data bundle?", "response": "All MTN Customers can subscribe to any MTN Data bundle."}
{"input": "What are the different MTN Data bundle plans available?", "response": "They are Daily, Weekly, Monthly, Bi-monthly, Quarterly, Bi-annually, and Yearly."}
{"input": "How do I subscribe to MTN Data bundles?", "response": "A. You can subscribe to any MTN data bundles via the following channels:USSD: Dialling *321*1# or *904# and selecting your preferred data plan.B. SMS: Sending the bundle plan keyword to 312.myMTN App: Text myMTN to 5018 to download the app.myMTN WebMTN TopIt/VTUZigiFacebook (Mobile Center)Google"}
{"input": "I received a pop-up menu to choose either Auto-renewal, One-off, or Buy for a Friend when activating a data bundle. What does this mean?", "response": "The pop-up menu is a feature that allows you to set your data bundle on Auto-renew or One-off purchase, and to Buy for a Friend:Auto-renew Purchase means that your data bundle will automatically renew after expiry provided you have enough airtime on your line.One-off Purchase means that your data bundle will not renew after expiry date even with the sufficient airtime.Buy for a Friend option allows you to buy a data bundle for another line with your airtime."}
{"input": "If I exit the pop-up menu or it times out before selecting an option, will my data bundle be on Auto-renewal or One-off option?", "response": "If you are buying a data bundle via SMS and it exits the pop-up menu, or it times out before selecting an option, the data bundle would be activated as Oneâ\u0080\u0093off purchase. But, if you are buying the bundle via USSD you will not be able to proceed to buy the data bundle until you select an option of either one-off, auto-renewal or buy for a friend."}
{"input": "If my data bundle is activated on One-off, will I be able to opt in for Auto-renew or renew the bundle?", "response": "Yes, you will be able to opt in for Auto-renewal or renew the bundle by sending R+bundle code to 312.Example: If you have an active 100MB daily bundle that is on One-off option, you will be able to renew it by sending R104 to 312."}
{"input": "Will I be able to cancel auto-renewal anytime?", "response": "Yes, you will be able to cancel auto-renewal on your bundle anytime by sending NO+bundle code to 312."}
{"input": "How do I check my MTN Data Bundle balance?", "response": "You will be able to check your data bundle balance via the following channels:SMS: Texting 2 to 312USSD: Dialing *312*4# (for main data bundle and bonus), or *310#myMTN AppmyMTN WebZigi"}
{"input": "Can I purchase multiple MTN Data bundles?", "response": "Yes, you can activate multiple data bundles and all the data bundle purchased will have its own unique expiry dates."}
{"input": "If I have multiple data bundles active, which bundle will deplete first?", "response": "If you have multiple data bundles active on your line, the data bundle with the least validity will be used first. Example: If you have a 30-day bundle plan and 1-day plan both active on your line, the 1-day plan will be used first before the 30 days plan."}
{"input": "What happens if I exhaust my data bundle before the renewal date?", "response": "As soon as you exhaust your data bundle before the expiry, your data access will be suspended, and you will not be able to browse again. To continue browsing, you will need to do one of the following:Buy another data plan by dialing *312*1# or *904#.Borrow data by dialing *303#.Opt-in for Pay-As-You-Go browsing by dialing *312*200# to continue browsing with your airtime at N3.07/MB.Request data from a friend via *321*2*3#."}
{"input": "I noticed that some data plans have additional voice minutes when I tried to buy the bundles. What does this mean?", "response": "Yes, some data bundle plans now have additional voice minutes. This means that when you buy any of the select bundles, you will also be able to call your friends and family from the additional voice minutes."}
{"input": "Will I be able to use the voice minutes to call all networks in Nigeria?", "response": "Yes, you will be able to call all numbers in Nigeria with the voice minutes you get from the purchase of the data bundle.Note: You will not be able to call international numbers and Nigeria from the voice bundle while roaming. You will also not be able to call international numbers with the voice bundle."}
{"input": "At what rate will I be charged when I call from the voice bundle?", "response": "You will be charged at the rate of 13k/sec when calling from the voice minutes. Once you have exhausted the voice minutes, charges will be taken from your main account or any other voice bundle on your line."}
{"input": "If I have the voice minutes and other voice bundles/bonuses active on my line, which bundle/bonus will first be charged?", "response": "The bundle/bonus on your line with the closest expiry will be charged first for calls. However, if you have multiple bundles/bonuses with the same expiry, the voice minutes will be charged before the other voice bundles/bonuses on your line."}
{"input": "Will I be able to enjoy data bonus offers when I activate a data bundle?", "response": "Yes, you will be able to enjoy 25%, 50%, 100%, and any other bonus offers you are eligible for on the network whenever you buy a data bundle. The offer includes: â\u0080¢ 100% 4G Upgrade Bonus: this offer is available only on select data plans from N15,000 and below beginning from month 1 to month 3 after upgrading your SIM to 4G. â\u0080¢ 25% 4G Upgrade Bonus: you will be able to enjoy 25% bonus on every data bundle you buy from month 4 to month 6 after upgrading your SIM to 4G. â\u0080¢ 50% Device Bonus: you will get 50% bonus on every data bundle you buy with a newly activated phone/device. â\u0080¢ Double Data Bonus: you will be able to enjoy double data (100% data bonus) only when you buy select data bundles from N15000 and below."}
{"input": "I noticed that there are some data plans that are available on myMTN App but not on the USSD channels. Why is that?", "response": "Yes. These plans are the digital bundles, that are only available for purchase on digital channels like myMTN app, myMTN web, and Facebook, but not available for purchase on channels like USSD and SMS.You will be able to pay for the bundle purchase from your bank account or bank card.Digital BundlesBundle NamePriceValidity1GB Daily BundleN20024 hours3.5GB 2 Days BundleN5002 Days15GB Weekly BundleN2,0007 Days11GB Weekly Bundle + 20minsN3,50030 Days13GB Weekly Bundle + 25minsN4,00030 Days27GB Weekly Bundle + 25minsN6,50030 Days"}
{"input": "Can I use the Digital bundles for normal internet activities?", "response": "Yes, the digital bundles can be used just like the other Access data plans for all internet-based services like browsing, streaming, downloading etc. The only difference is that you can only purchase the bundles on Digital channels only."}
{"input": "Which other add-on can I enjoy when I buy a data bundle?", "response": "Yes, you will enjoy FREE data on select data plans for streaming on YouTube in the night from 12am to 5am and additional FREE data to stream on YouTube All-Day."}
{"input": "Who can enjoy the FREE YouTube Night/Day Video Streaming data?", "response": "All MTN customers who purchase any of the data plans eligible for the offer will be able to enjoy the Free YouTube Night/Day data."}
{"input": "How can I enjoy the FREE YouTube Night/Day data?", "response": "You will get the FREE YouTube Night/Day data when you buy any of the eligible data plans via the following activation channels:USSD: Dialling *312*1#SMS: Text 130 to 312MTN On Demand (*904#).myMTN AppmyMTN WebMTN TopITFacebook (Mobile Center)GoogleZigi"}
{"input": "What is the validity of my Free YouTube Night/Day Data?", "response": "Your Free YouTube Night/Day data will have the same validity with the main data plan you purchased."}
{"input": "When will I be able to use the FREE YouTube Night/Day data?", "response": "The FREE YouTube Night data is available for us only from 12am â\u0080\u0093 5am while the YouTube Day is available All-day within the validity period of the main data plan."}
{"input": "Can I enjoy multiples of the FREE YouTube Night/Day data every time I buy the eligible data plans?", "response": "Yes, you can enjoy the FREE YouTube Night/Day data as multiple times on every eligible data plan you buy."}
{"input": "Will I be able to stream videos from other sites/apps with the FREE YouTube Night/Day data?", "response": "NO, the FREE YouTube Night/Day data can only be used to stream videos on YouTube/YouTube Music app and web."}
{"input": "What happens if I exhaust the FREE YouTube Night/Day data while streaming?", "response": "You will be charged from your main data bundle or any other available bundle if you continue to watch YouTube videos."}
{"input": "Can I share my FREE YouTube Night/Day data?", "response": "No, you will not be able to share your YouTube Night/Day data, but you can share your main data."}
{"input": "Will I be able to rollover my unused FREE YouTube Night/Day data?", "response": "No, you will not be able to roll over the unused FREE YouTube Night/Day data."}
{"input": "How do I check the balance of my FREE YouTube Night/Day data?", "response": "To check your YouTube Night/Day data balance, simply dial *312*4#, *310#, text 2 to 312, or visit myMTN App, myMTN Web, and Zigi."}
{"input": "Will I be able to rollover my unused main data bundle?", "response": "Yes, you will be able to roll over your Unused main data bundle ONLY if you buy another data plan from the same category with the current bundle within the stipulated grace period. **Note, you will NOT be able to rollover any unused data bonus. See Data Roll Over table below for details:Data PlanBundle Roll Over CategoryRoll Over grace period1-dayDaily bundle1 day2-day2-day3 days3-day3-day3 days7-dayWeekly, 2-week bundle3 days14-day3 days30-dayMonthly7 days60-day2-month, 3-month7 days90-day7 days"}
{"input": "I am having 1GB remaining from my expired 6GB Monthly Plan, will I be able to rollover the remaining 1GB if I buy another monthly data bundle?", "response": "Yes, you will be able to rollover your unused 1GB when you activate any data plan from the monthly bundle category, and the validity of the new data bundle you activated will be applied to the unused/remaining bundle."}
{"input": "If I have an Unused 1GB from my expired 6GB Monthly Plan and I now activated a 40MB Daily Plan. Will my remaining 1GB be rolled over to the daily bundle?", "response": "No, your unused 1GB will expire unless you buy another monthly data plan within the grace period, and your 40MB Daily Plan will have 1 day validity."}
{"input": "What will happen if I do not renew my expired bundle or purchase another bundle of the same category after the rollover period?", "response": "If you fail to renew your expired bundle or purchase another bundle from the same category after the rollover period, all your un-used bundle will be cleared. See Data Roll- Over table for details."}
{"input": "I have 1GB left after my bundle expired. Will I be able to use it within the grace period?", "response": "No, you will NOT be able to use it within the grace period until you renew the bundle or purchase another data plan from the same category with the Un-used bundle. See Data Roll Over table for details."}
{"input": "Will I be able to rollover my unused data bonus?", "response": "No, you will NOT be able to rollover any unused data bonus even if the bundle auto-renews before expiry, upon expiry or within the applicable rollover period."}
{"input": "If I have multiple data bundle active from different categories, which bundle will auto-renew first?", "response": "All bundles will renew according to their bundle category â\u0080\u0093 daily, weekly, and monthly, etc. However, if you have multiple data bundles active from same category, the last data plan you purchased from that category will be the bundle that will be auto renewed. For Example: if you activate two data plans from the daily plans; (40MB on June 1st, 200MB on June 2nd), two plans from the monthly plan; (1.5GB on June 3rd and 10GB on June 4th), on the day of renewal, only 200MB from the daily plan and 10GB from the monthly plan will be the plans that will auto-renew."}
{"input": "Can I share my MTN Data Bundle?", "response": "Yes, you will be able to transfer from your data bundle to another line by dialing *321*Phone number* Data amount# or, text Transfer<space>Phone number<space>Data amount and send to 321."}
{"input": "I have 2GB Monthly Plan active and then activated 40MB Daily Plan, which of them will deplete first?", "response": "The 40MB Daily Plan will be used first and after the data bundle has been exhausted then data charges will be deducted from the 2GB Monthly plan."}
{"input": "Will I be able to browse from my airtime automatically after exhausting my data bundle?", "response": "You will be able to browse from your airtime only after exhausting your data bundle, BUT you will be required to opt in by dialing *312*200# before you can browse from your airtime at Pay As You Go rate."}
{"input": "How do I opt in for PAYG browsing?", "response": "To opt in for PAYG browsing, simply:Dial *312*200#.Send RESET to 312."}
{"input": "How much will I be charged for browsing from my airtime after opting in for PAYG browsing?", "response": "Your browsing from your airtime will be charged at N3.07/MB."}
{"input": "Will I be charged for opting in for PAYG browsing?", "response": "No, you will not be charged for opting in for PAYG browsing."}
{"input": "How do I opt out of PAYG browsing?", "response": "To opt out of PAYG browsing, simplyDial *312*201#Send SUSPEND to 312."}
{"input": "How can I check the validity of my data bundle?", "response": "You will be able to check the validity and expiry date of your data bundle via the following channels:SMS: Texting 2 to 312USSD: Dialing *312*4# (for main data bundle and bonus), or *310#myMTN AppmyMTN WebZigi"}
{"input": "What is the benefit of using the MTN 5G router?", "response": "5G offers higher internet speed and faster downloads than 4G and other bands, it can also connect up to 32-64 devices simultaneously for home and office use."}
{"input": "Does the 5G router come with any data bonus?", "response": "Yes, you enjoy multiple data bonus as seen belowThe 5G broadband router is bundled with 100GB data accessible upon activation and valid for 30 days.You also enjoy 100GB data bonus valid for 30 days on your next two (2) broadband data subscriptions of 100GB and above.Enjoy up to 100% data bonus on all Monthly Capped broadband data bundles for 6 months."}
{"input": "What are the promotional offers on monthly broadband plans?", "response": "Enjoy up to 100% data bonus on all Monthly Capped broadband data bundles for 6 months"}
{"input": "Does the 5G Broadband Router have different or special broadband bundles?", "response": "No, there are no dedicated bundle plans for 5G Broadband Router. Customers can subscribe to our Broadband Home or Office data propositions."}
{"input": "How do I know if my location has 5G coverage?", "response": "You can check your 5G coverage on - https://external.mtnncoveragelocator.com/"}
{"input": "How many devices can be connected to the MTN 5G Broadband router?", "response": "You can connect up to 32-62 devices to your 5G Broadband router at a time."}
{"input": "Can I use any other SIM card aside from MTN, on the router?", "response": "No. You cannot use any other SIM card, but an MTN SIM card."}
{"input": "Can I connect to the router via a LAN cable?", "response": "Yes, You can."}
{"input": "Do I need to do a SIM upgrade to 5G to use the 5G network mode?", "response": "Existing 4G SIMs on the network are also 5G enabled. To upgrade your SIM to 4G, kindly visit the nearest MTN shop for SIM upgrade."}
{"input": "Does the 5G router come with a bundled SIM card ?", "response": "Yes it does. However, to activate the SIM, customer is requested to register the SIM card at the nearest MTN SIM registration point. To locate a SIM registration centre, visit https://www.mtn.ng/sim"}
{"input": "How do I activate the 100GB 5G Router data bonus ?", "response": "Send 5GCPE to 312 to get started"}
{"input": "How do I link my Router SIM with my MTN SIM ?", "response": "You may also link your Broadband Router number to your primary phone number by dialing *312*500# for ease of subscription and management"}
{"input": "Can I purchase data from my primary SIM ?", "response": "Yes you can activate Broadband Router plans via USSD Platform. Dial USSD code *461*1# and follow the menu to select the bundle of your choice. Your primary number will be charged for the bundle and your Broadband Router device gets the data benefits"}
{"input": "Where would the notification go to after activation?", "response": "You will receive a notification on both your Broadband router and alternate numbers."}
{"input": "Can I buy data on my router via Zigi?", "response": "Yes, save 09033000001 to your contact as 'MTN WhatsApp Chatbot, send a WhatsApp message to get started. Activate/renew your Broadband Router data, check your balance and get support."}
{"input": "Is there a warranty on the 5G Broadband Device?", "response": "Yes. The warranty on the 5G device is valid for one year."}
{"input": "How do I check the 5G Broadband Router Airtime and Data balances?", "response": "Please use the http://mymtn.com.ng portal option. The airtime and data balances can be seen on the homepage. You may also use the device interface on 192.168.0.1 or MyMTN App."}
{"input": "Will I be able to roll over my unused data?", "response": "Yes. You will be able to roll over your unused data bundle for capped plans only."}
{"input": "Which Broadband Bundles can be used for 5G Broadband Router?", "response": "All Broadband Router bundles (Home and Office) can be used on the 5G Broadband Router. However, broadband bundles from 100GB and above are recommended for a better experience."}
{"input": "Does the 5G router supports specific bands on the MTN network like the 4G?", "response": "Yes, the MTN eShop 5G WiFi Broadband Router is downward compatible and can be used on the 4G network in areas without 5G network coverage"}
{"input": "What will I enjoy?", "response": "You will enjoy, Faster speed, Lower latency, Higher device capacity, Reliable connections and quicker uploads/downloads."}
{"input": "Can I purchase 5G data plans?", "response": "There no special bundle plans for 5G Routers. All Broadband Router bundles (Home and Office) can be used on the MTN 5G Broadband Router."}
{"input": "How much is MTN 5G Router?", "response": "The MTN 5G Router costs N60,000 only."}
{"input": "How to upgrade my MTN SIM to 5G network?", "response": "You canâ\u0080\u0099t upgrade MTN SIM to 5G network. All 4G sims are compatible with 5G as you just need a 5G device or phone."}
{"input": "How to recharge MTN 5g wifi router?", "response": "Dial *312*500# to link your MTN mobile phone number with your 5g ROUTER.Select 1 to link your 5G router with your MTN mobile number.After linking, dial *312*500*3# to select bundle you want.Or you can dial *461*1#Select bundle.Then select â\u0080\u0098buy for othersâ\u0080\u0099.Input the 5G router number and it is successful."}
{"input": "How to check data balance on MTN 5G router?", "response": "Dial *312*500# to link your MTN mobile phone number with your 5G router number.Select 1 to link your 5G router with your MTN mobile number.After linking, dial *312*500*4*3# to check your balance."}
{"input": "How can I access the Bulk SMS website?", "response": "You can access the bulk SMS website by going to https://bulksms.mymtn.com.ng"}
{"input": "How do I navigate the Bulk SMS platform?", "response": "Click here to access download the Bulk SMS user guide"}
{"input": "Is it possible to get free Bulk SMS units?", "response": "Yes, you get free units when you purchase a Thryve bundle. Click here to buy"}
{"input": "Can I enjoy discounted prices on the Bulk SMS bundle?", "response": "Yes, you can be eligible for discounted unit prices when if you are on a BizPlus, BizConnect, BizClass , Thryve , ConnectMore or a post-paid plan."}
{"input": "What are the discounted prices compared to the standard prices for each volume band?", "response": "Bulk SMS Bundles   Volume Bands   Standard Price /SMS   Discounted Price /SMS    Validity      Basic   500-2,000   N2.15   N2.00   30days      Standard   2001-10,000   N2.05   N1.90   30days      Premium   10,001-25,000   N2.00   N1.85   30days      Enterprise   25,001-50,000   N1.95   N1.80   30days"}
{"input": "Is there a limit to the number of units I can purchase?", "response": "Yes, you can buy a maximum volume of 50,000 SME Bulk SMS units per month."}
{"input": "Can I send Bulk SMS to international numbers?", "response": "No, you can only send to MTN numbers."}
{"input": "If I have multiple Family Pack bundles active, which bundle will deplete first?", "response": "If you have multiple Family Pack bundles active on your line, the bundle with the least validity will be used first.Example: If you have a 20GB Monthly Plan and 400GB 3-Month Plan both active on your line, the 20GB Monthly Plan will be used first before the 400GB 3-Month Plan."}
{"input": "What happens if my beneficiaries have not used up to their allotted data volumes and I exhaust the Family Pack bundle before renewal date?", "response": "If you exhaust the bundle before the renewal date, all your beneficiaries will no longer be able to browse from the bundle and every internet activity would be deducted from their personal lines. However, once the bundle is renewed the allocated data volume would reset and both you and your beneficiaries would be able to browse with the Family Pack bundle."}
{"input": "What happens if I exhaust my Family Pack bundle before the renewal date?", "response": "As soon as you exhaust your Family Pack bundle before the expiry, your data access will be suspended, and you will not be able to browse again. To continue browsing, you may need to do one of the following: â\u0080¢ Buy another Family Pack by dialling *131*1*7# â\u0080¢ Buy a Top-up Plan"}
{"input": "How can I activate the Top-up Plan?", "response": "To activate the Top-up Plan, you must first ensure that you have a Family Pack bundle active on your line. You can activate the Family Pack Top-up Plan via the following channels: â\u0080¢ USSD: by dialling *131*1*7# and selecting the â\u0080\u0098Buy Family Packâ\u0080\u0099 option.â\u0080¢ SMS: by sending the activation code to 131. See table below for details."}
{"input": "What is the validity of my Top-up Plan?", "response": "The Top-up bundle will inherit the remaining validity days of the last Family Pack plan active on your line. Therefore, if the validity of the active Family Pack monthly plan you activated on your line is remaining 5 days, the validity of the Top-up Plan you purchased would be 5 days."}
{"input": "Will I be able to enjoy bonus offers when I activate a Family Pack bundle?", "response": "â\u0080¢ Yes. You will enjoy FREE 50minutes and 100 SMSâ\u0080\u0099 to communicate only with your Family Pack beneficiaries. Note that you will not enjoy any other bonus offers such as Upgrade offer, Device offer, Referral offer, and any double data offer on your Family Pack bundle."}
{"input": "What is the validity of the FREE voice minutes and SMS?", "response": "Your FREE 50minutes and 100 SMSâ\u0080\u0099 will be valid 30 days."}
{"input": "What is the validity of my FREE 500MB data?", "response": "Your FREE 500MB data will be valid for 30 days from the day you registered the beneficiary. You will be able to use the FREE data all-day to access any websites/apps."}
{"input": "Can I transfer data from my Family Pack bundle?", "response": "No, you will not be able to transfer data from your Family Pack bundle."}
{"input": "Will I be able to rollover my unused main data bundle?", "response": "Yes, you will be able to roll over your Unused main data including your Top-up bundles ONLY if you buy another data plan from the same category with the current bundle within the stipulated grace period. **Note, you will NOT be able to rollover any unused data bonus. See table below for details:     Data Plan   Bundle Roll Over Category    Roll Over period     30-day   Monthly   7 days      90-day   3-Month   7 days     Top-up (ad hoc)   NA   NA"}
{"input": "How do I check my Family Pack balance?", "response": "You will be able to check your Family Packâ\u0080\u0099s sponsor and beneficiaryâ\u0080\u0099s allotted data balance via the following channels: â\u0080¢ USSD: by dialing *131*1*7#, then select â\u0080\u0098Balance Enquiryâ\u0080\u0099 option, or *556#, and *131*4# on your mobile phone â\u0080¢ SMS: Texting 2 to 131"}
{"input": "What is MTN Family Pack?", "response": "MTN Family Pack is a data bundle bouquet with unique feature of data share which allows customers (sponsors) to add and allocate data to 5 beneficiaries. The sponsor will be able to set usage limits for each beneficiary while all the usages will be deducted from the sponsorâ\u0080\u0099s account.  The sponsor will also get FREE 500MB for each beneficiary added and enjoy FREE complimentary 50 minutes and 100 SMSâ\u0080\u0099 for every Family Pack bundle activated to communicate with the beneficiaries."}
{"input": "Who can subscribe to MTN Family Pack?", "response": "All MTN Customers can subscribe to MTN Family Pack. However, customers will not be able to serve as both Family Pack sponsor and beneficiary at the same time."}
{"input": "What are the different MTN Family Pack available?", "response": "They are Monthly, Bi-monthly, and Top â\u0080\u0093 up plans. See table below for the available Family Pack bundles."}
{"input": "How do I subscribe to MTN Family Pack?", "response": "You can subscribe to MTN Family Pack via the following channels: â\u0080¢ USSD: By dialling *131*1*7# and select your preferred plan â\u0080¢ SMS: By sending the bundle plan keyword to 131. (See table below for keywords). You will also enjoy FREE 50 voice minutes and 100 SMSâ\u0080\u0099 on every Family Pack bundle you buy."}
{"input": "How can I become a Family Pack sponsor?", "response": "You will become a Family Pack sponsor the moment you activate any Family Pack bundles on your line. Note that you cannot be a beneficiary of another sponsor while you are having a Family Pack bundle active on your line."}
{"input": "How can I become a Family Pack beneficiary?", "response": "You can be a Family Pack beneficiary if you are added as a beneficiary by another line (sponsor). Note that you will not be able to activate a Family Pack bundle i.e. become a sponsor while you are a beneficiary."}
{"input": "Can I be a beneficiary of multiple Family Pack sponsors?", "response": "No. You can only be a beneficiary of one Family Pack sponsor at a time. However, you can decline to be a beneficiary of a sponsor by dialling *131*1*7# on your mobile phone and select â\u0080\u0098Manage Beneficiary/Sponsorâ\u0080\u0099 option."}
{"input": "How can I add a beneficiary on my Family Pack?", "response": "To add a beneficiary, simply dial *131*1*7# and select â\u0080\u0098Add New Beneficiaryâ\u0080\u0099 option. You will get FREE 500MB data each for the first 5 beneficiaries you added."}
{"input": "Will I be charged for adding a beneficiary on my Family Pack?", "response": "You will be able to add 5 beneficiaries for FREE in every 30 days. However, you will be charged N100 for each modification (i.e. edit/replace) after registering the 5 phone numbers within 30 days. To modify added beneficiaries simply dial *131*1*7# and select â\u0080\u0098Manage Beneficiaryâ\u0080\u0099 option."}
{"input": "How can I set data limits for a beneficiary?", "response": "You can set data limits for your beneficiaries by dialling *131*1*7# select option for â\u0080\u0098Add New Beneficiary/Sponsorâ\u0080\u0099, then select â\u0080\u0098Allocate Family Packâ\u0080\u0099 option. You will be able to allocate data as much as you have in your balance."}
{"input": "How will I be able to opt in for auto-renew or renew my Family Pack bundle?", "response": "You will be able to opt in for auto-renewal or renew the bundle by sending R+bundle code to 131. Example: If you have an active 20GB Monthly Family Plan that is on One-off purchase, you will be able to renew it by sending R21 to 131. See all auto-renewal commands in the table below."}
{"input": "Will I be able to cancel auto-renewal anytime?", "response": "Yes, you will be able to cancel auto-renewal on your Family Pack bundle anytime by sending the opt-out keyword to 131. See table below."}
{"input": "Can I purchase multiple MTN Family Pack bundles?", "response": "Yes, you can activate multiple Family Pack bundles. Each bundle purchased will have its own unique expiry dates and you will enjoy FREE 50 minutes and 100 SMSâ\u0080\u0099 on every bundle activated."}
{"input": "If I have MTN Access bundle active on my line, will I be able to buy a Family Pack bundle?", "response": "Yes, you will be able to buy a Family Pack bundle, however, you will only be able to allocate data to your beneficiaries from the Family Pack. The data depletion priority on your line would be based on the validity of the active bundles where the bundle with the least validity will take precedence."}
{"input": "What is MTN Social Bundle?", "response": "MTN Social Bundle is an event-based data bundle that allows customers to enjoy access to their favourite social media Apps such as Facebook, Ayoba, Eskimi, WeChat, 2GO, WhatsApp, YouTube, TikTok, Opera Mini & News, and Instagram at unbeatable rates. You will be able to subscribe to a social bundle plan for as low as N25 daily and to buy All Social Bundle plan to access Facebook, WhatsApp, TikTok, Instagram, Ayoba, WeChat, 2GO, Vskit, and Eskimi for N50 daily, N100 weekly and N250 monthly. You can also buy a special social bundle plan to stream only on YouTube, Instagram & TikTok as cheap as N100. And you will also be able to subscribe to Social Mega Bundles at fantastic rates for as low as N200 for 750MB and N300 for 1GB."}
{"input": "Who is eligible for this offer?", "response": "All MTN customers are eligible to enjoy the Social Bundle WHILE MTN Prepaid customers will be eligible to enjoy the Social Mega Bundle."}
{"input": "How do I access MTN Social Bundle?", "response": "To access Social Bundle, simply dial *131*3#. This will display all the available Social plans."}
{"input": "Can I subscribe to Social Bundle through SMS?", "response": "Yes, you can. Simply send the keyword of your preferred social plan to 131. See table below for full list of Social Bundles with the activation keyword for the different plans."}
{"input": "Can I access all social media apps with MTN Social Bundle?", "response": "Yes, you can access Facebook, WhatsApp, Instagram, Ayoba, WeChat, 2GO, TikTok, Vskit, and Eskimi apps at the same time if you subscribe to any of the ALL SOCIAL BUNDLE plans. Simply dial *131*3*6# and select your preferred plan OR send the keyword of your preferred All Social Bundle to 131."}
{"input": "Can I get Social Bundles to access a combination of selected social apps on my phone?", "response": "Yes, you can buy the following bundles to access a combination of social apps on your phone by simply dialing *131*3# or sending the keywords from your respective tariff plans:     s/n   Bundles   Type     1   YouTube, Instagram &TikTok   All tariff plans     2   All Social Bundles (WhatsApp, Facebook, Instagram, Ayoba, TikTok, 2Go, WeChat, Vskit, and Eskimi)   All tariff plans     3   WhatsApp & Facebook   BetaTalk Customers only     4   Social Mega Bundles (Facebook, Instagram & YouTube)   Prepaid Customers"}
{"input": "How much is the Social bundle?", "response": "The subscription charges are as follows. For single Social Bundle (GoodyBag):  â\u0080¢ Daily plan â\u0080\u0093 N25 â\u0080¢ Weekly plan â\u0080\u0093 N50 â\u0080¢ Monthly plan â\u0080\u0093 N150 For All Social Bundles: â\u0080¢ Daily plan â\u0080\u0093 N50 â\u0080¢ Weekly plan â\u0080\u0093 N100 â\u0080¢ Monthly plan â\u0080\u0093 N250 For YouTube, Instagram & TikTok Only Bundle: â\u0080¢ Daily plan â\u0080\u0093 N100 For WhatsApp & Facebook Bundle  â\u0080¢ Daily plan â\u0080\u0093 N25 â\u0080¢ Weekly plan â\u0080\u0093 N50 â\u0080¢ Monthly plan â\u0080\u0093 N100 For Social Mega Bundle â\u0080¢ 3 Days plan â\u0080\u0093 N200 â\u0080¢ Weekly plan â\u0080\u0093 N300"}
{"input": "Will my subscription be bundled with a data allowance?", "response": "Yes, but fair usage policy applies as follows. For single Social Bundle: â\u0080¢ Daily plan â\u0080\u0093 25MB â\u0080¢ Weekly plan â\u0080\u0093 50MB â\u0080¢ Monthly plan â\u0080\u0093 150MB For Instagram Social Bundle â\u0080¢ Daily plan â\u0080\u0093 250MB â\u0080¢ 3- Day Plan- 1GB For All Social Bundles: â\u0080¢ Daily plan â\u0080\u0093150MB â\u0080¢ Weekly plan â\u0080\u0093 350MB â\u0080¢ Monthly plan â\u0080\u0093 1GB For YouTube, Instagram & TikTok Only Bundle: â\u0080¢ Daily plan â\u0080\u0093350MB For WhatsApp &Facebook Bundles (BetaTalk Only): â\u0080¢ Daily plan â\u0080\u0093100MB â\u0080¢ Weekly Plan â\u0080\u0093 200MB â\u0080¢ Monthly Plan â\u0080\u0093 500MB For Social Mega Bundle (Prepaid Customers Only) â\u0080¢ 3 Days plan â\u0080\u0093 750MB â\u0080¢ Weekly plan â\u0080\u0093 1GB"}
{"input": "Will I receive the data allowance on every subscription to social bundle(s)", "response": "Yes, you will receive data allowance on every subscription to social bundle(s)."}
{"input": "If I have an existing data bundle or bonus and subscribe to Social Bundle(s), which data will deplete first while browsing?", "response": "You will be charged first from your Social Bundle data allowance, then any active data bonus before charging from your data bundle."}
{"input": "How do I check my Social bundle balance?", "response": "To check your Social Bundle balance, dial *131*4#."}
{"input": "Will I be able to browse all internet sites or App with my data allowance after subscribing to Social Bundle?", "response": "No, you will ONLY be able to browse the social app or instant messaging services that you have subscribed to e.g. subscription to Facebook, WeChat and WhatsApp bundles will only grant you access to Facebook, WeChat and WhatsApp respectively."}
{"input": "Will I have to re-subscribe to the same Social Bundle(s) before my subscription expires?", "response": "Your subscription will be auto renewed on the day of expiry as long as you have enough airtime but you will receive a notification message before renewal and after renewal."}
{"input": "Will I be able to roll over my unused social bundle data allowance?", "response": "Yes, you will be able to roll-over your unused data within the stipulated grace-period. See table below:     Social Plan   Roll Over Category   Grace Period     Daily/ 3 Day    Daily   1 day     Weekly   Weekly   3 days     Monthly   Monthly   7 days"}
{"input": "How do I stop automatic renewal of any of the social bundles?", "response": "You can stop auto renewal by sending STOP+keyword for single Social Bundle e.g. STOPWCM to 131 for WeChat monthly plan, and NO+keyword for other bundles e.g. NOASD to 131 for All Social Daily, or NOYIB to 131 for YouTube, Instagram &TikTok Bundle, and NOWFM to131 for WhatsApp &Facebook Bundles (Beta Talk Customers Only). e.g. NOSDM to 131 for 3 Days Social Mega Bundle, and NOSDW to 131 for Weekly Social Mega Bundle.                          Bundle Type   Plan   Price per App   Apps   Activation SMS to 131   Opt-In Autorenewal SMS to 131   Opt-out Autorenewal SMS to 131   USSD Activation       Single Social Bundle (GoodyBag)   Social Bundle Daily (GoodyBag)   N25   WhatsApp   WAD   RWAD   STOPWAD   *131*3#     Facebook   FBD   RFBD   STOPFBD     Ayoba   ABD   RABD   NOABD     2Go   2GOD   R2GOD   STOP2GOD     WeChat   WCDÂ    RWCDÂ    STOPWCD     Eskimi   ESKD   RESKD   STOPESKD     N50   TikTok   TBD   RTBD   NOTBD     N100   Instagram   INSD   RINSD   STOPINSD     N200   Instagram (3-day Plan)   IGD   RIGD   NOIGD     Social Bundle Weekly (GoodyBag)   N50   WhatsApp   WAWÂ    RWAWÂ    STOPWAW     Facebook   FBW   RFBW   STOPFBW     Ayoba   ABW   RABW   NOABW     2Go   2GOWÂ    R2GOWÂ    STOP2GOW     WeChat   WCWÂ    RWCWÂ    STOPWCW     Eskimi   ESKWÂ    RESKWÂ    STOPESKW     N350   TikTok   TBW   RTBW   NOTBW     Social Bundle Monthly (GoodyBag)   N150   WhatsApp   WAMÂ    RWAMÂ    STOPWAM     Facebook   FBM   RFBM   STOPFBM     Ayoba   ABM   RABM   NOABM     2Go   2GOMÂ    R2GOMÂ    STOP2GOM     WeChat   WCMÂ    RWCMÂ    STOPWCM     Eskimi   ESKMÂ    RESKMÂ    STOPESKM     All Social Bundles   All Social Bundles (Daily)   N50   WhatsApp, Facebook, Instagram, Ayoba, 2Go, WeChat, TikTok, Vskit, and Eskimi   ASD   RASD   NOASD     All Social Bundles (Weekly)   N100   WhatsApp, Facebook, Instagram, Ayoba, 2Go, WeChat, TikTok, Vskit, and Eskimi   ASW   RASW   NOASW     All Social Bundles (Monthly)   N250   WhatsApp, Facebook, Instagram, Ayoba, 2Go, WeChat, TikTok, Vskit, and Eskimi   ASM   RASM   NOASM     YouTube, Instagram & TikTok ONLY Bundle   YouTube, Instagram &TikTok (Daily)   N100   YouTube, Instagram and TikTok   YIB   RYIB   NOYIB"}
{"input": "What is MTN MSME Learning Bundle?", "response": "This is a learning data bundle tailored to give customers subsidized data access to specific learning platforms of our partner agencies such as EDC, Fate Foundation, SMEDAN etc."}
{"input": "Who can activate MTN MSME Learning Bundle?", "response": "All MTN Prepaid and Post-paid customers can activate Learning bundles."}
{"input": "What are the sites the bundle currently works on?", "response": "SMEDAN: https://www.smedigitalacademy.com/  EDC: https://smetoolkit.ng/  Fate Foundation: https://www.msmehub.org/"}
{"input": "How much data volume to I get on the MSME learning bundle and what is the validity of the bundle?", "response": "The MTN MSME Learning bundle offers 2GB data at the price of N200 which is valid for 7 days."}
{"input": "How do I buy the bundle?", "response": "Customers can also activate the bundle through these channels â\u0080¢ USSD â\u0080\u0094 *460*200# â\u0080¢ SMS â\u0080\u0094 Send â\u0080\u009cLearnâ\u0080\u009d to 131"}
{"input": "What happens when I want to access the learning websites and I have an existing mobile data plan and an MSME Learning bundle?", "response": "Your learning bundle depletes when you are on the learning websites, even if you have another active data bundle."}
{"input": "What happens when I want to access other websites and I have an existing mobile data plan and an MSME Learning bundle?", "response": "Your mobile data plan would deplete instead when you are on other websites"}
{"input": "Can I purchase the bundle multiple times?", "response": "Yes, you can. There is no limit to the number of times you can purchase it."}
{"input": "If my Learning bundle is on One-off option, will I be able to opt in for Recurrent option or renew the bundle?", "response": "Yes, you will be able to opt in for Recurrent option or renew the bundle by sending â\u0080\u009cRLearnâ\u0080\u009d to 131."}
{"input": "How can I check my main account and MSME Learning bundle balance?", "response": "You can check your main account balance, MSME Learning bundle balance and bundle expiry by dialling the code *131*4#"}
{"input": "Who is SME Data share for?", "response": "MTN SME Data Share has been designed specifically for business owners who need to enable their staff, wherever they are based, by sharing mobile data with them."}
{"input": "Can I Purchase SME Data share on other Channels?", "response": "Yes, you can purchase through: â\u0080¢ My MTN App â\u0080¢ SMS- By sending the keyword to 131 â\u0080¢ USSD â\u0080\u0093 By dialing the appropriate short string     Bundle   Price(N)   Validity (days)   Share Count   Opt-In SMS keyword    Opt-Out SMS keyword   Short String     25GB   10,000   30   50   468   NO468   *461*30#     35GB   13,500   30   70   501   NO501   *461*31#     165GB   50,000   60   330   504   NO504   *461*32#     360GB   100,000   90   720   503   NO503   *461*33#     1TB   250,000   90   2500   505   NO505   *461*34#     5TB   1,250,000   90   5120   506   NO506   *461*35#     10TB   2,520,000   90   10240   507   NO507   *461*36#     20TB   4,830,000   90   20480   508   NO508   *461*37#     25TB   5,770,000   90   25600   509   NO509   *461*38#"}
{"input": "What sizes of data can I share with my staff?", "response": "You can share 500MB, 1GB, 2GB, 3GB, 5GB or 10GB. These are the only size of data that can be shared."}
{"input": "Is there a limit to the number of times I can share data with my staff", "response": "Yes there are share counts as seen in the table below.     Bundle   Price(N)   Validity (days)   Share Count     25GB   10,000   30   50     35GB   13,500   30   70     165GB   50,000   60   330     360GB   100,000   90   720     1TB   250,000   90   2500     5TB   1,250,000   90   5120     10TB   2,520,000   90   10240     20TB   4,830,000   90   20480     25TB   5,770,000   90   25600"}
{"input": "How do I share my SME data bundle with my Staff?", "response": "You can share your SME data share on the App and Web channels. You can also share data with any beneficiary by sending an SMS keyword to 131 or by dialing any of the USSD strings as shown in the table below     USSD Format   SMS Format to send to 131 to share data   Comment     *461*NUMBER*250*PIN#   SMEA <PhoneNumber> 250 <PIN> to 131   SMS to transfer 250MB     *461*NUMBER*500*PIN#   SMEB <PhoneNumber> 500 <PIN> to 131   SMS to transfer 500MB     *461*NUMBER*1000*PIN#   SMEC <PhoneNumber> 1000 <PIN> to 131   SMS to transfer 1GB     *461*NUMBER*2000*PIN#   SMED <PhoneNumber> 2000 <PIN> to 131   SMS to transfer 2GB     *461*NUMBER*5000*PIN#   SME <PhoneNumber> 5000 <PIN> to 131   SMS to transfer 5GB     Â  For example to share 500MB of data with beneficiary using phone number 08031234567 and MTN PIN â\u0080\u00981234â\u0080\u0099, then the following is sent as SMS to 131 (or Dial *461# and follow the prompt)  SMEA 08031234567 250 1234 = Correct Format!"}
{"input": "How do my staff check their data balance through other channels?", "response": "Your staff can check their data balance by sending SHAREBALANCE to 131 or dial *461*2*3#."}
{"input": "Can I purchase another SME data plan while my current plan is still running?", "response": "Yes, you can purchase additional SME Data plans multiple times while your current plan is still running. Your data will be accumulated and will assume the expiry date of your last SME Data plan."}
{"input": "If I send data to my staff multiple times, does the data accumulate?", "response": "Yes, the data accumulates and takes on the expiry data of the last shared data bundle."}
{"input": "How do I know when my subscription will expire?", "response": "You will receive an SMS notifying you of the subscription expiration three days to the end of your subscription. This will continue everyday until the expiration of your subscription."}
{"input": "What is the MTN BizPlus Plan?", "response": "MTN BizPlus is a prepaid tariff plan that allows MSMEs enjoy a FLAT rate of ONLY 11.26k/sec for calls across ALL local networks after the first 60 second call of the day at 25k/sec. BizPlus subscribers also get rewarded with BizPlus Points when they perform some â\u0080\u009crevenue generating activitiesâ\u0080\u009d which can be used to get different BizPlus bundles and other data bundles."}
{"input": "Who can activate the MTN BizPlus bundle?", "response": "All MTN prepaid customers can activate the BizPlus bundles."}
{"input": "Can I purchase the BizPlus bundle on other channels?", "response": "Yes, you can purchase BizPlus bundles by dialing *460*2# from an MTN line or SMS BizPlus to 131."}
{"input": "Can I update the CallerFeel and CallerTunez Value Added Services?", "response": "Customer who have an active BizPlus Standard or BizPlus Premium bundle can update the VAS elements by dialing *460*2*5#"}
{"input": "Can I purchase the BizPlus Bundles multiple times?", "response": "You can purchase Bizplus bundles multiple times. However, the Time-based bundles have a cap of 5GB per day."}
{"input": "How can I check my BizPlus bundle balance?", "response": "You can check your main account balance and bundle expiry by dialing the code *131*4#"}
{"input": "Will I be able to roll over my unused data if I renew my bundle before expiry?", "response": "Yes, you would be able to roll over your unused data if you renew your bundle before expiry."}
{"input": "Will I be able to roll over my unused BizPlus Time-based bundles if I have unused data before expiry?", "response": "All unused data from your BizPlus Time-based bundles is not be rolled over and will expire daily."}
{"input": "Can I use a BizPlus bundle during roaming?", "response": "No, BizPlus bundles cannot be used as a roaming bundle"}
{"input": "What is BizPlus Points Offer?", "response": "BizPlus Points Offer awards BizPlus customers points for the following activities â\u0080¢ First-time migration to the Pulse tariff plan â\u0080¢ Performing selected revenue-generating activities from your main account"}
{"input": "If I have been on the BizPlus tariff plan but migrated out, will I receive BizPlus Points for migrating back to the BizPlus tariff", "response": "No, you will not receive BizPlus points for migrating back to Migrating back to BizPlus. But you will still receive points when you perform selected revenue generating activities when on the BizPlus plan"}
{"input": "Can I use BizPlus Points to make calls?", "response": "No, you can only use BizPlus points to redeem data"}
{"input": "What are the activities I should perform to receive BizPlus Points?", "response": "The selected activities are â\u0080¢ First time migration BizPlus Tariff Plan â\u0080¢ Purchase/Gifting of:     â\u0097¦ BizPlus bundles     â\u0097¦ Daily Data plans     â\u0097¦ Weekly Data plans     â\u0097¦ Monthly data plans"}
{"input": "Will I be able to accumulate the BizPlus Points?", "response": "Yes, you can accumulate your BizPlus points and exchange them for free data."}
{"input": "What services can I exchange my BizPlus Points for?", "response": "You will be able to redeem your BizPlus Points by using BizPlus points only for the following services: â\u0080¢ Purchase of: â\u0097¦ BizPlus bundles â\u0097¦ Daily Data plans â\u0097¦ Weekly Data plans â\u0097¦ Monthly data plans"}
{"input": "How can I redeem my BizPlus Points?", "response": "To redeem your BizPlus Points, dial *460*2*6# and follow the instructions"}
{"input": "Will I receive BizPlus Points when I activate a data plan with my BizPlus points?", "response": "No, you will NOT receive BizPlus points if you activate a data plan with your BizPlus Points"}
{"input": "How can I check my BizPlus Point balance?", "response": "To check your BizPlus Point balance, dial *460*2*6#"}
{"input": "Will I be able to transfer my BizPlus Points to loved ones or family?", "response": "No, bizPlus points are not transferable to loved ones or family"}
{"input": "What is the validity of BizPlus Points?", "response": "All accumulated BizPlus points are valid for a period of 1 (one) Calendar Year e.g. January 1st 2022- December 31st 2022 11:59pm. If your points are not redeemed before the validity period, your points will be cleared."}
{"input": "Will my BizPlus Points be cleared if I migrate out of the BizPlus plans?", "response": "You will lose your BizPlus points once you migrate out of the BizPlus Tariff Plan. However, once you migrate back to the BizPlus plan you can start earning BizPlus points when you perform certain activities on your line."}
{"input": "How much will I be charged for migrating from a BizPlus Plan?", "response": "Your first migration out of the BizPlus plan in a month will not be charged, but for subsequent migration out of the plan within same month, you will be charged N102."}
{"input": "Will I be able to migrate to another plan and use my active bundle on the new tariff plan?", "response": "You will be able to migrate out of the BizPlus plan to another tariff plan even if you have an active BizPlus bundle BUT you will NOT be able to use the bundle balance on the plan you migrated to and the bundle will not auto-renew on the day of renewal."}
{"input": "Can I subscribe to different types of BizPlus bundles?", "response": "Yes, you can subscribe to different BizPlus bundles at a time."}
{"input": "Will I be able to enjoy other MTN Products, Services, Offers and Promotions while on the BizPlus Plan?", "response": "Yes, you will be able to enjoy all MTNN Products, Services, Offers and Promotions while on the BizPlus plan."}
{"input": "What is XtraValue Plan?", "response": "MTN XtraValue tariff Plan is a plan that rewards you with airtime for National SMS & calls, International calls to 6 (six) selected international countries from the very first second and volumes of data for browsing after subscribing to any XtraValue bundle plan.The XtraValue bundle is divided into XtraTalk (this bundle gives you more airtime than data) and XtraData (this bundle gives you more data than airtime)."}
{"input": "Who can activate MTN Xtravalue bundle?", "response": "All MTN Prepaid and Postpaid customers can activate the Xtravalue bundles. However, after the purchase of any XtraValue bundle, Prepaid Customers will be migrated to the Xtravalue plan to enjoy the bundle WHILE Postpaid Customers will enjoy the bundle from their respective tariff plan."}
{"input": "How do I migrate to the XtraValue tariff plan?", "response": "Simply subscribe to any of the XtraValue bundles by:Dial *312*2# OR *123*2*5# and select any XtraValue plan of your choice.Send keyword of preferred XtraValue plan to 312. (See table below for keywords).Download myMTN App and select XtraValue plan of choice from the available XtraValue plans.Log on to MTN eShop (https://shop.mtn.ng )myMTN Web:Log on to https://mymtn.com.ngEnter your phone number.Enter OTP and select â\u0080\u0098Proceedâ\u0080\u0099.Select â\u0080\u0098Buy Bundleâ\u0080\u0099.Select â\u0080\u0098Data and Voice bundleâ\u0080\u0099.Select XtraValue plan of choice from the available XtraValue plans.Once you have successfully subscribed to a bundle plan, you will be automatically migrated to XtraValue plan and your XtraValue bundle account will be credited with the bundle elements.Note: If you are a Postpaid customer, you will not be migrated to the XtraValue plan. You will be able to enjoy the bundle from your tariff plan."}
{"input": "I noticed two additional bundles i.e., the XtraTalk 3500 and Xtradata 3500 on the XtraValue menu when I tried to buy my bundle. Are they new bundles?", "response": "Yes, the XtraValue bundle bouquet has been enriched with two additional bundles (i.e. the XtraTalk 3500 and XtraData 3500) to give you more options to choose from."}
{"input": "Are the new XtraValue 3500 bundles different from the existing XtraValue bundles?", "response": "No. The XtraValue 3500 bundles also give you voice and data that can be used to call, SMS, and browse just like the existing XtraValue bundles."}
{"input": "My sister that just bought a new MTN SIM gets more data volume whenever she buys any XtraData bundle but when I buy the same XtraData bundle, I get less volume. Why?", "response": "Yes. New MTN customers that join the network will now enjoy a 100% data bonus on their XtraData bundle purchase within 30 days of joining the network but Customers that are 31 days and above will get the regular bundle values when they buy any XtraData bundles.Note: The 100% data bonus is only applicable to the data bundle value (and not the Voice value) when an eligible customer buys any XtraData bundle.Â Example (Scenario 1)Zainab activated a new line on the 5th of June and selects the XtraValue plan at the point of activation, she will enjoy the 100% data bonus on every XtraData bundle she buys till the 4th of July 2022. From the 5th of July, she will NOT enjoy the 100% data bonus if she buys any XtraData bundle.Revamped Xtradata Benefits for new customers.Bundle TypeÂ XtraData BenefitsValidityStandard100% data bonus on 1st MonthDataVoiceDataVoiceXtraData Mini 200200MBN200400MBN2003 daysXtraData 300350MBN300700MBN3007 daysXtraData 500750MBN5001.5GBN5007 daysXtraData 1,0001.5GBN1,0003GBN1,00030 daysXtraData 2,0004.5GBN2,0009GBN2,00030 daysXtraData 3,50012GBN3,50024GBN3,50030 daysXtraData 5,00015GBN5,00030GBN5,00030 daysXtraData 10,00030GBN10,00060GBN10,00030 daysXtraData 15,00050GBN15,000100GBN15,00030 daysXtraData 20,00070GBN20,000140GBN20,00030 days"}
{"input": "Wow, I just received a pop-up menu to choose either One-off or Recurrent (Auto-renew) option after activating the XtraValue bundle. What does this mean?", "response": "The Pop-up menu is a new feature that allows you to set your XtraValue bundle on One-off or Recurrent purchases:One-Off Purchase means that your Xtravalue bundle will NOT auto-renew after expiry.Auto-renewal/ Recurrent Purchase means your XtraValue bundle will auto-renew after expiry.Note:For a one-off purchase, your XtraValue Bundle will NOT renew automatically after exhausting the bundle element or on the expiry of the bundle.For recurrent purchases, your XtraValue Bundle will renew automatically after exhausting the bundle element or on the expiry of the bundle."}
{"input": "If I cancel the Pop-Up Menu or it times out before selecting an option, will my XtraValue bundle be on a One-off or Recurrent option?", "response": "If you cancel the Pop-Up Menu or it times out before selecting an option, your XtraValue bundle will be on One-off purchase. This means that your XtraValue bundle will not auto-renew upon expiry."}
{"input": "If my Xtravalue bundle is on a One-off option, will I be able to opt in for the Recurrent option or renew the bundle?", "response": "Yes, you will be able to opt in for the Recurrent option or renew the bundle by sending R + bundle keyword to 312.Example: If you have an active XtraData3500 that is on the One-off option, you will be able to renew it by sending RD3500 to 312."}
{"input": "Will I be able to cancel auto-renewal anytime?", "response": "Yes, you will be able to cancel auto-renewal on your bundle anytime by sending the No + Bundle code to 312 E.g. NoD300 to 312."}
{"input": "What happens when I cancel auto-renewal on my bundle?", "response": "Once you cancel auto-renewal on your bundle, the bundle will not be renewed but your Calls, SMS, and Data will be charged from your main account or any active bonus account after your bundle has expired."}
{"input": "How much will I be charged for migrating into the XtraValue plan?", "response": "You will not be charged the migration fee of N102 while migrating into the XtraValue plan after subscribing to a plan, only the bundle plan fee will be deducted."}
{"input": "How much will I be charged for migrating out of XtraValue plan?", "response": "Your first migration out of XtraValue plan in a month will not be charged BUT for subsequent migration out of the plan within the same month, you will be charged N102.XtraValue Cross-Sell TableData Bundle Customer Tries to PurchaseXtraData Bundle Suggested to CustomerN1,000 for 1.5GB (30days)XtraData1000 (30days)N2,000 for 4.5GB (30days)XtraData2000 (30days)N3,500 for 12GB (30days)XtraData3500 (30days)N5,000 for 15GB (30days)XtraData5000 (30days)N10,000 for 40GB (30days)XtraData10000 (30days)N15,000 for 75GB (30days)XtraData20000 (30days)"}
{"input": "Will I be able to purchase the XtraValue bundle from any tariff plan?", "response": "Yes, you will be able to purchase any XtraValue bundle while on any prepaid tariff plan but as soon as the subscription is completed, you will be automatically migrated to XtraValue plan."}
{"input": "Will I be able to enjoy other MTN Products, Services, Offers and Promotions while on XtraValue Plan?", "response": "Yes, you will be able to enjoy all MTNN Products, Services, Offers, and Promotions while on XtraValue plan."}
{"input": "Where will my National, International calls, SMS and Data be charged from if I have an active XtraValue bundle?", "response": "All your national calls, international calls to the 7 (seven) selected destinations, SMS and Data will be deducted from your XtraValue bundle account until the bundle element is exhausted. As soon as the bundle elements are exhausted, your call, SMS and Data will be deducted from your normal main account or any active bonus account."}
{"input": "What happens if my bundle is exhausted, and I do not renew it?", "response": "Once you exhaust your bundle and you do not renew it, your SMS, calls, or data will be deducted from your main account at the tariff plan rate. Your national calls will be charged at 20.48k/sec, standard international call, and National SMS at N4.10.But as soon as you recharge up to the bundle fee, your bundle will be renewed automatically, and calls charged at the normal XtraValue bundle rate."}
{"input": "Will I be able to migrate to another plan and use my active bundle on the new tariff plan?", "response": "You will be able to migrate out of the XtraValue plan to another tariff plan even if you have an active XtraValue bundle BUT you will NOT be able to use the bundle balance on the plan you migrated to and the bundle will not auto-renew on the day of supposed renewal."}
{"input": "Will my expired bundle be auto-renewed even if I am not on XtraValue Plan?", "response": "No, your bundle will not renew while you are on another tariff plan."}
{"input": "Will I be allowed to purchase multiple XtraValue bundles while on the XtraValue plan?", "response": "Yes, you will be able to purchase multiple bundles while on the XtraValue plan. For example, you can purchase both XtraTalk 500 and XtraTalk 1000 together."}
{"input": "Will the system be able to renew my XtraValue Bundle after exhausting the bundle elements?", "response": "Yes, your XtraValue Bundle will renew automatically after exhausting either the airtime or data element depending on the bundle type and if you have enough airtime to purchase. Example:You have an active XtraTalk bundle and finish the airtime, your bundle will auto-renew even if you have not exhausted the data BUT you will ONLY be able to use the remaining data balance before the bundle expires.In the same way, if you have an active XtraData bundle and you exhaust the data, your bundle will auto-renew even if you have not exhausted the airtime BUT you will ONLY be able to use the remaining airtime balance before the bundle expires."}
{"input": "Will I be able to roll over my unused data and airtime if I renew my bundle before or after expiry?", "response": "No, you will NOT be able to rollover your unused data and airtime if you renew before expiry. Each Xtravalue bundle have different expiration date and all unused data and airtime will be cleared once the bundle expires.Example:You have an Xtratalk 2000 bundle that is to expire tomorrow, and if you activate the same bundle today, you will be able to enjoy the bundle balance of the previous Xtratalk 2000 bundle until it expires tomorrow. After tomorrow, the balance of the previous bundle will be cleared off then you will be able to use the new bundle."}
{"input": "How can I check my main account and XtraValue balance on the XtraValue plan?", "response": "You can check your main account balance, XtraValue bundle balance, and bundle expiry by dialling the code *310# & *310*61#"}
{"input": "Can I subscribe to different types of XtraValue bundles?", "response": "Yes, you can subscribe to different bundles at a time."}
{"input": "Will I be able to use my Xtravalue bundle while roaming?", "response": "Yes, you will be able to use some selected Xtravalue bundle plans while roaming in the eligible destination. Please see below the eligible bundle plans:XtraTalk 2000 & Data 2000XtraTalk 3500 & XtraData 3500XtraTalk 5000 & Data 5000XtraTalk 10000 & Data 10000XtraTalk 15000 & Data 15000XtraTalk 20000 & Data 20000"}
{"input": "Which countries are eligible for international destinations?", "response": "There are 6 eligible countries. The eligible countries are listed below:United StatesCanadaIndiaMalaysiaNorwaySouth Korea"}
{"input": "Can I subscribe to any Xtravalue bundle while roaming?", "response": "Yes, you will be able to subscribe to any of our Xtravalue bundle plans while roaming, however, if the bundle plan is not in the listed eligible XtraValue bundle plans allowed, you will NOT be able to use it even if you are in the eligible destinations."}
{"input": "Can I use the eligible Xtravalue bundle plan in any country while roaming?", "response": "No, you will ONLY be able to use the eligible XtraValue bundle plan while roaming in any of the eligible destinations.Refer to the table below for the eligible destinations."}
{"input": "What activities can I perform with my Xtravalue bundle while roaming?", "response": "You will be able to perform the following activities with the eligible XtraTalk or XtraData bundle plans:Make calls to eligible destinations and back home (Nigeria).Receive calls from eligible destinations.Send SMS to eligible destinations.Browse while roaming in eligible destinations."}
{"input": "Will I receive the same data volume or airtime value if I activate the Xtravalue bundles while roaming?", "response": "Yes, you will receive the same data volume or airtime value when you activate the XtraValue bundle plan while roaming but the depletion rate will be different from when you are back home.Example: If you activate XtraTalk20000 monthly bundle in Nigeria you will receive the same 4.5GB and N80,200 while roaming.Refer to table below for the charges."}
{"input": "Will I be charged the same rate when using the Xtravalue bundles locally or while roaming?", "response": "No, your calls/SMS and data rate while using the Xtravalue bundles locally or while roaming in the eligible destinations will be charged differently.Example: If you buy an XtraTalk2000 bundle that gives N7,850 + 650MB, your calls, SMS and Data will be charged at N27/min, N4/SMS, and N0.23/MB respectively while using it in Nigeria. However, while roaming, your calls, SMS, and Data within the eligible destinations will be charged at N630/min, N300/SMS, and N110/MB respectively. The reverse should apply when you return to Nigeria.Refer to the table below for the charges."}
{"input": "What happens, if I exhaust my Xtravalue Bundle or bundle has expired, and I call an eligible destination?", "response": "If you exhaust your bundle or your bundle has expired while roaming and you call an eligible destination, your calls/SMS/data will be charged from another Roaming bundle account (if available) otherwise from your main account and at the standard roaming rate."}
{"input": "What happens, if I have an active Xtravalue Bundle and I call a country not listed in the eligible destinations?", "response": "If you have an active Xtravalue bundle plan and you call any destination not in the eligible destinations, your calls/SMS/data will be charged first from a Roaming bundle account (if available) otherwise from your main account and at standard roaming rate."}
{"input": "If I have an active Xtravalue bundle balance while roaming, will I be able to use the bundle balance when I return to Nigeria?", "response": "Yes, you will be able to use the remaining bundle balance when you return to Nigeria, and you will be charged at the applicable local rates."}
{"input": "If I have an active Xtravalue bundle and a roaming bundle while roaming, which account will deplete first?", "response": "Your calls/SMS/data will be charged in this order:XtraValue bundle -> Roaming bundle account -> Main account."}
{"input": "What is the Virtual Recharge Bonus?", "response": "This is a recharge offer that gives customer 50% bonus on all recharges made via eligible virtual recharge channels. The 50% bonus is split into two â\u0080\u009330% airtime bonus.20% data bonus on recharge below N10,000. However, a recharge above N10,000 will ONLY get a flat amount of N2000 as data bonus."}
{"input": "Who can enjoy the 50% Virtual Recharge Bonus?", "response": "All MTN Prepaid and Postpaid customers can enjoy the Virtual recharge bonus."}
{"input": "What should I do to get the 50% virtual recharge bonus?", "response": "You can get the 50% virtual recharge bonus when you recharge via the eligible recharge channels listed below:1. MTN OnDemand (*904#)Bank Account optionDebit Card option2. myMTN NG app.Airtime recharge option ONLY."}
{"input": "How long will I be able to use the 50% bonus on virtual recharge?", "response": "The 50% virtual recharge bonus will be valid for 7 days BUT unused bonus will be cleared after 7days."}
{"input": "Will I be able to share my 50% virtual recharge bonus?", "response": "No. The 50% virtual recharge bonus canâ\u0080\u0099t be shared/transferred to another line."}
{"input": "If I have airtime balance on my line and I get 30% airtime bonus on virtual recharge, which of my balances will be charged first?", "response": "When you make calls, your 30% airtime bonus on virtual recharge will be charged first until it is exhausted after which call charges will now be from your main balance or any other balance on your line.Note: Some tariff plans like Pulse and XtraSpecial get charged from their main account for the first minute call of the day after which subsequent minutes will be charged from their 30% airtime bonus on virtual recharge or other balances, while other plans like Betatalk and YafunYafun get charged from their main account for the first and fifth minute call of the day after which subsequent minutes will be charged from their 30% airtime bonus on virtual recharge or other balances.Pulse and XtraspecialFirst minute: Main Account.Subsequent minutes: 30% airtime Bonus -> Other Airtime Bonus -> Main Account.Betatalk and YafunYafunFirst minute: Main Account.Second to fourth minute: 30% airtime bonus -> Betatalk/YafunYafun recharge bonus -> other bonuses.Fifth minute: Main AccountSubsequent minutes: 30% airtime bonus -> Betatalk/YafunYafun recharge bonus -> other bonuses."}
{"input": "Will I get 50% virtual recharge bonus when I receive or send airtime via MTN Share?", "response": "No. You will not get the 50% virtual recharge bonus when you receive or send airtime via MTN Share."}
{"input": "What activities can I perform with the 50% virtual recharge bonus?", "response": "You will be able to make local calls, send SMS and browse any website or app with the 30% airtime bonus and browse with the 20% data bonus on virtual recharge."}
{"input": "How much will I be charged when using the 50% virtual recharge bonus?", "response": "The table below contains the rate you will be charged from the 50% virtual recharge bonus.Â 30% airtime bonus on virtual recharge20% data bonus on virtual rechargeLocal Calls50k/sec (N30/min)N/ALocal SMSN4/SMSN/ALocal DataN15/MBN1/MB"}
{"input": "When will I be able to use the 50% virtual recharge bonus?", "response": "You will be able to use the 50% virtual recharge bonus at any time of the day."}
{"input": "How many times can I get the 50% virtual recharge bonus?", "response": "You will receive the 50% virtual recharge bonus for every recharge you make via the eligible channels."}
{"input": "What is MTN eShop?", "response": "MTN eShop is an online platform that brings convenience to our customers. It enables our customers browse and purchase from a wide range of products and services with ease in the comfort of their homes or at a click of a button. This products and services include smartphones, broadband routers, airtime, data bundles, etc. It enables a secure, convenient, and hassle-free experience for our customers which is our goal."}
{"input": "What items can be gotten from the eShop?", "response": "Products and services such as Data bundle purchase, Purchase of variety of devices; Smartphones, MTN 5G Broadband Router, MTN 4G Broadband Router, 4G MiFi, Enterprise services, Airtime Recharge, Bulk SMS etc."}
{"input": "How can one have access to the eShop?", "response": "You can access MTN eShop from any internet enabled device by either visiting the shop via MTNâ\u0080\u0099s corporate website https://mtn.ng/ OR shop directly via this link https://shop.mtn.ng/"}
{"input": "How do I log in", "response": "You can log in on MTN eShop by following the next steps: 1. Click on the profile iconÂ at the right of your screen. 2. Select your preferred login method (Facebook, Google account, Email or Phone number) and follow the prompt 3. You can now log in! Note: The phone number option is only available to MTN lines."}
{"input": "How do I register", "response": "You can create an account by following the next steps: 1. Click on profile icon at the right of your screen. 2. Select your preferred sign up method (Facebook, Google account, Email, Phone number) and follow the prompt 3. Your MTN eShop account is now created! Note: The phone number option is only available to MTN lines."}
{"input": "How do I place an order on MTN eShop?", "response": "To place an order on MTN eShop: 1. Enter the name of the item youâ\u0080\u0099d like to buy in the search bar. You can also browse for products by hovering or selecting â\u0080\u009cShopâ\u0080\u009d on the top left-hand side of your screen 2. Select the product/plan to learn more about it 3. Click â\u0080\u009cAdd to cartâ\u0080\u009d if you want to want to keep browsing for more products or click â\u0080\u009cBuy Nowâ\u0080\u009d to proceed to the checkout page 4. Register or login into your existing account by using the various log in options available to you 5. Enter your shipping/billing information ensuring your address is complete and accurate 6. Select a Delivery Method (This step is applicable for devices) 7. Choose your preferred Payment Method 8. Click on Order to complete your order."}
{"input": "I want to reset my password linked to my email address. What do I do?", "response": "You can reset your password by following these steps:1. On the login page click onÂ Donâ\u0080\u0099t remember your password 2. Enter your email address3. A password reset link will be sent to the email address you provided4. Click on the reset link sent to your email address5. Enter your new password and submit6. Use your new password for subsequent logins"}
{"input": "I am having trouble adding products to my cart. What do I do?", "response": "If you are having trouble adding a product to your cart, it may mean the following:â\u0080¢ If it is a device, please ensure that you have made all relevant size and color selections. It could also mean that the item you are trying to buy is sold out.â\u0080¢ If it is a data plan or digital service, it may mean that the number you are buying the bundle for is not eligible for this service.Â For additional information, you can contact our customer support team via email at customercareng@mtn.com or Dial 300 from an MTN line or 08031000300 from any other network."}
{"input": "How can I change the phone number on my account?", "response": "You can change your phone number on your account by following these steps: 1. Sign in to your account 2. Click on your name and select â\u0080\u009cMy accountâ\u0080\u009dÂ  3. Under personal information, click on Edit 4. In the mobile number section, click on the input box to edit your phone number 5. You will receive an OTP through SMS on the new phone number 6. Enter the OTP in the box 7. The phone number is now changed!"}
{"input": "Are prices on eShop negotiable?", "response": "No. Prices on MTN eShop are not negotiable. You may opt to use a promotional voucher for an added discount if available and usage conditions are met. Please keep an eye on our social media updates to be informed about our campaigns and flash sales for best prices."}
{"input": "Is there an option for pick-up or delivery?", "response": "There are options for delivery or pick up during the checkout process. For delivery, ordered items will be delivered to your address while for pick-up options, you will be able to pick up your items at an MTN Store close to you. For more information, you can contact our customer support team via email at customercare.ng@mtn.com or Dial 300 from an MTN line or 08031000300 from any other network for all inquiries."}
{"input": "What are the payment methods used in the eShop?", "response": "eShop has a variety of payment channels which includes Debit cards, Bank transfers, USSD, NQR, MoMo, and Airtime (for bundles)"}
{"input": "Can I make corporate or bulk purchases?", "response": "Yes, you can make a corporate purchase by going to the enterprise services option on the eShop homepage. And you can also add items to cart for bulk purchases."}
{"input": "What are your privacy policies?", "response": "We respect the privacy of our Customersâ\u0080\u0099 Information which should be protected through the use and interaction with https://shop.mtn.ng/, https://mtn.ng/ and all associated websites, mobile applications, products, and services. Go to Privacy and Cookie Policy | Shop MTN Nigeria to see the type of Personal Information we collect from You, Our Customers, and/or Users; how We will treat that Personal Information; and the circumstances under which We will share it with third parties"}
{"input": "Can I drop a review or give feedback on a product or service?", "response": "We value customer reviews and feedback, and that feature will be activated on the eShop soon"}
{"input": "How do I contact customer services?", "response": "You can contact our customer services via email at customercare.ng@mtn.com or dial 300 from an MTN line or 08031000300 from any other network for all inquiries."}
{"input": "Do you offer discounts or promotions?", "response": "Discounts or promotions will be announced on the eShop when or if any is available"}
{"input": "I am having trouble signing into eShop, what should I do?", "response": "If you have a problem signing up on eShop, please contact customer service via email at customercare.ng@mtn.com or Dial 300 from an MTN line or 08031000300 for all inquiries."}
{"input": "How do I check the status of my order?", "response": "To check the status of your order, simply login to your account and navigate to the My Account section on your profile and select My orders"}
{"input": "If I receive damaged or defective products, what should I do?", "response": "You are allowed to return such defective devices, and after a few investigations, the device will be replaced"}
{"input": "Can I pay on delivery?", "response": "Currently, we do not offer payment on delivery as a payment option. We require all payments to be made through our secure platform before any services are rendered or products are shipped"}
{"input": "My payment was not successful, but my account got debited, what do I do?", "response": "Please send the proof of payment to eShopsupport.ng@mtn.com so that we can investigate and rectify the situation"}
{"input": "What currencies do you accept?", "response": "Payments on eShop are in NGN (Naira)"}
{"input": "Do you offer installment payments?", "response": "No. It is expected that you pay for your product in full."}
{"input": "Can I change or cancel my order?", "response": "No. Once an order is placed and payment has been made, you will be unable to make any cancellations. Please review your order thoroughly before finalizing it to ensure that it aligns with your requirements."}
{"input": "I placed an order, but never received a confirmation email, what do I do?", "response": "Please send the proof of payment to eShopsupport.ng@mtn.com so that we can investigate and rectify the situation"}
{"input": "How soon can I pick up my order from your store?", "response": "Your orders will be ready for pick up after a period of 24 hours."}
{"input": "What happens if my package is lost or stolen?", "response": "Please send an email to eShopsupport.ng@mtn.com so that we can investigate and rectify the situation."}
{"input": "How can I track my order?", "response": "To track your order, simply log in to your account and navigate to the My Account section on your profile and select My orders, there you will be able to see the status of your order whether active, pending, completed or canceled orders. To see more details on your order, click â\u0080\u0098view order details. You also receive status updates via email and SMS notifications to keep you easily updated. For more information, you can contact our customer support team via email at customercare.ng@mtn.com or Dial 300 from an MTN line or  08031000300 from any other network for all inquiries."}
{"input": "My tracking shows delivered, but I never received it. What do I do?", "response": "Please send the proof of payment to eShopsupport.ng@mtn.com so that we can investigate and rectify the situation"}
{"input": "What is the duration of delivery?", "response": "Delivery usually takes between 2 - 8 working days (including Saturdays), to get your product delivered to you, depending on your location and the availability of the product. When you place an order on eShop, you will receive an estimated delivery date for your order. Please click here for more information on delivery timelines."}
{"input": "Which locations do you deliver to?", "response": "Delivery is available in 33 states, except for Benue, Katsina, Taraba and Zamfara."}
{"input": "What happens when I don't find my city?", "response": "You may re-route your delivery to a city closest to your location or use the pick-up option to pick up from selected MTN Service Centers."}
{"input": "What will happen if I am not at home/office?", "response": "Your delivery will be re-scheduled if you are not available to receive your order. However, re-scheduling can only be done twice."}
{"input": "Do you offer international shipping?", "response": "No. Only nationwide delivery is available for now."}
{"input": "Can I change or update my shipping address?", "response": "It is not possible to change the delivery address once the payment has been processed. It is important to double-check all your information before submitting your order to ensure that it is accurate and up to date."}
{"input": "Do you offer free shipping?", "response": "No, the cost of delivery will be handled by the purchaser irrespective of the amount of product bought."}
{"input": "Is there a refund policy?", "response": "Yes. Please refer to our return policy for more information on our warranty terms and conditions. For more information, you can contact our customer support team via email at customercare.ng@mtn.com or Dial 300 from an MTN line or 08031000300 from any other network for all inquiries."}
{"input": "How can I return my faulty device?", "response": "You can log a complaint about your damaged device on our Faulty Device portal OR visit any of the MTN Service Centers listed here to return any defective product."}
{"input": "What's the warranty on my device?", "response": "Our broadband devices come with a one-year warranty. If your device is found to be defective within the warranty period, we will repair or replace it (as applicable) free of charge. Log a complaint about your damaged device on our Faulty Device portal. Please keep in mind that the warranty does not cover damage caused by accidents, misuse, or unauthorized modifications."}
{"input": "Can I get a refund if I do not want my device again?", "response": "We do not offer refunds items you are no longer interested in as per our return policy. However, we do offer warranty repairs or replacements if your device is found to be faulty within the warranty period. Please refer to our return policy for more information on our warranty terms and conditions. For more information, you can contact our customer support team via email at customercare.ng@mtn.com or Dial 300 from an MTN line or 08031000300 from any other network for all inquiries."}
{"input": "What are the Requirements for a valid return on eShop?", "response": "If your device is found to be defective within the warranty period, we will repair or replace it (as applicable) free of charge. However, please keep in mind that the warranty does not cover damage caused by accidents, misuse, or unauthorized modifications."}
{"input": "What is MTN?", "response": "MTN is a leading telecommunications company offering voice, data, and digital services in Africa and the Middle East."}
{"input": "Where is MTN headquartered?", "response": "MTN is headquartered in Johannesburg, South Africa."}
{"input": "What is MTN's customer care number?", "response": "Dial 180 from an MTN line or 08031000180 from other networks to reach MTN customer care."}
{"input": "What is MTN Pulse?", "response": "MTN Pulse is a prepaid plan offering discounted call rates, data bundles, and exclusive lifestyle benefits."}
{"input": "How do I migrate to MTN Pulse?", "response": "Dial *406# to migrate to MTN Pulse."}
{"input": "What is MTN BetaTalk?", "response": "MTN BetaTalk gives bonus airtime on recharges of N100 or more and allows discounted calls to all networks."}
{"input": "How can I activate MTN BetaTalk?", "response": "Dial *123*2*6# to activate MTN BetaTalk."}
{"input": "What is MTN Data bundle?", "response": "MTN Data bundles provide affordable internet access through various data plans suitable for all lifestyles."}
{"input": "How do I subscribe to an MTN Data bundle?", "response": "Dial *131# or use the myMTN app to subscribe to an MTN Data bundle."}
{"input": "What is MTN XtraValue?", "response": "MTN XtraValue offers combined bundles of voice and data for customers who need both services."}
{"input": "How do I activate MTN XtraValue?", "response": "Dial *131*2# and select your preferred XtraValue plan."}
{"input": "What is MTN MoMo?", "response": "MTN MoMo is a mobile money service that facilitates money transfers, bill payments, and other financial transactions."}
{"input": "How can I register for MTN MoMo?", "response": "Visit an MTN service center or dial *502# to register for MTN MoMo."}
{"input": "What is the MTN welcome back offer?", "response": "The MTN Welcome Back Offer provides discounts on calls, data, and SMS for inactive subscribers."}
{"input": "How do I check my MTN airtime balance?", "response": "Dial *556# to check your airtime balance on MTN."}
{"input": "How do I check my MTN data balance?", "response": "Dial *131*4# to check your MTN data balance."}
{"input": "What is MTN Family and Friends?", "response": "MTN Family and Friends lets customers enjoy discounted call rates to selected numbers."}
{"input": "How can I add numbers to MTN Family and Friends?", "response": "Dial *560*1# to add numbers to MTN Family and Friends."}
{"input": "What is MTN Data Share?", "response": "MTN Data Share allows users to share their data bundles with other MTN customers."}
{"input": "How do I activate MTN Data Share?", "response": "Dial *131*2# to activate MTN Data Share and follow the prompts."}
{"input": "What is MTN Zigi?", "response": "MTN Zigi is a virtual assistant that helps with inquiries, subscription management, and other MTN services."}
{"input": "How can I access MTN Zigi?", "response": "MTN Zigi is available on WhatsApp and the myMTN app."}
{"input": "What is the MTN Night Plan?", "response": "The MTN Night Plan offers discounted data bundles for use during nighttime hours."}
{"input": "How can I subscribe to MTN Night Plan?", "response": "Dial *406# to subscribe to MTN Night Plan."}
{"input": "What is MTN TopIt?", "response": "MTN TopIt is a self-service platform for airtime and data bundle purchases."}
{"input": "How do I access MTN TopIt?", "response": "MTN TopIt is accessible through USSD codes or the MTN website."}
{"input": "What is the MTN Data Bonus?", "response": "The MTN Data Bonus gives customers extra data on selected bundle purchases."}
{"input": "How do I redeem my MTN Data Bonus?", "response": "Your MTN Data Bonus is automatically activated after eligible bundle purchases."}
{"input": "What is MTN's official website?", "response": "The official website for MTN is www.mtn.com."}
{"input": "How do I block my MTN line?", "response": "Call customer care or dial *180# to block your MTN line if it's stolen or lost."}
{"input": "What is MTN Roaming?", "response": "MTN Roaming allows you to use your line for calls, SMS, and data in other countries."}
{"input": "How can I activate MTN Roaming?", "response": "Dial *123# or visit an MTN service center to activate roaming services."}
{"input": "What is MTN SIM Swap?", "response": "MTN SIM Swap is a service for replacing a lost or damaged SIM card while retaining your number."}
{"input": "How do I perform an MTN SIM Swap?", "response": "Visit an MTN service center with a valid ID to request a SIM Swap."}
{"input": "What is MTN CallerTunez?", "response": "MTN CallerTunez allows you to set music or sound as your caller ringtone."}
{"input": "How do I subscribe to MTN CallerTunez?", "response": "Dial *410# to subscribe to MTN CallerTunez."}
{"input": "What is MTN ShortCode for Balance Check?", "response": "Dial *556# to check your balance on MTN."}
{"input": "What is MTN SME Data Share?", "response": "MTN SME Data Share allows businesses to share data bundles with employees or clients."}
{"input": "How do I activate MTN SME Data Share?", "response": "Dial *461# and follow the instructions to activate SME Data Share."}
{"input": "What is MTN Auto Renewal?", "response": "MTN Auto Renewal renews your data or voice bundle automatically when it expires."}
{"input": "How do I deactivate MTN Auto Renewal?", "response": "Send STOP to 131 or dial *131# to manage auto-renewal settings."}
{"input": "What is MTN TruTalk?", "response": "MTN TruTalk is a tariff plan offering flat rates for calls across all networks."}
{"input": "How do I migrate to MTN TruTalk?", "response": "Dial *123*20# to migrate to MTN TruTalk."}
{"input": "What is MTN Awuf4U?", "response": "MTN Awuf4U gives bonus airtime on recharges through specific channels."}
{"input": "How do I activate MTN Awuf4U?", "response": "Recharge using *888*PIN# to activate MTN Awuf4U."}
{"input": "What is the MTN Share 'n' Sell?", "response": "MTN Share 'n' Sell allows customers to transfer airtime to other MTN users."}
{"input": "How do I use MTN Share 'n' Sell?", "response": "Dial *600*Recipient's Number*Amount*PIN# to transfer airtime."}
{"input": "What is MTN EVD?", "response": "MTN EVD is an electronic voucher distribution system for airtime recharge."}
{"input": "How can I recharge using MTN EVD?", "response": "Purchase a PIN or use electronic recharge through MTN agents."}
{"input": "What is MTN Mobile Internet?", "response": "MTN Mobile Internet provides high-speed internet access through 4G LTE and 5G networks."}
{"input": "How can I check MTN coverage in my area?", "response": "Visit the MTN website or contact customer care to check coverage in your location."}
{"input": "What is MTN's full name?", "response": "MTN stands for Mobile Telecommunications Network."}
{"input": "When was MTN founded?", "response": "MTN was founded in 1994."}
{"input": "In how many countries does MTN operate?", "response": "MTN operates in over 20 countries across Africa and the Middle East."}
{"input": "What is MTN Yellow Diamond?", "response": "MTN Yellow Diamond is a reward program for loyal customers, offering exclusive benefits."}
{"input": "How can I join MTN Yellow Diamond?", "response": "Yellow Diamond membership is by invitation based on usage and loyalty."}
{"input": "What is MTN Home Wi-Fi?", "response": "MTN Home Wi-Fi offers high-speed internet for homes and small offices."}
{"input": "How do I set up MTN Home Wi-Fi?", "response": "Visit an MTN service center or call customer care for installation assistance."}
{"input": "What is MTN APN?", "response": "MTN Access Point Name (APN) settings enable internet access on devices."}
{"input": "How do I configure MTN APN settings?", "response": "Go to your device settings and input MTN APN details manually or automatically."}
{"input": "What is MTN Smart Feature Phone?", "response": "MTN Smart Feature Phone is an affordable device that combines smartphone and feature phone capabilities."}
{"input": "What is the MTN Loyalty Program?", "response": "The MTN Loyalty Program rewards customers with points for their usage, redeemable for airtime or data."}
{"input": "How do I redeem MTN loyalty points?", "response": "Dial *406# to check and redeem your MTN loyalty points."}
{"input": "What is MTN Corporate Plan?", "response": "MTN Corporate Plan provides tailored services for businesses, including data, voice, and cloud solutions."}
{"input": "How can I subscribe to MTN Corporate Plan?", "response": "Contact the MTN Enterprise team to subscribe to the MTN Corporate Plan."}
{"input": "What is MTN YouTube Plan?", "response": "MTN YouTube Plan offers discounted data bundles for streaming on YouTube."}
{"input": "How do I activate MTN YouTube Plan?", "response": "Dial *131*3# and select the YouTube bundle option."}
{"input": "What is MTN MusicTime?", "response": "MTN MusicTime provides unlimited music streaming within a specific timeframe."}
{"input": "How do I subscribe to MTN MusicTime?", "response": "Dial *123# and follow the prompts to subscribe to MusicTime."}
{"input": "What is MTN Device Financing?", "response": "MTN Device Financing allows customers to purchase smartphones in installments."}
{"input": "How can I apply for MTN Device Financing?", "response": "Visit an MTN store with a valid ID and meet the eligibility criteria to apply."}
{"input": "What is MTN Caller Protection?", "response": "MTN Caller Protection identifies and blocks unwanted calls automatically."}
{"input": "How do I activate MTN Caller Protection?", "response": "Dial *123# and follow the prompts to activate MTN Caller Protection."}
{"input": "What is MTN Trade Partner?", "response": "MTN Trade Partner program supports businesses selling MTN products and services."}
{"input": "How do I become an MTN Trade Partner?", "response": "Visit the MTN website or contact their trade partner support team to apply."}
{"input": "What is MTN Broadband?", "response": "MTN Broadband provides high-speed internet for residential and business customers."}
{"input": "What is the MTN SME Value Pack?", "response": "MTN SME Value Pack offers customized bundles for small and medium enterprises."}
{"input": "What is MTN Zone?", "response": "MTN Zone offers discounted call rates based on your location and time of day."}
{"input": "How do I activate MTN Zone?", "response": "Dial *135# to activate MTN Zone on your line."}
{"input": "What is MTN Booster Bundle?", "response": "MTN Booster Bundle allows customers to top up their existing data plans with extra data."}
{"input": "How do I purchase an MTN Booster Bundle?", "response": "Dial *131# and select the Booster Bundle option."}
{"input": "What is MTN Hybrid Plans?", "response": "MTN Hybrid Plans combine postpaid and prepaid services for flexibility."}
{"input": "How can I subscribe to MTN Hybrid Plans?", "response": "Contact MTN customer care or visit an MTN store to subscribe."}
{"input": "What is MTN Family Plan?", "response": "MTN Family Plan offers shared data and voice bundles for family members."}
{"input": "How do I set up an MTN Family Plan?", "response": "Dial *131# and follow the prompts to configure an MTN Family Plan."}
{"input": "What is MTN GlobalConnect?", "response": "MTN GlobalConnect provides international connectivity solutions for businesses."}
{"input": "What is MTN Elite Bundle?", "response": "MTN Elite Bundle offers premium data and voice services for high-value customers."}
{"input": "How do I subscribe to MTN Elite Bundle?", "response": "Dial *131# and select Elite Bundle under the premium plans."}
{"input": "What is MTN International Roaming?", "response": "MTN International Roaming allows seamless communication when traveling abroad."}
{"input": "What is MTN Keep My Number?", "response": "MTN Keep My Number prevents your SIM from deactivation due to inactivity."}
{"input": "How do I activate MTN Keep My Number?", "response": "Dial *365# to activate Keep My Number."}
{"input": "What is MTN Cloud Services?", "response": "MTN Cloud Services provide cloud storage, hosting, and backup solutions for businesses."}
{"input": "How do I access MTN Cloud Services?", "response": "Visit the MTN website to sign up for their Cloud Services."}
{"input": "What is MTN E-learning?", "response": "MTN E-learning provides online education platforms and resources for students and teachers."}
{"input": "What is MTN Sports Portal?", "response": "MTN Sports Portal offers updates, live scores, and sports content to subscribers."}
{"input": "What is MTN Emergency Airtime?", "response": "MTN Emergency Airtime lets you borrow airtime and pay back later."}
{"input": "How do I request MTN Emergency Airtime?", "response": "Dial *606# to request Emergency Airtime."}
{"input": "What is MTN Device Insurance?", "response": "MTN Device Insurance covers accidental damage, theft, or loss of your device."}
{"input": "How do I enroll in MTN Device Insurance?", "response": "Contact MTN or visit their website for details on enrolling in Device Insurance."}
{"input": "What is MTN Fiber Broadband?", "response": "MTN Fiber Broadband delivers high-speed internet through fiber optic technology."}
{"input": "What is MTN Direct Recharge?", "response": "MTN Direct Recharge allows customers to recharge airtime directly to their phone without a PIN."}
{"input": "What is MTN Nigeria?", "response": "MTN Nigeria is a subsidiary of the MTN Group, a multinational telecommunications company headquartered in South Africa. It provides mobile network services, data, and other digital solutions to millions of Nigerians."}
{"input": "How can I check my MTN airtime balance?", "response": "You can check your MTN airtime balance by dialing *556# or using the myMTN App. The balance will be displayed on your screen immediately."}
{"input": "What is MTN Pulse?", "response": "MTN Pulse is a tariff plan designed for young people, offering affordable call rates, exclusive data bundles, and entertainment subscriptions. It includes perks like Pulse Night bundles and social media data plans."}
{"input": "How do I migrate to MTN Pulse?", "response": "Dial *406# and select \"Pulse\" from the menu or text '406' to 131. Ensure you do not have an active migration restriction before proceeding."}
{"input": "What is MTN XtraValue?", "response": "MTN XtraValue is a plan that bundles airtime and data for customers who want to enjoy both services simultaneously. It includes options for calls, browsing, and international services."}
{"input": "How can I subscribe to MTN XtraValue?", "response": "Dial *131# and select XtraValue from the menu or use the myMTN App. You can choose either an XtraTalk plan for more airtime or XtraData for more data."}
{"input": "What is MTN's default PIN for SIM registration?", "response": "MTN\u0092s default PIN is usually set to \"0000\" or \"1234\". It is advisable to change this PIN to secure your SIM against unauthorized use."}
{"input": "How do I change my MTN PIN?", "response": "Dial 1215# to access the security settings menu. Follow the prompts to change your default PIN to a personalized one."}
{"input": "What is the MTN YouTube Night Plan?", "response": "MTN YouTube Night Plan allows users to stream videos on YouTube at discounted rates during nighttime hours, typically between 11 PM and 6 AM."}
{"input": "How do I activate the MTN YouTube Night Plan?", "response": "Dial *131# and select the YouTube Night Plan from the data menu or activate it using the myMTN App."}
{"input": "What is MTN SME Data Share?", "response": "MTN SME Data Share allows businesses to purchase data in bulk and share it with employees, colleagues, or family members. It is ideal for organizations looking to manage their data resources efficiently."}
{"input": "How can I share data using MTN SME Data Share?", "response": "Dial *461# and select the \"Share Data\" option. Enter the recipient's phone number and specify the data volume to share."}
{"input": "What is the MTN Data Gifting service?", "response": "MTN Data Gifting allows customers to purchase data bundles and send them directly to other MTN users as a gift."}
{"input": "How do I send data using MTN Data Gifting?", "response": "Dial 1317# and follow the prompts to gift data to a friend or family member. Alternatively, you can use the myMTN App for this purpose."}
{"input": "What is MTN mPulse?", "response": "MTN mPulse is a platform designed for kids and teenagers. It offers educational resources, fun games, and special data bundles to encourage learning and creativity in young users."}
{"input": "How can I activate MTN mPulse?", "response": "To migrate to the mPulse plan, dial 3441# or send 'mPulse' to 131. Parents can also activate parental control features on the platform."}
{"input": "What is MTN Welcome Back?", "response": "MTN Welcome Back is a program that allows customers to reactivate dormant or inactive SIM cards and enjoy bonus airtime or data rewards for returning to the network."}
{"input": "How do I reactivate my dormant MTN SIM card?", "response": "Insert your dormant SIM card into your phone and recharge with a specified amount to qualify for Welcome Back bonuses. Contact MTN customer care for further assistance."}
{"input": "What is MTN MoMo?", "response": "MTN MoMo (Mobile Money) is a digital financial service that allows users to send, receive, and store money using their mobile devices. It also supports bill payments and airtime top-ups."}
{"input": "How can I register for MTN MoMo?", "response": "Visit an MTN service center with a valid ID or download the MoMo app. Alternatively, dial *671# and follow the registration prompts."}
{"input": "What is MTN Magic Voice?", "response": "MTN Magic Voice is a fun service that allows users to change their voice during a phone call to mimic different characters or personalities, providing an entertaining call experience."}
{"input": "How do I activate MTN Magic Voice?", "response": "Dial 700 and follow the voice prompts to select your preferred voice type and enjoy the Magic Voice service."}
{"input": "What is MTN CallerFeel?", "response": "MTN CallerFeel allows customers to display personalized messages for their callers. These messages can be inspirational quotes, status updates, or promotional content for businesses."}
{"input": "How do I set up MTN CallerFeel?", "response": "Dial *500# to access the CallerFeel menu and create your personalized message. You can also manage your messages via the myMTN App."}
{"input": "What is MTN International Calling Bundle?", "response": "MTN International Calling Bundle offers discounted call rates to specific international destinations. It is suitable for customers who make frequent international calls."}
{"input": "How do I subscribe to MTN International Calling Bundle?", "response": "Dial *131# and select \"International Bundles\" from the menu. Choose a bundle that suits your needs."}
{"input": "What is MTN Family and Friends?", "response": "MTN Family and Friends allows customers to register up to 5 numbers to enjoy discounted call rates when calling these specific contacts."}
{"input": "How do I add a number to MTN Family and Friends?", "response": "Dial *560# to register or manage your Family and Friends numbers. Ensure you are on a compatible tariff plan."}
{"input": "What is MTN XtraTime?", "response": "MTN XtraTime allows customers to borrow airtime when they run out, with the borrowed amount deducted from their next recharge."}
{"input": "How do I borrow airtime using MTN XtraTime?", "response": "Dial *606# and follow the prompts to borrow airtime. Eligibility depends on your usage history and recharge frequency."}
{"input": "What is MTN Roaming Service?", "response": "MTN Roaming Service allows customers to use their mobile phones for calls, texts, and internet access while traveling abroad."}
{"input": "How do I activate MTN Roaming Service?", "response": "Ensure your line is pre-activated for roaming by visiting an MTN store or contacting customer care. Dial *123# for roaming bundle options."}
{"input": "What is MTN MyTunes?", "response": "MTN MyTunes is a caller ring-back tone service that allows customers to personalize the music or messages their callers hear instead of the standard ringing tone."}
{"input": "How do I activate MTN MyTunes?", "response": "Dial *410# to browse and select your preferred tunes. You can also manage your tunes via the myMTN App."}
{"input": "What is MTN Mobile TV?", "response": "MTN Mobile TV offers live streaming of TV channels and video content directly on mobile devices. It provides entertainment, news, sports, and educational programs."}
{"input": "How do I access MTN Mobile TV?", "response": "Dial *123# to subscribe to Mobile TV services or use the MTN Mobile TV app available for download."}
{"input": "What is MTN Yellow Diamond?", "response": "MTN Yellow Diamond is a premium service designed for high-value customers, offering exclusive benefits like priority customer care, customized offers, and special invites to events."}
{"input": "How do I qualify for MTN Yellow Diamond?", "response": "Qualification is based on your airtime and data usage history. MTN contacts eligible customers directly to invite them to the Yellow Diamond program."}
{"input": "What is MTN Data4Me?", "response": "MTN Data4Me offers personalized data bundles tailored to individual customers based on their usage patterns and preferences."}
{"input": "How do I subscribe to MTN Data4Me?", "response": "Dial 1311# or visit the myMTN App to view and activate personalized Data4Me offers."}
{"input": "What is MTN Auto-Renewal?", "response": "MTN Auto-Renewal ensures that your active data plan is automatically renewed when it expires, provided you have sufficient airtime balance."}
{"input": "How do I enable MTN Auto-Renewal?", "response": "Dial 1311# to activate auto-renewal when subscribing to a data plan. You can also manage this feature on the myMTN App."}
{"input": "What is MTN Social Bundle?", "response": "MTN Social Bundle offers affordable data plans specifically for social media platforms like Facebook, WhatsApp, Instagram, and Twitter."}
{"input": "How do I activate MTN Social Bundle?", "response": "Dial 1313# and select your preferred social media bundle from the options provided."}
{"input": "What is MTN StartPack?", "response": "MTN StartPack is a special tariff plan for new customers, offering bonus airtime and data for calls, browsing, and text messages within the first six months of activation."}
{"input": "How do I migrate to MTN StartPack?", "response": "New MTN SIM cards are pre-activated on the StartPack plan. For assistance, visit any MTN service center or contact customer care."}
{"input": "What is MTN Back-Up Service?", "response": "MTN Back-Up Service securely stores your contacts and important data in the cloud, allowing you to retrieve them anytime, even if your device is lost or damaged."}
{"input": "How do I activate MTN Back-Up Service?", "response": "Dial *305# or access the back-up service via the myMTN App. Follow the prompts to set up your account and start syncing your data."}
{"input": "What is MTN Jara?", "response": "MTN Jara is a value-added service that rewards customers with bonuses on every recharge, allowing them to enjoy extra airtime or data at no additional cost."}
{"input": "How do I opt into MTN Jara?", "response": "Dial *131# and select Jara from the menu or recharge using 555PIN#. The bonus will be automatically credited to your account."}
{"input": "What is MTN KYC Verification?", "response": "MTN KYC (Know Your Customer) Verification is a regulatory process where customers\u0092 identities are confirmed using valid identification documents like a National ID, Passport, or Driver\u0092s License."}
{"input": "How do I update my MTN KYC details?", "response": "Visit any MTN service center with your valid ID and follow the verification process to update your records."}
{"input": "What is MTN BizPlus?", "response": "MTN BizPlus is a business-focused service offering discounted call rates, bulk SMS options, and flexible data plans for small and medium-sized enterprises (SMEs)."}
{"input": "How do I subscribe to MTN BizPlus?", "response": "Contact the MTN business team or dial 1315# to activate a suitable BizPlus package for your business needs."}
{"input": "What is MTN Play?", "response": "MTN Play is an entertainment platform that offers music, games, videos, and sports content to MTN users."}
{"input": "How do I access MTN Play?", "response": "Visit the MTN Play website at play.mtnonline.com or download the MTN Play app for quick access to entertainment options."}
{"input": "What is MTN Home Broadband?", "response": "MTN Home Broadband provides high-speed internet solutions for homes using 4G and 5G routers, ensuring seamless connectivity for multiple devices."}
{"input": "How do I subscribe to MTN Home Broadband?", "response": "Visit an MTN service center or call customer care to purchase a router and choose a suitable broadband plan."}
{"input": "What is MTN Smart Number?", "response": "MTN Smart Number is a premium service that allows customers to choose memorable phone numbers for personal or business use, making it easier for people to remember their contact details."}
{"input": "How do I get an MTN Smart Number?", "response": "Visit an MTN service center and inquire about available Smart Numbers. You may need to pay a premium for certain categories of numbers."}
{"input": "What is MTN Free Basics?", "response": "MTN Free Basics offers free access to select websites and online services, promoting digital inclusion by enabling users to browse educational and health-related platforms without data charges."}
{"input": "How do I access MTN Free Basics?", "response": "Visit www.freebasics.com using your MTN SIM card to enjoy free access to participating websites."}
{"input": "What is MTN Do Not Disturb (DND)?", "response": "MTN Do Not Disturb (DND) is a service that allows customers to block unsolicited marketing messages and calls from third-party providers."}
{"input": "How do I activate MTN DND?", "response": "Send \"STOP\" to 2442 to activate full DND or \"ALLOW\" to 2442 for partial DND, depending on your preference."}
{"input": "What is MTN Data Rollover?", "response": "MTN Data Rollover ensures that unused data from an active bundle is carried over to the next subscription period if renewed before expiration."}
{"input": "How do I activate MTN Data Rollover?", "response": "Simply renew your current data plan before its expiration, and the unused data will automatically roll over."}
{"input": "What is MTN Pay4Me?", "response": "MTN Pay4Me allows a caller to initiate a call and have the recipient agree to pay for the call charges."}
{"input": "How do I use MTN Pay4Me?", "response": "Dial the recipient's number with \"121\" as a prefix, e.g., 1210803XXXXXXX. The recipient will be prompted to accept the charges before the call connects."}
{"input": "What is MTN HynetFlex?", "response": "MTN HynetFlex is a high-speed broadband service designed for homes and businesses, offering flexible data plans and reliable connectivity."}
{"input": "How do I subscribe to MTN HynetFlex?", "response": "Visit the MTN HynetFlex website or an MTN service center to choose a suitable plan and purchase the required device."}
{"input": "What is MTN Group?", "response": "MTN Group is a leading telecommunications company operating in multiple countries across Africa and the Middle East, providing mobile, data, and digital solutions."}
{"input": "When was MTN Nigeria established?", "response": "MTN Nigeria was established in 2001 and has since grown to become one of the largest telecom operators in the country, serving millions of subscribers."}
{"input": "What is MTN XtraValue?", "response": "MTN XtraValue is a bundle plan offering a combination of voice call airtime and data, allowing customers to enjoy both services in a single subscription. The bundles cater to different needs with varying validity periods."}
{"input": "How do I activate MTN XtraValue?", "response": "Dial 1312# and choose your preferred XtraValue plan. You can also activate the plan through the myMTN App by navigating to the XtraValue section."}
{"input": "What is MTN Pulse?", "response": "MTN Pulse is a youth-focused tariff plan offering low call rates, discounted data bundles, and lifestyle benefits, including access to exclusive entertainment content and campus events."}
{"input": "How do I migrate to MTN Pulse?", "response": "Dial *406# and select \"1\" to join MTN Pulse. Alternatively, send \"406\" to 131 via SMS."}
{"input": "What is MTN mPulse?", "response": "MTN mPulse is a special plan for teenagers aged 9\u009615, offering affordable call and data rates, access to educational content, and exciting offers on the mPulse platform."}
{"input": "How do I activate MTN mPulse?", "response": "Dial 3441# or send \"mPulse\" to 344. Parents can also manage the subscription on behalf of their children via the myMTN App."}
{"input": "What is MTN Prestige?", "response": "MTN Prestige is an exclusive program for high-value customers, providing premium services such as priority care, dedicated account managers, and exclusive offers tailored to individual preferences."}
{"input": "How do I become an MTN Prestige member?", "response": "MTN Prestige membership is by invitation, based on your usage history and loyalty to the MTN network. Eligible customers are contacted directly by MTN."}
{"input": "What is MTN Roaming?", "response": "MTN Roaming allows customers to use their MTN SIM card to make calls, send SMS, and use data services in foreign countries, ensuring seamless connectivity while traveling abroad."}
{"input": "How do I activate MTN Roaming?", "response": "Dial 1315# to activate roaming services. Ensure you have sufficient airtime or an active roaming bundle before traveling."}
{"input": "What is MTN Welcome Back Offer?", "response": "MTN Welcome Back Offer is a special package for customers who have not used their MTN line for an extended period, providing bonuses on calls and data to encourage them to reconnect."}
{"input": "How do I qualify for the MTN Welcome Back Offer?", "response": "Simply reactivate your dormant MTN line by recharging and using it for calls, SMS, or data. The offer is automatically applied if you meet the eligibility criteria."}
{"input": "What is MTN CallerFeel?", "response": "MTN CallerFeel allows customers to set up personalized messages that appear on the screen of the person calling them. This can include greetings, quotes, or promotional messages."}
{"input": "How do I set up MTN CallerFeel?", "response": "Dial 1352# to create and activate your CallerFeel message. You can also manage this feature on the myMTN App."}
{"input": "What is MTN Magic Voice?", "response": "MTN Magic Voice lets users change their voice during calls to sound like a cartoon character, robot, or other funny voices, adding a playful touch to conversations."}
{"input": "How do I activate MTN Magic Voice?", "response": "Dial 1324# to subscribe and select your preferred voice. To use the service during a call, press the assigned key for the desired voice effect."}
{"input": "What is MTN YafunYafun?", "response": "MTN YafunYafun is a promotional offer that provides new MTN customers with free airtime and data bonuses on every recharge, enabling them to explore MTN services without extra costs."}
{"input": "How do I enjoy MTN YafunYafun benefits?", "response": "Simply purchase and activate a new MTN SIM card. The YafunYafun bonuses are automatically credited upon recharging."}
{"input": "What is MTN SME Data Share?", "response": "MTN SME Data Share is a service that allows businesses to purchase bulk data and share it among employees, customers, or family members, ensuring everyone stays connected."}
{"input": "How do I activate MTN SME Data Share?", "response": "Register as an SME Data Share user at any MTN service center. Once registered, dial *461# to purchase and share data bundles with beneficiaries."}
{"input": "What is MTN 4G LTE?", "response": "MTN 4G LTE provides high-speed internet connectivity with faster download and upload speeds, reduced buffering during streaming, and enhanced online gaming experiences."}
{"input": "How do I upgrade to MTN 4G LTE?", "response": "Visit an MTN service center with your current SIM card for a free upgrade to a 4G SIM. Ensure your device supports 4G LTE and configure the APN settings as required."}
{"input": "What is MTN 5G?", "response": "MTN 5G is the next-generation network technology offering ultra-fast internet speeds, low latency, and seamless connectivity for applications like virtual reality, smart homes, and autonomous vehicles."}
{"input": "How do I access MTN 5G services?", "response": "Ensure you have a 5G-enabled device and a compatible MTN SIM card. MTN 5G is available in select locations, so check the coverage in your area before activation."}
{"input": "What is MTN BetaTalk?", "response": "MTN BetaTalk is a tariff plan that rewards customers with bonus airtime and data upon recharging, enabling them to enjoy extended talk time and internet access."}
{"input": "How do I migrate to MTN BetaTalk?", "response": "Dial 1232*6# or send \"BT\" to 131 via SMS to join the BetaTalk tariff plan."}
{"input": "What is MTN Game+?", "response": "MTN Game+ is an online gaming platform that provides access to a wide variety of games, including action, adventure, sports, and puzzle genres, allowing users to play and compete with friends."}
{"input": "How do I subscribe to MTN Game+?", "response": "Visit the MTN Game+ portal at game.mtnonline.com or download the MTN Game+ app to access the subscription options."}
{"input": "What is MTN Biz Data?", "response": "MTN Biz Data is a solution designed for businesses, offering flexible data plans that support seamless communication and online operations for employees and customers."}
{"input": "How do I subscribe to MTN Biz Data?", "response": "Contact the MTN business team or visit the nearest MTN service center to set up a Biz Data plan tailored to your organization's needs."}
{"input": "What is MTN Data Gifting?", "response": "MTN Data Gifting allows customers to purchase and send data bundles to friends, family, or colleagues as a gift, ensuring they stay connected."}
{"input": "How do I use MTN Data Gifting?", "response": "Dial 1317# to select the data gifting option, enter the recipient's number, and choose a bundle. You can also gift data via the myMTN App."}
{"input": "What is MTN eSIM?", "response": "MTN eSIM is a virtual SIM technology that allows customers to activate MTN services on their devices without the need for a physical SIM card, providing flexibility and convenience."}
{"input": "How do I activate MTN eSIM?", "response": "Visit an MTN service center to get an eSIM QR code. Scan the code on your compatible device to activate the service."}
{"input": "What is MTN Share and Sell?", "response": "MTN Share and Sell is a service that allows customers to transfer airtime from their MTN account to another MTN number, making it easy to share airtime with friends and family."}
{"input": "How do I use MTN Share and Sell?", "response": "To use Share and Sell, activate the service by setting a transfer PIN. Dial 600defaultPINnewPINnewPIN# to change the default PIN. Then, dial 600recipient'sNumberamountPIN# to transfer airtime."}
{"input": "What is MTN Family and Friends?", "response": "MTN Family and Friends is a feature that allows users to add specific numbers to a group and enjoy discounted call rates when communicating with those numbers."}
{"input": "How do I add numbers to MTN Family and Friends?", "response": "Dial *560# or 4071# and follow the prompts to add up to 10 numbers to your Family and Friends group."}
{"input": "What is MTN Callertunez?", "response": "MTN Callertunez allows users to replace the default call waiting tone with music, sound clips, or customized audio that callers hear while waiting for their call to be answered."}
{"input": "How do I activate MTN Callertunez?", "response": "Dial *410# or visit the MTN Callertunez portal to browse and activate a tune. You can also manage your tunes via the myMTN App."}
{"input": "What is MTN Night Plan?", "response": "MTN Night Plan is a data bundle offering customers affordable data access during nighttime hours, typically between 11 PM and 6 AM, ideal for heavy downloads and online activities."}
{"input": "How do I subscribe to MTN Night Plan?", "response": "Dial *406# and select \"Night Plan\" from the list. Ensure you have sufficient airtime, as the plan is deducted from your balance."}
{"input": "What is MTN WhoDeyCall?", "response": "MTN WhoDeyCall is a service that notifies customers when someone attempts to call them while their line is switched off or unreachable."}
{"input": "How do I activate MTN WhoDeyCall?", "response": "Dial *133# to activate the service. Notifications are sent via SMS when your line becomes reachable again."}
{"input": "What is MTN Auto Top-Up?", "response": "MTN Auto Top-Up is a service that automatically recharges your airtime or data bundle when your balance drops below a certain threshold, ensuring uninterrupted connectivity."}
{"input": "How do I set up MTN Auto Top-Up?", "response": "Dial *904# and select \"Auto Top-Up\" or set it up via the myMTN App by linking your debit card for automatic payments."}
{"input": "What is MTN Jumia Data Offer?", "response": "MTN Jumia Data Offer is a partnership between MTN and Jumia, providing customers with exclusive data bundles at discounted rates for shopping on the Jumia platform."}
{"input": "How do I activate the MTN Jumia Data Offer?", "response": "Visit the Jumia platform or dial 1313# to activate the offer. Ensure you meet the eligibility criteria to enjoy the benefits."}
{"input": "What is MTN Voice SMS?", "response": "MTN Voice SMS allows users to send voice messages as SMS, enabling more personalized and expressive communication."}
{"input": "How do I send an MTN Voice SMS?", "response": "Dial 132recipient'sNumber# and follow the voice prompts to record and send your message."}
{"input": "What is MTN Pay4Me?", "response": "MTN Pay4Me is a reverse billing service where the recipient of a call pays for the call charges instead of the caller, making it convenient for users without airtime to make urgent calls."}
{"input": "How do I use MTN Pay4Me?", "response": "Dial 121 followed by the recipient\u0092s number (e.g., 12108031234567). The recipient will be prompted to accept or decline the charges."}
{"input": "What is MTN Caller Notify?", "response": "MTN Caller Notify informs users via SMS when a specific number becomes reachable after being switched off or unavailable, helping you reconnect with important contacts."}
{"input": "How do I activate MTN Caller Notify?", "response": "Dial *117# to activate the service. You will receive notifications when the specified number becomes reachable."}
{"input": "What is MTN Business Suite?", "response": "MTN Business Suite offers a range of solutions for SMEs and large enterprises, including cloud services, bulk SMS, and secure internet connectivity, designed to enhance business productivity."}
{"input": "How do I subscribe to MTN Business Suite?", "response": "Visit the MTN Business website or contact the MTN business team for a tailored solution that meets your organization's needs."}
{"input": "What is MTN Data Cashback?", "response": "MTN Data Cashback is a reward program that gives customers a percentage of their data subscription back as bonus data, encouraging frequent recharges."}
{"input": "How do I claim MTN Data Cashback?", "response": "Simply subscribe to an eligible data bundle, and the cashback bonus will be credited automatically to your data account."}
{"input": "What is MTN VIP Tariff Plan?", "response": "MTN VIP Tariff Plan is an exclusive plan offering premium customers lower call rates, higher bonuses, and priority customer support services."}
{"input": "How do I migrate to MTN VIP Tariff Plan?", "response": "Dial 1314# to check eligibility and migrate. VIP plans are typically invitation-only based on usage and loyalty."}
{"input": "What is MTN Smart Number?", "response": "MTN Smart Number is a vanity phone number that customers can customize to reflect their name, business, or a memorable sequence, making it easier for people to remember."}
{"input": "How do I get an MTN Smart Number?", "response": "Visit an MTN service center to choose and register your personalized Smart Number."}
{"input": "What is MTN Dual SIM Offer?", "response": "MTN Dual SIM Offer provides customers with discounted rates and exclusive bundles for using two MTN SIM cards on the same device, ensuring seamless connectivity."}
{"input": "How do I activate MTN Dual SIM Offer?", "response": "Dial 1236# on both SIMs to link them and enjoy the dual SIM benefits."}
{"input": "What is MTN Smart Recharge?", "response": "MTN Smart Recharge allows customers to enjoy data and airtime bonuses instantly when they recharge with specific codes or via designated channels."}
{"input": "How do I perform an MTN Smart Recharge?", "response": "Dial 888rechargePIN# or use the myMTN App to recharge and claim your bonuses."}
{"input": "What is MTN Social Bundle?", "response": "MTN Social Bundle provides affordable data plans specifically for social media platforms like WhatsApp, Facebook, Twitter, and Instagram, ensuring uninterrupted social connectivity."}
{"input": "How do I subscribe to MTN Social Bundle?", "response": "Dial 1313# and select the \"Social Bundle\" option or activate it via the myMTN App."}
{"input": "What is MTN PayG (Pay-As-You-Go)?", "response": "MTN PayG allows customers to pay for data services based on actual usage without a fixed subscription, offering flexibility for occasional internet users."}
{"input": "How do I activate MTN PayG?", "response": "Ensure you have airtime in your account. PayG data charges are automatically deducted from your balance when browsing."}
{"input": "What is MTN Data Rollover?", "response": "MTN Data Rollover allows customers to carry forward unused data from their active bundle into a new subscription, preventing data loss."}
{"input": "How do I activate MTN Data Rollover?", "response": "Renew your data plan before it expires to roll over any unused data. This feature is automatic for eligible bundles."}
{"input": "What is MTN Virtual Top-Up (VTU)?", "response": "MTN VTU is an electronic airtime recharge service that enables users to top up their accounts or send airtime to others without using physical recharge cards."}
{"input": "How do I use MTN Virtual Top-Up?", "response": "Visit an MTN-authorized dealer or use the myMTN App to perform a VTU transaction."}
{"input": "What is MTN Smart Dial?", "response": "MTN Smart Dial is a feature that provides customers with shortcuts to common services by dialing specific codes, simplifying access to MTN\u0092s offerings."}
{"input": "How do I use MTN Smart Dial?", "response": "Dial codes like *123# for airtime balance or *131# for data bundles. Refer to MTN\u0092s USSD code list for more options."}
{"input": "What is MTN Cloud Services?", "response": "MTN Cloud Services provide businesses with secure cloud storage, backup solutions, and productivity tools, ensuring seamless data management and collaboration."}
{"input": "How do I subscribe to MTN Cloud Services?", "response": "Contact MTN Business to set up a subscription tailored to your organization\u0092s requirements."}
{"input": "What is MTN Mobile Money?", "response": "MTN Mobile Money is a mobile financial service that allows users to send, receive, and store money, make payments, buy airtime, and pay for goods and services using their mobile phones."}
{"input": "How do I register for MTN Mobile Money?", "response": "To register, visit an MTN service center with a valid ID or dial *170# to initiate the registration process on your phone. You will be required to create a PIN for secure transactions."}
{"input": "What is MTN Data Share?", "response": "MTN Data Share allows users to share their data bundles with other MTN users, making it easier to support friends, family, or employees with data."}
{"input": "How do I share data on MTN?", "response": "Dial *131# or use the myMTN App to transfer data. Select the recipient\u0092s number and the amount of data you wish to share."}
{"input": "What is MTN Naira Recharge?", "response": "MTN Naira Recharge allows users to load airtime into their MTN accounts using their bank cards or bank accounts, with the recharge amount converted to the equivalent airtime value in Naira."}
{"input": "How do I recharge using MTN Naira Recharge?", "response": "Use the myMTN App or dial *904# to initiate a recharge through a linked bank card. You can also visit participating banks for assistance."}
{"input": "What is MTN Data Boost?", "response": "MTN Data Boost is an offer that gives users additional data on top of their regular data plan, allowing for more extensive internet use at no extra cost."}
{"input": "How do I activate MTN Data Boost?", "response": "Data Boost is automatically activated when subscribing to certain data plans. You will receive a notification once the boost is applied."}
{"input": "What is MTN MoMo Agent?", "response": "MTN MoMo Agent is an authorized agent or business partner who facilitates mobile money services, including sending and receiving money, making payments, and assisting in account registration."}
{"input": "How do I become an MTN MoMo Agent?", "response": "To become an MTN MoMo agent, visit the nearest MTN office or apply online through the MTN website for more information on the registration process and requirements."}
{"input": "What is MTN E-commerce platform?", "response": "MTN E-commerce platform is an online marketplace that enables MTN customers to shop for a variety of products, pay for services, and participate in promotions using their mobile phones."}
{"input": "How do I shop on MTN E-commerce platform?", "response": "Access the MTN E-commerce platform through the myMTN App or visit the website to browse products and make purchases. Payment can be made via MTN Mobile Money, debit/credit card, or airtime."}
{"input": "What is MTN Data Saver?", "response": "MTN Data Saver is a feature that optimizes mobile data usage by compressing web pages and reducing data consumption when browsing, thus saving you money on data charges."}
{"input": "How do I activate MTN Data Saver?", "response": "Simply dial 1314# to activate the Data Saver feature or enable it through the myMTN App."}
{"input": "What is MTN Smart Wi-Fi?", "response": "MTN Smart Wi-Fi is a Wi-Fi service that allows customers to connect to high-speed internet via MTN's local Wi-Fi networks in specific locations, offering better speed and reduced data charges."}
{"input": "How do I access MTN Smart Wi-Fi?", "response": "Use the myMTN App to find MTN Smart Wi-Fi hotspots, or check for Wi-Fi locations through MTN's website or customer service channels."}
{"input": "What is MTN Super Saver?", "response": "MTN Super Saver is a tariff plan that provides discounted call rates for specific times of day, allowing users to save on their communication costs while making calls."}
{"input": "How do I migrate to MTN Super Saver?", "response": "Dial 1316# to migrate to the MTN Super Saver plan and enjoy cheaper calls during off-peak hours."}
{"input": "What is MTN Global Roaming?", "response": "MTN Global Roaming enables users to use their MTN number for calls, SMS, and data while traveling abroad, keeping them connected wherever they go."}
{"input": "How do I activate MTN Global Roaming?", "response": "Dial 1317# or visit the MTN Global Roaming portal on the website to activate roaming services before you travel. Ensure your plan includes international roaming features."}
{"input": "What is MTN Loyo?", "response": "MTN Loyo is a customer loyalty program that rewards frequent users with benefits such as discounted services, exclusive offers, and points that can be redeemed for prizes or discounts."}
{"input": "How do I participate in MTN Loyo?", "response": "Sign up for MTN Loyo through the myMTN App or by dialing *150# to start collecting points and accessing loyalty rewards."}
{"input": "What is MTN Business Data Bundle?", "response": "MTN Business Data Bundle is a customized data plan for businesses, offering bulk data at competitive prices to enhance business operations and team collaboration."}
{"input": "How do I subscribe to MTN Business Data Bundle?", "response": "Contact MTN Business or visit the MTN Business website to select the data plan best suited for your organization\u0092s needs."}
{"input": "What is MTN Data Add-On?", "response": "MTN Data Add-On is an additional data bundle that can be added to your existing plan to supplement your data usage without interrupting your primary plan\u0092s validity."}
{"input": "How do I activate MTN Data Add-On?", "response": "Dial *131# or use the myMTN App to add an extra data bundle to your account."}
{"input": "What is MTN Recharge Plus?", "response": "MTN Recharge Plus offers users a chance to earn bonus airtime when they recharge, providing additional airtime to extend their talk time and usage."}
{"input": "How do I activate MTN Recharge Plus?", "response": "Recharge via any of the available channels, and you will receive bonus airtime automatically depending on the recharge amount."}
{"input": "What is MTN Internet Service?", "response": "MTN Internet Service provides reliable high-speed internet connectivity through mobile data plans, broadband, and fixed-line internet services to homes and businesses."}
{"input": "How do I subscribe to MTN Internet Service?", "response": "Visit the MTN Internet Service website or contact customer service to choose a plan that suits your needs, whether mobile or home broadband."}
{"input": "What is MTN SMS Banking?", "response": "MTN SMS Banking is a service that allows customers to manage their bank accounts, transfer funds, and pay bills via SMS on their mobile phones without requiring an internet connection."}
{"input": "How do I activate MTN SMS Banking?", "response": "Visit your bank to link your MTN number to your account, and follow the bank\u0092s instructions to activate SMS banking services."}
{"input": "What is MTN Data Flex?", "response": "MTN Data Flex is a flexible data plan that allows users to choose from various bundles with different data limits and validity periods to cater to their data usage needs."}
{"input": "How do I subscribe to MTN Data Flex?", "response": "Dial *131# and select the \"Data Flex\" option, or use the myMTN App to view available plans and select the one that suits your usage."}
{"input": "What is MTN App Store?", "response": "MTN App Store is an online marketplace where MTN customers can download apps, games, and other content for mobile phones, offering a wide variety of paid and free apps."}
{"input": "How do I access MTN App Store?", "response": "Download the MTN App Store via the myMTN App or visit the official website to browse available apps for your device."}
{"input": "What is MTN Turbo Recharge?", "response": "MTN Turbo Recharge is a fast recharge service that allows users to instantly recharge their MTN account without delay, ensuring minimal downtime for voice or data services."}
{"input": "How do I use MTN Turbo Recharge?", "response": "Simply dial *904# or use the myMTN App for quick and seamless recharge of your account."}
{"input": "What is MTN Data Calendar?", "response": "MTN Data Calendar is a feature that lets users plan and manage their data usage by viewing usage history and setting up alerts for when their data is nearing exhaustion."}
{"input": "How do I use MTN Data Calendar?", "response": "Access the Data Calendar feature via the myMTN App to set up alerts and view past data usage trends."}
{"input": "What is MTN Home Broadband?", "response": "MTN Home Broadband is an internet service designed for residential customers, offering high-speed internet via fiber-optic, 4G LTE, or Wi-Fi connections for homes and small offices."}
{"input": "How do I subscribe to MTN Home Broadband?", "response": "Contact MTN customer service or visit an MTN retail store to sign up for a broadband plan. Installation may be required for fiber or Wi-Fi connections."}
{"input": "What is MTN Data Gifting?", "response": "MTN Data Gifting allows users to gift data to friends or family members, enabling them to share internet resources with others on the MTN network."}
{"input": "How do I gift data on MTN?", "response": "Dial *131# or use the myMTN App to send data to a friend or family member. You will need to input the recipient\u0092s number and the amount of data you wish to gift."}
{"input": "What is MTN Prepaid Data?", "response": "MTN Prepaid Data is a pay-as-you-go data service that allows users to purchase data as needed, giving them the flexibility to pay for internet services without a long-term commitment."}
{"input": "How do I subscribe to MTN Prepaid Data?", "response": "Dial *131# or use the myMTN App to choose a prepaid data plan, or buy data from an authorized retailer."}
{"input": "What is MTN Pay as You Go Plan?", "response": "The MTN Pay as You Go Plan allows users to pay for services as they use them, such as for internet, calls, or SMS, ensuring no fixed monthly charges or commitments."}
{"input": "How do I activate MTN Pay as You Go Plan?", "response": "Simply use services as usual, and charges will be deducted based on actual usage, without the need for a subscription."}
{"input": "What is MTN Pay Later?", "response": "MTN Pay Later is a service that allows users to make purchases and defer payment, giving them the flexibility to pay later within a set time frame."}
{"input": "How do I use MTN Pay Later?", "response": "Activate the service by dialing 1234# and following the prompts to set up the Pay Later feature on your account."}
{"input": "What is MTN Group Services?", "response": "MTN Group Services offer a variety of telecommunication and mobile money services across multiple countries, providing affordable and reliable mobile services to customers worldwide."}
{"input": "How do I access MTN Group Services?", "response": "Visit the MTN Group website for more information on available services in your country or region."}
{"input": "What is MTN Wi-Fi Data Plan?", "response": "MTN Wi-Fi Data Plan is a subscription service that allows users to access the internet via Wi-Fi, typically offered in public or private hotspots, with flexible pricing based on data volume and duration."}
{"input": "How do I subscribe to MTN Wi-Fi Data Plan?", "response": "Visit any MTN Wi-Fi hotspot location or use the myMTN App to select a suitable Wi-Fi plan. Alternatively, dial *131# to check available plans."}
{"input": "What is MTN Fast Data Bundle?", "response": "MTN Fast Data Bundle provides high-speed internet data for heavy users, offering faster browsing and downloading speeds during the duration of the plan."}
{"input": "How do I activate MTN Fast Data Bundle?", "response": "Dial *131# and choose from available fast data bundles, or use the myMTN App for faster and more convenient subscription."}
{"input": "What is MTN International Calls?", "response": "MTN International Calls allow users to make calls to international numbers at competitive rates, with special packages available to various countries around the world."}
{"input": "How do I make an international call on MTN?", "response": "Dial the international number using the international dialing code or subscribe to an international calling plan via *131# or the myMTN App."}
{"input": "What is MTN Video Streaming Data Bundle?", "response": "MTN Video Streaming Data Bundle is a specialized data plan that provides data at a discounted rate for streaming videos, ensuring users can watch videos without worrying about data consumption."}
{"input": "How do I activate MTN Video Streaming Data Bundle?", "response": "Dial *131# or use the myMTN App to select the video streaming data bundle option to start enjoying discounted data for streaming."}
{"input": "What is MTN PayLater?", "response": "MTN PayLater is a credit facility that allows users to purchase goods or services and pay for them later, either on the next recharge or within a set period."}
{"input": "How do I activate MTN PayLater?", "response": "Dial 1234# or visit the MTN customer care center to enable PayLater on your line."}
{"input": "What is MTN Entertainment Bundle?", "response": "MTN Entertainment Bundle provides affordable data packages for accessing entertainment content such as music, movies, and live streaming services."}
{"input": "How do I activate MTN Entertainment Bundle?", "response": "Dial 1313# or use the myMTN App to choose the entertainment bundle you wish to subscribe to."}
{"input": "What is MTN Sports Data Plan?", "response": "MTN Sports Data Plan is designed for sports enthusiasts who want to stream live sports events, watch sports videos, and access sports websites without worrying about high data costs."}
{"input": "How do I subscribe to MTN Sports Data Plan?", "response": "Dial *131# or use the myMTN App to select the sports data plan that fits your usage needs."}
{"input": "What is MTN Data Roll Over?", "response": "MTN Data Roll Over allows unused data from one month to be carried over into the next month, enabling users to maximize their data usage without losing out."}
{"input": "How do I enable MTN Data Roll Over?", "response": "Ensure that you subscribe to a data plan that supports rollover, and the unused data will automatically roll over to the next month."}
{"input": "What is MTN Family Plan?", "response": "MTN Family Plan is a data sharing plan that allows multiple members of a family to share a single data plan, making it easier for families to stay connected with reduced data charges."}
{"input": "How do I subscribe to MTN Family Plan?", "response": "Visit the myMTN App, dial *131# or visit an MTN retail shop to activate the family plan and add family members to share the plan."}
{"input": "What is MTN Super Vision?", "response": "MTN Super Vision is a service that gives users the ability to track their data usage in real-time, allowing for better management and control over their internet usage."}
{"input": "How do I activate MTN Super Vision?", "response": "Use the myMTN App to access data usage tracking features or dial 1312# to set up monitoring for your data usage."}
{"input": "What is MTN Zone?", "response": "MTN Zone is a prepaid tariff plan that offers users discounts on calls and SMS depending on the time of day and location, making it a cost-effective choice for heavy users."}
{"input": "How do I migrate to MTN Zone?", "response": "Dial 1315# to migrate to the MTN Zone plan."}
{"input": "What is MTN Service Recharge?", "response": "MTN Service Recharge is a recharge option that lets users add credit directly to their MTN account for use in services like data, calls, or SMS."}
{"input": "How do I use MTN Service Recharge?", "response": "Simply dial *904# and follow the prompts to recharge for services."}
{"input": "What is MTN Youth Data Bundle?", "response": "MTN Youth Data Bundle offers discounted data plans tailored for young people, providing them with affordable options for internet browsing, social media, and streaming services."}
{"input": "How do I subscribe to MTN Youth Data Bundle?", "response": "Dial *131# or use the myMTN App to select a youth data bundle that suits your internet needs."}
{"input": "What is MTN Data Me?", "response": "MTN Data Me is a customizable data plan that allows users to choose their preferred data volume and the number of days the data should last, giving them control over their internet usage."}
{"input": "How do I activate MTN Data Me?", "response": "Dial *131# to customize your data plan by selecting your preferred volume and validity period."}
{"input": "What is MTN Boost?", "response": "MTN Boost is a feature that enhances the speed of your data by optimizing the network connection, providing faster browsing and downloading experiences."}
{"input": "How do I activate MTN Boost?", "response": "Dial 1317# to activate the MTN Boost feature and enjoy enhanced data speeds."}
{"input": "What is MTN Family Chat?", "response": "MTN Family Chat is a communication service that allows family members to connect through a group chat, sharing messages and multimedia with each other in a private group on their MTN numbers."}
{"input": "How do I activate MTN Family Chat?", "response": "Dial 1236# or use the myMTN App to set up a family chat group and invite your family members to join."}
{"input": "What is MTN Business Solution?", "response": "MTN Business Solution provides a variety of tools and services that help businesses stay connected, including cloud services, business data plans, and mobile device management solutions."}
{"input": "How do I subscribe to MTN Business Solution?", "response": "Contact the MTN Business team through their website or call the customer service center for more information about the subscription process and available packages."}
{"input": "What is MTN Contactless Payments?", "response": "MTN Contactless Payments is a service that allows users to make payments using their mobile phones at participating retail outlets or online stores, without needing to physically swipe or insert a card."}
{"input": "How do I set up MTN Contactless Payments?", "response": "Link your MTN Mobile Money or bank card to your mobile number and start using contactless payments by holding your phone near a payment terminal."}
{"input": "What is MTN Instant Data?", "response": "MTN Instant Data is a data plan that provides users with immediate access to the internet once the subscription is completed, ensuring uninterrupted online experience from the moment of purchase."}
{"input": "How do I subscribe to MTN Instant Data?", "response": "Dial *131# or use the myMTN App to activate instant data plans based on your desired volume and validity period."}
{"input": "What is MTN Prepaid Data Bundle?", "response": "MTN Prepaid Data Bundle allows users to pay for their data in advance, offering a range of flexible data packages that cater to different needs, from light browsing to heavy media consumption."}
{"input": "How do I activate MTN Prepaid Data Bundle?", "response": "Dial *131# or visit the myMTN App to choose the prepaid data bundle that fits your usage."}
{"input": "What is MTN Tax-Free?", "response": "MTN Tax-Free is a promotional feature where customers are exempt from certain taxes or additional charges for specific services, such as mobile data or airtime top-ups."}
{"input": "How do I activate MTN Tax-Free?", "response": "Look out for special promotions or offers advertised by MTN, and follow the instructions to activate tax-free benefits."}
{"input": "What is MTN Voice Bundle?", "response": "MTN Voice Bundle is a prepaid bundle that offers affordable voice call rates, allowing customers to make calls without the concern of high costs."}
{"input": "How do I subscribe to MTN Voice Bundle?", "response": "Dial 1318# or use the myMTN App to choose a voice bundle package and start enjoying discounted call rates."}
{"input": "What is MTN Data For Schools?", "response": "MTN Data For Schools is a special data plan that provides affordable internet access for educational purposes, aimed at supporting students and educators in the digital learning process."}
{"input": "How do I subscribe to MTN Data For Schools?", "response": "Contact MTN customer support for details on the plan and to verify eligibility for educational discounts or data bundles."}
{"input": "What is MTN Recharge to Win?", "response": "MTN Recharge to Win is a promotional offer where users can win prizes, such as airtime, devices, or cash, simply by recharging their accounts with specific amounts during a promotion period."}
{"input": "How do I participate in MTN Recharge to Win?", "response": "Follow the instructions on the MTN website or check for promotional offers through SMS or the myMTN App to participate in the competition."}
{"input": "What is MTN MySchool App?", "response": "MTN MySchool App is a mobile application designed for students and teachers, providing access to educational content, timetables, assignments, and academic resources."}
{"input": "How do I download MTN MySchool App?", "response": "Visit your phone's app store (Google Play or Apple App Store) and search for \"MTN MySchool\" to download and install the app."}
{"input": "What is MTN Data for Calls?", "response": "MTN Data for Calls is a data plan that allows you to use your mobile data for VoIP calls, enabling you to make calls over the internet at affordable rates, instead of traditional mobile voice networks."}
{"input": "How do I activate MTN Data for Calls?", "response": "To activate, you can dial *131# to select a suitable data plan for VoIP calls, or use the myMTN App to make the selection."}
{"input": "What is MTN Data Backup Service?", "response": "MTN Data Backup Service allows users to automatically back up their contacts, messages, and other important data to the cloud, so they can be restored easily if the phone is lost or replaced."}
{"input": "How do I activate MTN Data Backup Service?", "response": "Use the myMTN App or visit the MTN website for instructions on how to set up automatic data backups to the cloud."}
{"input": "What is MTN Call Me Back Service?", "response": "MTN Call Me Back Service allows you to send a free message to another MTN user, requesting them to call you back, which is useful when you have no balance but need to communicate."}
{"input": "How do I use MTN Call Me Back Service?", "response": "Dial 133 followed by the recipient's number, or simply use the Call Me Back feature through the myMTN App."}
{"input": "What is MTN Music Bundle?", "response": "MTN Music Bundle is a special data package that allows users to stream music on platforms like Spotify, Apple Music, or other streaming services without consuming a large portion of their regular data."}
{"input": "How do I activate MTN Music Bundle?", "response": "Dial 1312# to access the music bundle options or use the myMTN App to subscribe to your preferred music data plan."}
{"input": "What is MTN Business Solutions for SMEs?", "response": "MTN Business Solutions for SMEs is a service offering customized packages for small and medium-sized enterprises, providing affordable data, voice, and digital tools for business communications and growth."}
{"input": "How do I subscribe to MTN Business Solutions for SMEs?", "response": "Contact MTN Business through their customer care channels or visit the MTN Business Solutions website for package details and subscription instructions."}
{"input": "What is MTN Internet of Things (IoT)?", "response": "MTN Internet of Things (IoT) is a network solution that connects various devices, such as smart home devices, sensors, and machines, to the internet, enabling them to share data and automate processes."}
{"input": "How do I subscribe to MTN IoT services?", "response": "Businesses and individuals can visit the MTN IoT portal for subscription details and to set up IoT devices for use on the network."}
{"input": "What is MTN Data Rollover Plus?", "response": "MTN Data Rollover Plus allows unused data from one month to be carried forward, with the added benefit of receiving bonus data for the rollover, enhancing the value of data plans."}
{"input": "How do I activate MTN Data Rollover Plus?", "response": "Subscribe to an eligible data plan, and any unused data will be automatically rolled over to the next month along with bonus data, ensuring you get more value for your subscription."}
{"input": "What is MTN Free Night Data?", "response": "MTN Free Night Data provides users with free data to browse and download content during specific hours, typically from midnight to 5 AM, allowing users to make the most of their internet usage during off-peak hours."}
{"input": "How do I activate MTN Free Night Data?", "response": "Check your eligibility for the Free Night Data promotion via *131# or the myMTN App, and activate the offer to start using data during the free hours."}
{"input": "What is MTN Data Booster?", "response": "MTN Data Booster is a feature that allows users to increase their available data quota for a limited period, providing an extra boost of data when it's needed most for browsing, streaming, or downloading."}
{"input": "How do I activate MTN Data Booster?", "response": "Dial 1317# to activate the MTN Data Booster or use the myMTN App for more information on how to add extra data to your plan."}
{"input": "What is MTN Family Plan?", "response": "MTN Family Plan is a flexible data bundle designed to allow multiple users within a family to share a single data subscription, making it easier to manage costs and stay connected."}
{"input": "How do I subscribe to MTN Family Plan?", "response": "Visit the myMTN App, dial *131# or contact customer care to set up the Family Plan and link family members for data sharing."}
{"input": "What is MTN MoMo?", "response": "MTN MoMo is a mobile money service that enables MTN subscribers to send money, pay bills, purchase airtime, and perform other financial transactions using their mobile phones, even without a bank account."}
{"input": "How do I activate MTN MoMo?", "response": "Dial *223# to register for MTN MoMo or visit the nearest MTN store to complete your registration."}
{"input": "What is MTN Value Added Services (VAS)?", "response": "MTN VAS are additional services such as ringback tones, caller tunes, news alerts, and entertainment content, which are available to users for a subscription fee beyond the basic mobile services."}
{"input": "How do I subscribe to MTN Value Added Services?", "response": "Dial the USSD code provided for each service, or use the myMTN App to browse and subscribe to available VAS."}
{"input": "What is MTN 4G LTE?", "response": "MTN 4G LTE (Long-Term Evolution) is a high-speed internet technology that provides users with fast download and upload speeds, enabling smooth streaming, browsing, and online gaming experiences."}
{"input": "How do I activate MTN 4G LTE?", "response": "Ensure that your phone is 4G-enabled and located in a 4G coverage area, then dial *131# to activate a 4G-compatible data plan or use the myMTN App."}
{"input": "What is MTN Internet Bundles for Students?", "response": "MTN Internet Bundles for Students provide affordable data plans tailored to the needs of students, with a focus on enabling academic research, social media use, and online learning at reduced costs."}
{"input": "How do I subscribe to MTN Internet Bundles for Students?", "response": "Dial *131# or use the myMTN App to select a student-friendly data plan based on your academic needs."}
{"input": "What is MTN Device Financing?", "response": "MTN Device Financing allows users to purchase smartphones and other devices through a financing option, paying for the device in installments over a set period of time."}
{"input": "How do I apply for MTN Device Financing?", "response": "Visit an MTN store or use the myMTN App to apply for device financing and choose the device you wish to purchase, along with your preferred installment plan."}
{"input": "What is MTN Gifting?", "response": "MTN Gifting allows you to send airtime or data bundles as gifts to friends and family, enabling users to share their resources with others on the MTN network."}
{"input": "How do I send a gift using MTN Gifting?", "response": "Dial 1316# to select airtime or data as a gift and choose the recipient's number to send the gift."}
{"input": "What is MTN Enterprise Solutions?", "response": "MTN Enterprise Solutions offers specialized business packages, including data, voice, cloud services, and digital marketing tools, to help businesses increase productivity and reach new customers."}
{"input": "How do I subscribe to MTN Enterprise Solutions?", "response": "Contact MTN Business Solutions through their customer care channels to discuss your business needs and subscribe to appropriate enterprise packages."}
{"input": "What is MTN Business Data Bundles?", "response": "MTN Business Data Bundles provide companies with flexible and scalable data options that suit their communication and operational needs, helping businesses stay connected and operate efficiently."}
{"input": "How do I subscribe to MTN Business Data Bundles?", "response": "Visit the MTN Business website or contact customer support to choose the best data bundle for your business's needs."}
{"input": "What is MTN SIM Swap?", "response": "MTN SIM Swap is a service that allows users to switch their MTN number from an old SIM card to a new one, ensuring continuity of services, especially when the original SIM is lost, damaged, or needs upgrading."}
{"input": "How do I perform an MTN SIM Swap?", "response": "Visit the nearest MTN service center with a valid ID, and request a SIM swap."}
{"input": "What is MTN Call Forwarding?", "response": "MTN Call Forwarding is a service that allows you to redirect incoming calls to another number, ensuring you never miss a call even when you're unavailable or your phone is turned off."}
{"input": "How do I activate MTN Call Forwarding?", "response": "Dial 21 followed by the number you want your calls forwarded to, or use the myMTN App to activate the service."}
{"input": "What is MTN Data Sharing?", "response": "MTN Data Sharing allows users to share their data with family members or friends who are on the MTN network, providing an easy way to manage data among multiple users."}
{"input": "How do I activate MTN Data Sharing?", "response": "Dial 1316# to activate data sharing and add family members or friends to your plan."}
{"input": "What is MTN Auto-Renewal Service?", "response": "MTN Auto-Renewal Service automatically renews your data plan at the end of the plan\u0092s validity, ensuring uninterrupted internet access."}
{"input": "How do I activate MTN Auto-Renewal Service?", "response": "Dial 1314# to opt into the Auto-Renewal service for your data plan, or manage this through the myMTN App."}
{"input": "What is MTN Online TV?", "response": "MTN Online TV is a streaming service that allows you to watch TV shows, movies, sports, and live events on your mobile device, using a subscription-based data plan."}
{"input": "How do I subscribe to MTN Online TV?", "response": "Dial 1319# or visit the myMTN App to subscribe to the Online TV service and start streaming your favorite content."}
{"input": "What is MTN Pay Bill Service?", "response": "MTN Pay Bill Service allows users to pay their bills, such as utility payments, directly from their MTN mobile accounts, making it easier and faster to settle various payments."}
{"input": "How do I use MTN Pay Bill Service?", "response": "Dial *170# to access the Pay Bill service or use the myMTN App to select and pay for utilities or other services."}
{"input": "What is MTN Data Gift?", "response": "MTN Data Gift allows users to send data as a gift to friends or family members, allowing them to stay connected."}
{"input": "How do I send a Data Gift?", "response": "Dial 1316# to select the data plan you'd like to gift and enter the recipient's phone number."}
{"input": "What is MTN Prepaid Tariff Plans?", "response": "MTN Prepaid Tariff Plans offer various flexible pricing options for voice, text, and data services, allowing users to select a plan that fits their needs and budget."}
{"input": "How do I switch to MTN Prepaid Tariff Plan?", "response": "Dial *121# to view the available prepaid plans and select the one that best suits your usage requirements."}
{"input": "What is MTN Business Voice Solutions?", "response": "MTN Business Voice Solutions provides tailored voice packages for businesses, helping them manage communication effectively while controlling costs."}
{"input": "How do I subscribe to MTN Business Voice Solutions?", "response": "Contact the MTN Business Solutions team to discuss the most suitable voice package for your company and subscribe to it."}
{"input": "What is MTN Home Broadband?", "response": "MTN Home Broadband offers high-speed internet access for homes or small offices, allowing multiple devices to connect seamlessly with fast internet."}
{"input": "How do I subscribe to MTN Home Broadband?", "response": "Visit an MTN store or use the myMTN App to choose the broadband plan that best fits your home internet needs."}
{"input": "What is MTN Premium Data Plan?", "response": "MTN Premium Data Plan is a high-value data bundle offering significant amounts of data for heavy users, such as those who stream, download, or browse extensively, at discounted rates."}
{"input": "How do I activate MTN Premium Data Plan?", "response": "Dial *131# or use the myMTN App to select the Premium Data Plan that suits your needs."}
{"input": "What is MTN Smart Data Plan?", "response": "MTN Smart Data Plan is a flexible data plan that automatically adjusts based on your usage, optimizing your internet experience for light to medium data users."}
{"input": "How do I activate MTN Smart Data Plan?", "response": "Dial 1313# or visit the myMTN App for more information and activation instructions."}
{"input": "What is MTN 5G Service?", "response": "MTN 5G is the latest high-speed internet technology offering faster download and upload speeds, low latency, and enhanced reliability, available in select areas."}
{"input": "How do I activate MTN 5G?", "response": "Ensure you have a 5G-enabled device and are in a 5G coverage area, then dial *131# or use the myMTN App to activate a suitable 5G plan."}
{"input": "What is MTN MyMusic?", "response": "MTN MyMusic is a music streaming service provided by MTN, offering users access to a vast library of songs, albums, and playlists, with the option to listen offline with a data subscription."}
{"input": "How do I subscribe to MTN MyMusic?", "response": "Dial 1319# or use the myMTN App to subscribe to MyMusic, selecting the best plan for your music preferences."}
{"input": "What is MTN HSI (High-Speed Internet)?", "response": "MTN HSI is a premium internet service offering faster speeds and reliable connectivity for users in both urban and rural areas, aimed at meeting the demands of high-demand applications like gaming and video conferencing."}
{"input": "How do I subscribe to MTN HSI?", "response": "Check availability in your area via the MTN website or contact customer service to inquire about installation and subscription details for MTN HSI."}
{"input": "What is MTN E-commerce?", "response": "MTN E-commerce allows users to buy and sell goods and services through a mobile platform, providing convenience and secure transactions for businesses and consumers."}
{"input": "How do I use MTN E-commerce?", "response": "Visit the MTN E-commerce platform via the myMTN App or their website to explore available products and services, or set up a shop to sell your goods online."}
{"input": "What is MTN Interactive Services?", "response": "MTN Interactive Services are a range of mobile services, such as mobile games, quizzes, polls, and voting systems, designed to engage users in entertainment and social interactions."}
{"input": "How do I access MTN Interactive Services?", "response": "Dial 1315# or use the myMTN App to explore and subscribe to various interactive services, such as games, entertainment polls, and more."}
{"input": "What is MTN One Network?", "response": "MTN One Network is a cross-border mobile service that allows users to enjoy seamless voice, data, and messaging services while traveling across African countries that have partnered with MTN."}
{"input": "How do I subscribe to MTN One Network?", "response": "Dial *131# to check availability and activate MTN One Network services while traveling or visit the myMTN App for more information."}
{"input": "What is MTN Mobile Insurance?", "response": "MTN Mobile Insurance offers users affordable mobile insurance policies, which protect their devices against theft, loss, or accidental damage."}
{"input": "How do I subscribe to MTN Mobile Insurance?", "response": "Visit the myMTN App or dial 1318# to access mobile insurance plans and activate coverage for your device."}
{"input": "What is MTN 10GB Data Plan?", "response": "MTN 10GB Data Plan offers users 10GB of data for browsing, streaming, and other internet-related activities at an affordable price, giving users more value for their money."}
{"input": "How do I activate MTN 10GB Data Plan?", "response": "Dial 1312# to choose from a variety of data plan options, including the 10GB Data Plan."}
{"input": "What is MTN Zone Data Plan?", "response": "MTN Zone Data Plan is a flexible plan offering discounted rates based on your location and usage patterns, making it cost-effective for heavy users in select zones."}
{"input": "How do I activate MTN Zone Data Plan?", "response": "Dial 1317# or check your location's zone status through the myMTN App to access discounted data rates."}
{"input": "What is MTN Data Analytics?", "response": "MTN Data Analytics provides business insights through data collected from users, enabling companies to make informed decisions on customer preferences, behavior, and trends."}
{"input": "How do I subscribe to MTN Data Analytics?", "response": "Visit MTN's Business Solutions portal to discuss how MTN Data Analytics can benefit your business and set up a subscription."}
{"input": "What is MTN Partner Program?", "response": "MTN Partner Program is an initiative that allows businesses, developers, and entrepreneurs to collaborate with MTN for product development, marketing, and sales opportunities on the MTN platform."}
{"input": "How do I apply for MTN Partner Program?", "response": "Visit MTN\u0092s Business Solutions website or contact their partnership team to inquire about joining the Partner Program."}
{"input": "What is MTN Cloud Storage?", "response": "MTN Cloud Storage is a cloud-based solution that allows users to store their data, files, photos, and videos securely, providing access from any device connected to the internet."}
{"input": "How do I subscribe to MTN Cloud Storage?", "response": "Dial 1314# or access the myMTN App to choose your preferred cloud storage plan and start uploading your files."}
{"input": "What is MTN Data Shifting?", "response": "MTN Data Shifting allows users to transfer unused data from one plan to another or to another user, ensuring no data goes to waste."}
{"input": "How do I activate MTN Data Shifting?", "response": "Use the myMTN App or dial 1316# to transfer unused data to another user or to another plan."}
{"input": "What is MTN International Roaming?", "response": "MTN International Roaming service allows you to use your MTN number to make calls, send messages, and use data when traveling abroad, ensuring connectivity while away."}
{"input": "How do I activate MTN International Roaming?", "response": "Dial 1318# to activate International Roaming or use the myMTN App to enable roaming services before traveling."}
{"input": "What is MTN Roaming Data Bundle?", "response": "MTN Roaming Data Bundle is a data plan specifically designed for use when traveling internationally, offering affordable data while roaming outside of the country."}
{"input": "How do I activate MTN Roaming Data Bundle?", "response": "Check the availability of the Roaming Data Bundle by dialing *131# or contact MTN customer support for specific details on pricing and activation."}
{"input": "What is MTN Speed Test?", "response": "MTN Speed Test is an online tool that allows users to measure the download and upload speeds of their internet connection, helping them assess their network's performance."}
{"input": "How do I use MTN Speed Test?", "response": "Visit the MTN website or download the MTN Speed Test app to test your internet speed and evaluate the quality of your connection."}
{"input": "What is MTN Custom Plans for Businesses?", "response": "MTN Custom Plans for Businesses provide tailored voice and data packages that suit the unique needs of each company, offering flexibility and scalability as the business grows."}
{"input": "How do I subscribe to MTN Custom Plans for Businesses?", "response": "Contact MTN Business Solutions to discuss your company's requirements and customize a plan that meets your business's needs."}
{"input": "What is MTN MyMedeAnalytics?", "response": "MTN MyMedeAnalytics is a data service that provides detailed analytics on healthcare usage patterns, helping healthcare professionals and organizations optimize services and improve patient care."}
{"input": "How do I subscribe to MTN MyMedeAnalytics?", "response": "Visit MTN Business Solutions or contact customer care to get started with MyMedeAnalytics."}
{"input": "What is MTN Mobile Voting?", "response": "MTN Mobile Voting is a service that allows users to participate in voting systems for elections, contests, and public polls through their mobile phones."}
{"input": "How do I use MTN Mobile Voting?", "response": "Dial 1315# or visit the MTN Mobile Voting platform to vote in various elections, polls, or competitions using your MTN mobile number."}
{"input": "What is MTN Cloud Gaming?", "response": "MTN Cloud Gaming is a service that allows users to play games directly from the cloud without the need for powerful hardware, offering a smooth gaming experience on mobile devices."}
{"input": "How do I subscribe to MTN Cloud Gaming?", "response": "Dial 1319# or use the myMTN App to subscribe to available gaming services and explore the cloud gaming options."}
{"input": "What is MTN Insurance for Devices?", "response": "MTN Insurance for Devices offers users coverage for their mobile phones and other devices against accidental damage, theft, and other risks."}
{"input": "How do I subscribe to MTN Insurance for Devices?", "response": "Dial 1318# to access insurance plans or use the myMTN App to choose the best device protection plan for your device."}
{"input": "What is MTN Corporate Solutions?", "response": "MTN Corporate Solutions is a suite of services designed for corporate clients, offering mobile, data, and business solutions to improve communication, connectivity, and productivity across organizations."}
{"input": "How do I subscribe to MTN Corporate Solutions?", "response": "Visit the MTN Business Solutions website or contact their corporate services team to discuss your company\u0092s needs and subscribe to the available solutions."}
{"input": "What is MTN MyDataFlex?", "response": "MTN MyDataFlex is a data plan that offers users the flexibility to change their data usage based on the time of day or the type of activity they are engaging in, helping to optimize costs."}
{"input": "How do I activate MTN MyDataFlex?", "response": "Dial 1313# to select the MyDataFlex plan or visit the myMTN App for more details and activation instructions."}
{"input": "What is MTN Pulse?", "response": "MTN Pulse is a prepaid plan that offers young users with exciting and flexible data and voice bundles, discounts, and various entertainment options. It is designed for individuals aged 18-29."}
{"input": "How do I activate MTN Pulse?", "response": "Dial *406# to join the MTN Pulse plan, or visit the myMTN App for more information."}
{"input": "What is MTN Data Share?", "response": "MTN Data Share allows you to share your data with other MTN users, including friends and family, helping you maximize your data usage."}
{"input": "How do I activate MTN Data Share?", "response": "Dial 1317# to share your data or visit the myMTN App for more details on how to manage your data share."}
{"input": "What is MTN Power Data?", "response": "MTN Power Data is a special data plan offering extra data at an affordable price for heavy internet users. It provides more data compared to regular data plans for high-volume activities like video streaming and gaming."}
{"input": "How do I subscribe to MTN Power Data?", "response": "Dial 1316# or visit the myMTN App to subscribe to the Power Data plan."}
{"input": "What is MTN Hotspot?", "response": "MTN Hotspot allows users to share their mobile internet connection by turning their device into a portable Wi-Fi hotspot for other devices."}
{"input": "How do I activate MTN Hotspot?", "response": "Turn on the Hotspot feature on your phone or device, then share your data connection by creating a Wi-Fi network. Make sure you have an active data plan."}
{"input": "What is MTN Data Boost?", "response": "MTN Data Boost provides users with additional data at discounted rates, allowing users to increase their available data when they run low."}
{"input": "How do I activate MTN Data Boost?", "response": "Dial 1312# and choose the Data Boost option to get additional data at discounted rates."}
{"input": "What is MTN Data Gifting?", "response": "MTN Data Gifting allows users to give their unused data to other MTN customers, making it easier to share with friends, family, or colleagues."}
{"input": "How do I gift data with MTN?", "response": "Dial 1313# and follow the instructions to gift your unused data to another MTN user."}
{"input": "What is MTN Internet on the Go?", "response": "MTN Internet on the Go is a mobile broadband service that offers fast internet access on the go through portable data modems, ensuring connectivity for users outside home or office."}
{"input": "How do I subscribe to MTN Internet on the Go?", "response": "Visit the MTN website or use the myMTN App to check for available broadband devices and plans."}
{"input": "What is MTN Wi-Fi?", "response": "MTN Wi-Fi is a service that offers users high-speed internet at home or in offices via a fixed wireless broadband device."}
{"input": "How do I subscribe to MTN Wi-Fi?", "response": "You can subscribe to MTN Wi-Fi by visiting the MTN website or using the myMTN App for available Wi-Fi plans and installation details."}
{"input": "What is MTN Music+?", "response": "MTN Music+ is a subscription-based music streaming service offering users access to a wide range of music, including local and international hits."}
{"input": "How do I subscribe to MTN Music+?", "response": "Dial *123# or visit the myMTN App to subscribe to MTN Music+ and select your preferred plan."}
{"input": "What is MTN Video Streaming Service?", "response": "MTN Video Streaming Service allows users to access on-demand video content, including movies, TV shows, and documentaries, directly from their devices."}
{"input": "How do I subscribe to MTN Video Streaming Service?", "response": "Dial 1316# or use the myMTN App to subscribe to the video streaming plans available."}
{"input": "What is MTN Call Me Back?", "response": "MTN Call Me Back allows users to send a \"call me back\" request to other MTN users when they are unable to make a call due to insufficient balance."}
{"input": "How do I send a Call Me Back request with MTN?", "response": "Dial *133# and choose the option to send a \"Call Me Back\" request to another MTN number."}
{"input": "What is MTN Pay?", "response": "MTN Pay is a mobile payment service that allows users to make payments, transfer funds, and buy goods and services directly from their mobile phone without the need for a bank account."}
{"input": "How do I subscribe to MTN Pay?", "response": "Dial *365# or visit the myMTN App to subscribe and start making payments via MTN Pay."}
{"input": "What is MTN Money?", "response": "MTN Money is a mobile financial service that enables users to send money, pay bills, and access other financial services via their mobile phone."}
{"input": "How do I use MTN Money?", "response": "Dial *170# to access MTN Money and start transferring money, paying bills, and more."}
{"input": "What is MTN XtraTime?", "response": "MTN XtraTime provides users with a short-term credit for data, talk time, or SMS that is charged once the account is replenished."}
{"input": "How do I activate MTN XtraTime?", "response": "Dial *606# to access the MTN XtraTime service and choose the credit option you want."}
{"input": "What is MTN Mega Data Plan?", "response": "MTN Mega Data Plan is a high-capacity data plan that offers users a large amount of data for heavy internet activities such as video conferencing, online gaming, and streaming."}
{"input": "How do I subscribe to MTN Mega Data Plan?", "response": "Dial 1311# or visit the myMTN App to select the Mega Data Plan that fits your usage."}
{"input": "What is MTN Data for Life?", "response": "MTN Data for Life is a data plan offering long-term subscriptions, providing users with uninterrupted internet access for a fixed period, with the option to choose from various durations."}
{"input": "How do I subscribe to MTN Data for Life?", "response": "Dial 1313# or use the myMTN App to subscribe to the Data for Life plan."}
{"input": "What is MTN Bonus Data?", "response": "MTN Bonus Data is a promotional offer that provides users with additional data as a bonus for subscribing to certain data bundles, offering extra value."}
{"input": "How do I activate MTN Bonus Data?", "response": "Dial 1315# to access and activate Bonus Data offers."}
{"input": "What is MTN Free 10MB?", "response": "MTN Free 10MB is a promotional offer that gives users 10MB of data for free, enabling them to enjoy a small amount of internet access without any charges."}
{"input": "How do I claim my MTN Free 10MB?", "response": "Dial 1314# or check the myMTN App for more details about the Free 10MB offer and eligibility."}
{"input": "What is MTN Home Broadband?", "response": "MTN Home Broadband is a high-speed internet service that provides users with a reliable internet connection for their homes, offering a variety of data plans to suit different usage needs."}
{"input": "How do I subscribe to MTN Home Broadband?", "response": "Visit the MTN website or call customer service to inquire about available broadband plans and installation options for your home."}
{"input": "What is MTN Data Rollover?", "response": "MTN Data Rollover allows users to carry over unused data to the next billing cycle, ensuring that no data goes to waste."}
{"input": "How do I activate MTN Data Rollover?", "response": "Ensure you have an active data plan, and unused data will automatically roll over to your next cycle."}
{"input": "What is MTN Share and Sell?", "response": "MTN Share and Sell is a service that enables users to share their airtime balance with other MTN users or sell it to others."}
{"input": "How do I share airtime with MTN Share and Sell?", "response": "Dial *777# to access the Share and Sell service and follow the prompts to transfer or sell your airtime to another MTN number."}
{"input": "What is MTN GameZone?", "response": "MTN GameZone is a platform that provides users with access to a variety of mobile games that they can play and enjoy on their devices, with new games added regularly."}
{"input": "How do I access MTN GameZone?", "response": "Dial 1312# to access and explore the available games, or visit the myMTN App for more details."}
{"input": "What is MTN International Direct Dialing (IDD)?", "response": "MTN International Direct Dialing (IDD) allows users to make direct calls to international numbers without needing an operator, offering competitive rates for international calls."}
{"input": "How do I use MTN International Direct Dialing (IDD)?", "response": "Dial the international number you wish to call directly, including the international code, and the call will be routed through MTN's international services."}
{"input": "What is MTN Digital TV?", "response": "MTN Digital TV is a service that provides users with access to a wide range of television channels via their mobile phones or other digital devices, offering both local and international content."}
{"input": "How do I subscribe to MTN Digital TV?", "response": "Dial 1318# or visit the myMTN App to subscribe to the Digital TV service and select the best channel bundle for your preferences."}
{"input": "What is MTN Movie Club?", "response": "MTN Movie Club is a subscription service offering users access to a variety of movie genres for streaming or downloading, all available directly on their mobile devices."}
{"input": "How do I subscribe to MTN Movie Club?", "response": "Dial 1233# to subscribe and gain access to the latest movie titles available through MTN Movie Club."}
{"input": "What is MTN SMS Plus?", "response": "MTN SMS Plus is a service that provides users with discounted rates for sending bulk SMS messages, ideal for businesses or individuals sending messages to multiple recipients."}
{"input": "How do I use MTN SMS Plus?", "response": "Visit the MTN website or dial *170# to subscribe to the SMS Plus service for your business or personal use."}
{"input": "What is MTN Data bundle?", "response": "MTN Data bundles are affordable data plans designed to provide users with internet access through data-enabled devices, offering a variety of data sizes for different periods and usage needs."}
{"input": "Who can subscribe to MTN Data bundle?", "response": "Any MTN customer can subscribe to MTN Data bundles, whether a prepaid or postpaid user, as long as they have a compatible device and available balance."}
{"input": "What are the different MTN Data bundle plans available?", "response": "MTN offers several data bundle plans, including Daily, Weekly, Monthly, Bi-monthly, Quarterly, Bi-annually, and Yearly bundles, with different data allowances and pricing to suit various needs."}
{"input": "How do I subscribe to MTN Data bundles?", "response": "You can subscribe to MTN Data bundles via the USSD code *131# or *904#, through the myMTN App, or by sending an SMS with the data plan keyword to 312."}
{"input": "How do I check my MTN Data balance?", "response": "Dial 1314# to check your MTN Data balance. You can also check your balance using the myMTN App or by sending \"BALANCE\" to 131 via SMS."}
{"input": "Can I transfer data to another MTN user?", "response": "Yes, you can transfer data to another MTN user by dialing 1313# and following the prompts to select the amount and recipient."}
{"input": "How do I activate MTN Data rollover?", "response": "Data rollover is automatically enabled for most data plans. If you have unused data at the end of your billing cycle, it will roll over to the next cycle. Make sure you have an active data plan for rollover to apply."}
{"input": "What is MTN Data Gift?", "response": "MTN Data Gift allows users to send data to other MTN users, allowing you to share your data allowance with friends and family."}
{"input": "How do I send data with MTN Data Gift?", "response": "Dial 1313# and follow the instructions to transfer data to another MTN customer."}
{"input": "What is MTN Power Data?", "response": "MTN Power Data is a high-volume data plan designed for heavy internet users who require large data allowances for activities such as streaming, gaming, and video conferencing."}
{"input": "How do I subscribe to MTN Power Data?", "response": "Dial 1316# to access and subscribe to the MTN Power Data plan. Alternatively, you can use the myMTN App to select the plan."}
{"input": "What is MTN Pulse?", "response": "MTN Pulse is a youth-focused prepaid plan that offers special data and voice bundles, discounts on entertainment services, and the flexibility to change plans without penalties."}
{"input": "How do I activate MTN Pulse?", "response": "Dial *406# to activate the MTN Pulse plan or visit the myMTN App to get started with your preferred bundle options."}
{"input": "What is MTN XtraTime?", "response": "MTN XtraTime allows users to borrow airtime for calls and SMS, which will be deducted from their account balance once it is replenished."}
{"input": "How do I activate MTN XtraTime?", "response": "Dial *606# to borrow airtime using the MTN XtraTime service."}
{"input": "What is MTN Data Share?", "response": "MTN Data Share is a service that allows you to share your data with other MTN users, making it easy to share data with family and friends."}
{"input": "How do I share data using MTN Data Share?", "response": "Dial 1317# to share your data with another MTN user. You can choose the amount of data you want to share, and it will be transferred to the recipient."}
{"input": "What is MTN Internet on the Go?", "response": "MTN Internet on the Go is a mobile broadband service that provides internet access via portable modems, routers, or mobile hotspots, making it easy to stay connected wherever you are."}
{"input": "How do I activate MTN Internet on the Go?", "response": "Visit the MTN website or use the myMTN App to explore available mobile broadband plans, including portable data modems and devices for internet access on the go."}
{"input": "What is MTN Home Broadband?", "response": "MTN Home Broadband provides high-speed fixed internet services for homes and small offices, offering flexible and affordable data plans for uninterrupted internet connectivity."}
{"input": "How do I subscribe to MTN Home Broadband?", "response": "Visit the MTN website, contact customer service, or use the myMTN App to explore available broadband plans and select the one that suits your needs."}
{"input": "What is MTN Music+?", "response": "MTN Music+ is a music streaming service that offers users access to millions of songs, albums, and music videos, including local and international content, at affordable rates."}
{"input": "How do I subscribe to MTN Music+?", "response": "Dial *123# and follow the prompts to subscribe to MTN Music+. You can also download the MTN Music+ App for easier access to your favorite music."}
{"input": "What is MTN Video Streaming?", "response": "MTN Video Streaming service allows users to stream movies, TV shows, and other video content directly from their mobile devices or smart TVs."}
{"input": "How do I subscribe to MTN Video Streaming?", "response": "Dial 1316# to subscribe to MTN Video Streaming or use the myMTN App to select your preferred video content package."}
{"input": "What is MTN Call Me Back?", "response": "MTN Call Me Back allows you to send a request to another MTN user asking them to call you back, useful when you are unable to make a call due to insufficient balance."}
{"input": "How do I send a Call Me Back request with MTN?", "response": "Dial *133# and choose the option to send a \"Call Me Back\" request to another MTN number."}
{"input": "What is MTN Pay?", "response": "MTN Pay is a mobile payment service that allows users to pay for goods and services directly from their MTN mobile account without needing a bank account."}
{"input": "How do I use MTN Pay?", "response": "Dial *365# or use the myMTN App to add your payment method and start making secure payments for products and services."}
{"input": "What is MTN Money?", "response": "MTN Money is a mobile financial service that allows users to send and receive money, make payments, and manage their finances via their mobile phones."}
{"input": "How do I use MTN Money?", "response": "Dial *170# to access MTN Money and begin sending money, paying bills, and performing other mobile financial transactions."}
{"input": "What is MTN Mega Data Plan?", "response": "MTN Mega Data Plan is designed for users who need a large amount of data for heavy internet activities such as streaming, video conferencing, and downloading large files."}
{"input": "How do I subscribe to MTN Mega Data Plan?", "response": "Dial 1311# or use the myMTN App to select the Mega Data Plan and begin enjoying a large data allowance for your internet needs."}
{"input": "What is MTN Free 10MB?", "response": "MTN Free 10MB is a free data offer available to users who subscribe to specific plans, giving them 10MB of data at no cost to help them access the internet."}
{"input": "How do I claim my MTN Free 10MB?", "response": "Dial 1314# or check the myMTN App for more details on the Free 10MB offer and eligibility criteria."}
{"input": "What is MTN Data for Life?", "response": "MTN Data for Life is a data plan offering users uninterrupted internet access over a long period, with the option to select from various durations such as one year or more."}
{"input": "How do I subscribe to MTN Data for Life?", "response": "Dial 1313# or use the myMTN App to subscribe to the Data for Life plan and enjoy long-term internet access."}
{"input": "What is MTN Bonus Data?", "response": "MTN Bonus Data is a promotional data offer that gives users additional data as a bonus for purchasing specific data bundles, providing extra value to users."}
{"input": "How do I activate MTN Bonus Data?", "response": "Dial 1315# to access and activate the Bonus Data offer, or check the myMTN App for available bonus data options."}
{"input": "What is MTN International Direct Dialing (IDD)?", "response": "MTN International Direct Dialing (IDD) allows users to make international calls directly to any phone number abroad without the need for an operator, using MTN's competitive rates."}
{"input": "How do I use MTN International Direct Dialing (IDD)?", "response": "Dial the international number you wish to call, including the international dialing code, and MTN will route your call to the recipient."}
{"input": "What is MTN Digital TV?", "response": "MTN Digital TV is a service that allows users to stream television channels directly on their mobile devices or through digital TV receivers, providing both local and international content."}
{"input": "How do I subscribe to MTN Digital TV?", "response": "Dial 1318# or visit the myMTN App to subscribe to the Digital TV service and select your preferred channel package."}
{"input": "What is MTN Movie Club?", "response": "MTN Movie Club offers users access to a variety of movies through a subscription-based streaming platform, allowing them to watch on-demand movies anytime."}
{"input": "How do I subscribe to MTN Movie Club?", "response": "Dial 1233# to subscribe and get access to the latest movie titles available via MTN Movie Club."}
{"input": "What is MTN SMS Plus?", "response": "MTN SMS Plus is a service that offers discounted rates for users sending bulk SMS messages, particularly useful for businesses or events requiring mass communication."}
{"input": "How do I use MTN SMS Plus?", "response": "Dial *170# or visit the myMTN App to subscribe to the SMS Plus service, which allows businesses and individuals to send bulk SMS at a discounted rate."}
{"input": "What is MTN Internet Everywhere?", "response": "MTN Internet Everywhere is a nationwide internet service that offers reliable and high-speed data connectivity across multiple devices, such as laptops and mobile hotspots."}
{"input": "How do I subscribe to MTN Internet Everywhere?", "response": "Use the myMTN App or dial 131 to explore the available plans for the Internet Everywhere service and choose the one that fits your needs."}
{"input": "What is the MTN Data Plan, and how does it work?", "response": "The MTN Data Plan is a service that provides users with internet access for a set period and at a specific cost, based on different bundles. The plans are categorized by duration (daily, weekly, monthly, etc.), with varying data allowances and pricing."}
{"input": "How do I activate the MTN Data Plan on my mobile device?", "response": "To activate an MTN Data Plan, you can use the USSD code *131# or dial *904# to select your preferred bundle. You can also subscribe via the myMTN App or send a text to 312 to access the plan options."}
{"input": "What are the benefits of using MTN Data bundles over traditional internet services?", "response": "MTN Data bundles are designed to provide affordable and flexible internet access tailored to your usage needs. They come with various plan options, providing users the flexibility to choose data sizes and durations that suit their internet habits."}
{"input": "Can I roll over unused MTN Data to the next period?", "response": "Yes, MTN allows you to roll over unused data to the next period, ensuring you don't lose out on your remaining data. This feature is available for most data plans, provided you activate the data before your old plan expires."}
{"input": "How do I transfer data to another MTN user, and what are the limitations?", "response": "You can transfer data by dialing 1313# and following the prompts. The amount of data you can send varies depending on your data plan and account balance. You are limited by the amount of data available in your account."}
{"input": "What is the MTN Pulse plan, and how does it differ from regular prepaid plans?", "response": "MTN Pulse is a prepaid plan designed for young users, offering special benefits like free social media data, discounted calls, and additional bonuses on selected data bundles. It is tailored to meet the needs of youth and digital natives."}
{"input": "How can I activate MTN Pulse on my phone?", "response": "To activate MTN Pulse, simply dial *406# on your phone. This will switch you to the Pulse plan, which gives you access to special bundles, discounts, and offers targeted at young people."}
{"input": "What is the MTN Power Data plan, and how can I benefit from it?", "response": "MTN Power Data is a high-data bundle plan for heavy users who need large amounts of data for activities like streaming, gaming, and browsing. With this plan, you get more data for a lower cost, making it ideal for users with intensive data needs."}
{"input": "How do I subscribe to MTN Power Data, and what are the available options?", "response": "Dial 1316# or use the myMTN App to explore the MTN Power Data plans. Choose the plan that best fits your usage habits. Power Data plans offer flexible options for various data needs and usage levels."}
{"input": "What is MTN Music+, and how do I access it?", "response": "MTN Music+ is a music streaming service that offers subscribers access to a vast library of local and international music, including songs, albums, and playlists. It is available through the MTN Music+ App."}
{"input": "How do I subscribe to MTN Music+ and enjoy unlimited streaming?", "response": "Dial *123# or visit the myMTN App to subscribe to MTN Music+. Once subscribed, you can start streaming music on-demand through the Music+ App. You can choose from various subscription tiers based on your music preferences."}
{"input": "What is MTN Video Streaming, and how does it work?", "response": "MTN Video Streaming allows users to watch movies, TV shows, and video content directly on their mobile phones. By subscribing to a plan, you gain access to a variety of entertainment options, including local and international media."}
{"input": "How do I subscribe to MTN Video Streaming and start enjoying content?", "response": "Dial 1316# to subscribe to MTN Video Streaming, or access your plan through the myMTN App. You can then stream your favorite movies, series, and TV shows directly from the app or mobile browser."}
{"input": "What is MTN XtraTime, and how does it help users with airtime shortages?", "response": "MTN XtraTime is a service that allows users to borrow airtime, enabling them to make calls and send messages even when their account balance is low. The borrowed airtime will be deducted from the user\u0092s next recharge."}
{"input": "How do I borrow airtime using MTN XtraTime?", "response": "To borrow airtime, dial *606# and follow the prompts to select the amount of airtime you want to borrow. It is available for prepaid customers, and the service comes with an interest fee that will be deducted on your next recharge."}
{"input": "What are the available MTN Data Rollover options for users, and how can I enable them?", "response": "MTN Data Rollover allows users to carry over unused data to the next billing cycle. To enable rollover, ensure that your current plan supports it and that you subscribe to another plan before the old one expires."}
{"input": "How do I check if my unused MTN Data has rolled over?", "response": "You can check your data rollover status by dialing 1314# or through the myMTN App. If your plan supports rollover, you will see the balance of unused data available for the next period."}
{"input": "What is MTN Data Share, and how can I share data with family or friends?", "response": "MTN Data Share allows users to share their data balance with other MTN customers. To share data, you need to have a data bundle and select the recipient number when prompted. The data is transferred instantly."}
{"input": "How do I transfer data with MTN Data Share?", "response": "Dial 1317# and select the amount of data you want to share. You will be prompted to enter the recipient's phone number, and the data will be transferred directly to their account."}
{"input": "What is MTN Home Broadband, and how is it different from regular mobile data plans?", "response": "MTN Home Broadband is a fixed internet service that provides high-speed broadband internet to homes and offices. Unlike mobile data plans, Home Broadband is delivered via a router or modem that provides continuous internet access for multiple devices."}
{"input": "How do I subscribe to MTN Home Broadband, and what are the available plans?", "response": "To subscribe to MTN Home Broadband, you can visit the MTN website, use the myMTN App, or call customer service for details on the available plans and installation options. There are different plans depending on usage requirements."}
{"input": "What is MTN Pay and how does it work?", "response": "MTN Pay is a mobile payment solution that allows users to pay for goods and services, transfer money, and access other financial services directly through their mobile phones. The service is accessible using the *365# USSD code."}
{"input": "How do I make a payment with MTN Pay?", "response": "Dial *365# to access MTN Pay, where you can enter the payment details to complete your transactions, such as paying for airtime, services, or bills. You can also use the myMTN App for an easier payment experience."}
{"input": "What is MTN XtraData, and how is it different from regular data bundles?", "response": "MTN XtraData is a promotional data offer that provides additional data to customers on top of their regular data plan. It is designed for users who need more data at affordable rates, often offered as a bonus or add-on for specific plans."}
{"input": "How do I activate MTN XtraData?", "response": "Dial 1313# or use the myMTN App to add MTN XtraData to your existing data plan. You can choose from different options depending on the availability of the promotion."}
{"input": "What is MTN Business Solutions, and who can benefit from it?", "response": "MTN Business Solutions offers tailored services to businesses, including data plans, cloud storage, mobile payments, and more. It's designed to provide corporate customers with the tools they need for efficient communication and business growth."}
{"input": "How do I subscribe to MTN Business Solutions?", "response": "To subscribe to MTN Business Solutions, businesses can call customer service or visit the MTN Business website to learn more about the available packages and sign up for the most appropriate plan."}
{"input": "What is MTN Call Me Back service, and how does it benefit users?", "response": "MTN Call Me Back is a service that allows users to send a message to another MTN customer requesting them to call back, especially when their balance is insufficient for outgoing calls. This helps maintain communication even with low balance."}
{"input": "How do I send a Call Me Back request on MTN?", "response": "To use the Call Me Back service, dial *133# to send a request to another MTN customer. The recipient will be notified to return your call."}
{"input": "What is MTN International Direct Dialing, and how does it work for making international calls?", "response": "MTN International Direct Dialing (IDD) allows users to make international calls directly by dialing the country code and phone number without the need for operator assistance. The service offers competitive rates for global calls."}
{"input": "How do I make an international call using MTN IDD?", "response": "To make an international call, dial the country code followed by the phone number. Ensure you have sufficient balance, and the call will be routed via MTN\u0092s international network at competitive rates."}
{"input": "What is MTN Callertunez, and how can I set it on my phone?", "response": "MTN Callertunez is a service that allows users to personalize their caller tunes, replacing the default ringing tone with a song of their choice. You can select from a wide variety of music tracks available on the platform."}
{"input": "How do I activate MTN Callertunez on my phone?", "response": "Dial *410# to subscribe to MTN Callertunez, and follow the prompts to choose your preferred song as your caller tune. You can also browse the available catalog through the myMTN App for more options."}
{"input": "What is MTN Data for Life, and how does it work?", "response": "MTN Data for Life is a data plan that provides continuous internet access with recurring data allowances for a longer duration (e.g., one year). It\u0092s designed for users who prefer to pay once and enjoy uninterrupted internet for an extended period."}
{"input": "How do I subscribe to MTN Data for Life?", "response": "Dial 1314# or visit the myMTN App to activate the MTN Data for Life plan, where you can choose from various options based on your data usage and budget. Once subscribed, your data will renew for the next cycle without needing additional recharges."}
{"input": "What is MTN MoMo, and how does it differ from traditional mobile payments?", "response": "MTN MoMo (Mobile Money) is a digital payment solution that allows users to make payments, transfer money, and conduct financial transactions through their mobile phones, without needing a bank account. This service is available to all MTN users."}
{"input": "How do I use MTN MoMo for money transfers?", "response": "Dial *170# to access MTN MoMo, and select the transfer option. You can send money to any MoMo user or a non-MoMo account, and the funds will be transferred securely."}
{"input": "What is MTN\u0092s 5G network, and how does it differ from 4G?", "response": "MTN's 5G network offers ultra-fast internet speeds, low latency, and higher capacity compared to 4G networks. It enables better streaming, gaming, and the possibility for innovative technologies like autonomous vehicles."}
{"input": "How do I activate MTN\u0092s 5G network on my phone?", "response": "To activate MTN's 5G network, you need to ensure your phone supports 5G and is located in a 5G-enabled area. You can also check for 5G availability by visiting the MTN website or calling customer service for more information."}
{"input": "What are the benefits of using MTN's 5G network?", "response": "The benefits include faster internet speeds (up to 10 times faster than 4G), improved connectivity, enhanced streaming quality, low latency for real-time applications, and better network capacity for more users."}
{"input": "How do I check if my phone is compatible with MTN 5G?", "response": "You can check your phone\u0092s compatibility by visiting the MTN website for a list of compatible devices or by checking your phone\u0092s specifications to see if it supports 5G bands."}
{"input": "How can I enjoy MTN\u0092s 5G internet in my area?", "response": "To enjoy MTN\u0092s 5G internet, you need to be in an area where 5G coverage is available. You will also need a 5G-compatible device and an active 5G plan. MTN continuously expands its 5G coverage, so check the coverage map regularly."}
{"input": "What is MTN\u0092s Data Bank, and how does it work?", "response": "MTN Data Bank allows users to accumulate unused data and carry it over to future billing periods. You only need to activate your data plan before the old one expires for the rollover to occur."}
{"input": "How do I activate MTN Data Bank?", "response": "To activate MTN Data Bank, subscribe to a data plan that supports rollover, and ensure you use your data before it expires. This will allow you to store unused data for future use."}
{"input": "What is the MTN SmartData plan, and who is it suitable for?", "response": "The MTN SmartData plan is designed for users who need affordable yet flexible internet access. It offers data plans for different usage levels and allows easy management of data allocation, making it ideal for heavy internet users."}
{"input": "How can I subscribe to the MTN SmartData plan?", "response": "You can subscribe to the MTN SmartData plan by dialing 1315# or using the myMTN App to select from available SmartData plans based on your data needs and duration."}
{"input": "What is MTN Business Wi-Fi, and how does it work?", "response": "MTN Business Wi-Fi is a wireless broadband service that offers high-speed internet access to businesses using a Wi-Fi router. It is designed for offices and businesses that require constant, high-speed internet connectivity."}
{"input": "How do I subscribe to MTN Business Wi-Fi?", "response": "To subscribe, businesses need to visit the MTN Business website, select the Business Wi-Fi plan that suits their needs, and complete the registration process for installation."}
{"input": "What is the MTN Roaming service, and how can I activate it?", "response": "MTN Roaming allows you to use your mobile phone for calls, texting, and data services when you are abroad. To activate it, simply dial 1314# or visit the MTN roaming website for specific activation steps."}
{"input": "How do I activate MTN Roaming for international travel?", "response": "Before traveling, dial 1314# or use the myMTN App to activate roaming services. Ensure your account has sufficient balance to cover roaming charges, and check MTN\u0092s roaming agreements with the destination country."}
{"input": "What are the charges for MTN Roaming services?", "response": "Roaming charges vary depending on the country you\u0092re visiting. MTN offers competitive rates, which you can find on the MTN roaming page or by contacting customer service for specific rates for voice, SMS, and data services."}
{"input": "How do I deactivate MTN Roaming when I return to my home country?", "response": "To deactivate MTN Roaming, dial 1314# again, or use the myMTN App to disable international roaming services once you are back in your home country."}
{"input": "What is MTN\u0092s 4G LTE service, and how does it enhance my internet experience?", "response": "MTN\u0092s 4G LTE service offers fast internet speeds and improved connection quality, making activities like streaming, gaming, and video calls smoother and more reliable compared to 3G or slower networks."}
{"input": "How can I check if I have access to MTN 4G LTE in my area?", "response": "You can check MTN\u0092s 4G LTE coverage map on their website or by calling customer service. Make sure you also have a 4G-enabled device and an active 4G plan to access the service."}
{"input": "What are MTN\u0092s Mobile Money (MoMo) services, and how can I use them?", "response": "MTN\u0092s MoMo (Mobile Money) service allows users to make secure financial transactions like sending money, paying bills, and transferring funds via their mobile phones. It is available to all MTN customers, even without a bank account."}
{"input": "How do I send money using MTN MoMo?", "response": "Dial *170# to access MTN MoMo. Select the \"Send Money\" option, and follow the prompts to enter the recipient\u0092s details and the amount you want to transfer."}
{"input": "What are the fees associated with MTN MoMo transactions?", "response": "The fees for MTN MoMo transactions depend on the amount being transferred and the type of transaction. The fees are generally affordable, and you can view the specific rates for sending and receiving money through MoMo on their website."}
{"input": "What is MTN Callertunez, and how can I set it for my phone?", "response": "MTN Callertunez allows you to set a personalized song or tune as your caller ringtone, replacing the standard ringing sound for people calling you. You can choose a song from a wide variety available."}
{"input": "How can I deactivate MTN Callertunez?", "response": "To deactivate MTN Callertunez, dial 4104# and follow the prompts. You can also manage your Callertunez subscription using the myMTN App."}
{"input": "What is the MTN Data Save feature, and how does it help me use less data?", "response": "MTN Data Save helps reduce data consumption by compressing websites and apps that use high data. It can save you up to 50% on your regular data usage without compromising your browsing experience."}
{"input": "How do I activate the MTN Data Save feature?", "response": "To activate MTN Data Save, go to the myMTN App, select the \"Data Save\" feature, and follow the prompts to enable it. Alternatively, you can dial 1314# to activate it from your phone."}
{"input": "What is MTN\u0092s Family and Friends (F&F) service, and how does it work?", "response": "MTN\u0092s Family and Friends service allows you to designate specific numbers as \u0093family and friends,\u0094 so that calls to those numbers are cheaper. You can save on call costs to the selected numbers on your list."}
{"input": "How do I add numbers to my MTN Family and Friends list?", "response": "To add a number to your F&F list, dial 1312#, select \"Add Number,\" and enter the number you want to add. You can also use the myMTN App to manage your list."}
{"input": "How can I remove a number from my MTN Family and Friends list?", "response": "To remove a number, dial 1312# and select \"Remove Number.\" You can also access this feature in the myMTN App, where you can delete numbers you no longer wish to include in your list."}
{"input": "What is MTN\u0092s PayGo (Pay-As-You-Go) plan, and how does it work?", "response": "MTN\u0092s PayGo plan is a prepaid plan where you pay for the services you use in real-time. This means you are charged based on your calls, data, and other services as you use them, with no need to commit to a long-term plan."}
{"input": "How do I switch to the MTN PayGo plan?", "response": "To switch to the MTN PayGo plan, simply dial *131# and follow the prompts to choose the PayGo option. You will be charged for services based on your actual usage."}
{"input": "What is MTN\u0092s Call Me Back feature, and how does it help when I\u0092m low on balance?", "response": "The Call Me Back feature allows you to send a message to another MTN user requesting them to call you back, especially when your balance is insufficient to make calls. The message will be free of charge."}
{"input": "How do I use MTN\u0092s Call Me Back feature?", "response": "Dial *133# to send a Call Me Back request to another MTN user. The recipient will receive a notification to call you back."}
{"input": "How can I check my MTN account balance for airtime and data?", "response": "To check your MTN account balance, dial *131# for airtime balance and 1314# for data balance. You can also use the myMTN App to monitor your balance in real-time."}
{"input": "What is the MTN Emergency Credit service, and how does it help in times of low balance?", "response": "The MTN Emergency Credit service provides users with a small loan of airtime when they have no balance left. It allows you to make calls and send messages until you can top up again."}
{"input": "How do I activate MTN Emergency Credit?", "response": "Dial *606# to activate MTN Emergency Credit. Depending on your account history and balance, you can borrow a small amount of airtime to use for emergency calls or messages."}
{"input": "What are MTN\u0092s Postpaid plans, and how do they differ from prepaid?", "response": "MTN\u0092s Postpaid plans allow users to pay for their services at the end of the month rather than in advance. These plans typically offer more flexible data, call minutes, and SMS allowances, which are billed monthly."}
{"input": "How can I switch from a prepaid to a postpaid MTN plan?", "response": "To switch from prepaid to postpaid, visit any MTN store or use the myMTN App. You will need to provide necessary documentation such as ID and proof of address."}
{"input": "What is MTN\u0092s Free Wi-Fi service, and where can I use it?", "response": "MTN\u0092s Free Wi-Fi service is available in select public places such as malls, airports, and shopping centers. Users can connect to the Wi-Fi network for free and enjoy fast internet for a limited time."}
{"input": "How can I find MTN Free Wi-Fi hotspots near me?", "response": "You can find MTN Free Wi-Fi hotspots using the myMTN App, which shows the nearest locations where you can access free Wi-Fi. You can also visit MTN's website for more information on their free Wi-Fi services."}
{"input": "What is the MTN SafetyNet, and how does it protect my mobile device?", "response": "MTN SafetyNet is a service that protects your mobile phone from viruses, malware, and other online threats. It also includes a device tracker and remote lock features to help keep your phone safe."}
{"input": "How do I activate MTN SafetyNet?", "response": "To activate MTN SafetyNet, dial 1313# or download the MTN SafetyNet App from your device\u0092s app store. The service provides security features to protect your phone from potential risks."}
{"input": "What is MTN Group?", "response": "MTN Group is a multinational telecommunications company headquartered in South Africa. It provides mobile network services across 20+ countries."}
{"input": "What countries does MTN operate in?", "response": "MTN operates in over 20 countries, mostly in Africa and the Middle East, including Nigeria, South Africa, and Ghana."}
{"input": "How many subscribers does MTN have?", "response": "MTN has over 289 million subscribers as of 2022, making it the largest mobile network provider in Africa."}
{"input": "What services does MTN offer?", "response": "MTN offers mobile networks, data services, mobile money, digital services, and other telecom-related services."}
{"input": "How can I contact MTN customer service?", "response": "You can contact MTN customer service by calling 180 (from an MTN line), using their myMTN app, or visiting a local MTN store."}
{"input": "What is the MTN data network?", "response": "MTN provides 2G, 3G, 4G, and 5G mobile data networks, depending on the region and infrastructure available."}
{"input": "Does MTN offer mobile money services?", "response": "Yes, MTN offers mobile money services through MTN MoMo in several countries, enabling users to transfer money, pay bills, and more."}
{"input": "How can I check my MTN data balance?", "response": "Dial *131# or use the myMTN app to check your data balance."}
{"input": "How can I subscribe to MTN\u0092s data bundles?", "response": "You can subscribe to MTN\u0092s data bundles via USSD by dialing *321# or using the myMTN app."}
{"input": "How can I buy MTN airtime?", "response": "You can buy airtime through USSD (*555#), the myMTN app, or visit authorized vendors and retail outlets."}
{"input": "What is MTN's coverage in rural areas?", "response": "MTN is expanding its network in rural areas to improve coverage, focusing on providing internet and mobile connectivity."}
{"input": "What is MTN's role in corporate social responsibility?", "response": "MTN focuses on education, health, and environmental initiatives, investing in various social projects across Africa."}
{"input": "How do I get an MTN SIM card?", "response": "You can get an MTN SIM card by visiting an MTN store or authorized retailer, ensuring that you provide valid ID for registration."}
{"input": "How do I check my MTN call history?", "response": "Dial *131# to access call history, or use the myMTN app for detailed records."}
{"input": "What is MTN\u0092s partnership with PayPal?", "response": "MTN has partnered with PayPal to enable users to link their MTN accounts for easier mobile payment and e-commerce transactions."}
{"input": "How can I activate MTN SafetyNet?", "response": "Dial 1313# to activate MTN SafetyNet for mobile security features such as malware protection and device tracking."}
{"input": "How do I unsubscribe from MTN\u0092s subscription services?", "response": "You can unsubscribe from MTN\u0092s subscription services by dialing *141# or following the instructions in the myMTN app."}
{"input": "What is MTN\u0092s coverage in urban areas?", "response": "MTN offers extensive coverage in urban areas, with strong 4G and 5G networks in major cities across its operating countries."}
{"input": "How can I transfer airtime to someone on MTN?", "response": "To transfer airtime to another MTN number, dial *777# and follow the prompts to complete the transfer."}
{"input": "What is MTN's policy on data rollover?", "response": "MTN allows unused data from certain plans to roll over for a limited time, ensuring that you can use your remaining data in the next month."}
{"input": "How do I check my MTN data balance?", "response": "You can check your MTN data balance by dialing *131# from your MTN line. Alternatively, you can use the myMTN app for a detailed view of your data usage."}
{"input": "How do I activate MTN's data bundles?", "response": "To activate MTN data bundles, dial *321# or *904# for different options. You can also use the myMTN app or SMS to subscribe to the available bundles."}
{"input": "What are the available MTN data bundles?", "response": "MTN offers a variety of data bundles, including daily, weekly, and monthly plans, with options for social media, video streaming, and general internet browsing."}
{"input": "How can I transfer data to another MTN user?", "response": "You can transfer data to another MTN number by dialing 1312# and selecting the amount of data you wish to send. The recipient will receive the data instantly."}
{"input": "How can I check my MTN airtime balance?", "response": "To check your airtime balance, simply dial *556# or use the myMTN app to view both your airtime and data balance in real time."}
{"input": "How do I purchase MTN airtime online?", "response": "You can purchase airtime online through various platforms, including the myMTN app, your bank's mobile app, or third-party websites like Paystack and Flutterwave."}
{"input": "What is MTN\u0092s mobile money service?", "response": "MTN offers mobile money services through MTN MoMo, allowing users to send and receive money, pay bills, and perform other financial transactions directly from their mobile phones."}
{"input": "How do I activate MTN MoMo on my phone?", "response": "To activate MTN MoMo, dial *365# and follow the prompts to register your MoMo account. You will need to provide some personal details and set a PIN for security."}
{"input": "What is MTN\u0092s 4G LTE service?", "response": "MTN's 4G LTE service provides high-speed mobile internet with faster download and upload speeds, allowing for better streaming, browsing, and gaming experiences on compatible devices."}
{"input": "How do I enable MTN 4G LTE on my phone?", "response": "To enable MTN 4G LTE, ensure that your device supports 4G and that you are in an area with 4G coverage. Then, enable 4G in your phone\u0092s network settings."}
{"input": "How can I track my MTN data usage?", "response": "You can track your data usage by dialing 1314# or using the myMTN app, which provides real-time updates on your data consumption."}
{"input": "What is MTN\u0092s mobile hotspot service?", "response": "MTN offers mobile hotspot devices that allow users to connect multiple devices to the internet by sharing a 3G or 4G data connection, offering convenient internet access on the go."}
{"input": "How can I set up a mobile hotspot on MTN?", "response": "To set up a mobile hotspot on MTN, go to your device\u0092s settings, enable the hotspot feature, and configure it to share your MTN mobile data."}
{"input": "What is MTN's Wi-Fi service?", "response": "MTN offers Wi-Fi services in select locations, providing fast internet access in public places like shopping malls, airports, and cafes. You can access it through the MTN Wi-Fi network."}
{"input": "How do I connect to MTN Wi-Fi?", "response": "To connect to MTN Wi-Fi, search for available MTN Wi-Fi hotspots in your area and select the network. You may need to log in or get an access code through the myMTN app."}
{"input": "What is MTN's call forwarding feature?", "response": "MTN\u0092s call forwarding service allows users to redirect incoming calls to another number, either when the line is busy, unanswered, or unreachable. Dial 21 followed by the number to activate it."}
{"input": "How can I activate MTN call forwarding?", "response": "To activate call forwarding, dial 21 followed by the number you wish to forward your calls to. To deactivate, dial #21#."}
{"input": "What is MTN\u0092s international roaming service?", "response": "MTN offers international roaming services that allow you to use your MTN number while traveling abroad, with voice, SMS, and data services available in over 160 countries."}
{"input": "How do I activate MTN international roaming?", "response": "To activate MTN\u0092s international roaming, dial *567# or contact MTN customer service before traveling to ensure your roaming is set up."}
{"input": "What is MTN\u0092s Wi-Fi Calling service?", "response": "MTN Wi-Fi Calling allows you to make calls over a Wi-Fi network instead of a mobile network, which can be useful in areas with poor mobile signal but good internet coverage."}
{"input": "How do I enable MTN Wi-Fi Calling on my phone?", "response": "To enable Wi-Fi Calling, go to your phone\u0092s settings and turn on Wi-Fi calling under the mobile network settings if your device and plan support this feature."}
{"input": "How can I block unwanted calls on MTN?", "response": "You can block unwanted calls by activating the call barring feature or by using third-party apps to blacklist specific numbers on your MTN line."}
{"input": "How do I activate call barring on MTN?", "response": "To activate call barring, dial 35 followed by your desired barring type (e.g., incoming, outgoing) and then the number you wish to block."}
{"input": "What is MTN\u0092s value-added services (VAS)?", "response": "MTN\u0092s value-added services include subscription-based services for music, games, education, and entertainment, allowing customers to access additional content and perks."}
{"input": "How do I subscribe to MTN's value-added services?", "response": "You can subscribe to MTN\u0092s VAS by dialing specific USSD codes for services such as MTN Music+, MTN Play, or by sending keywords to 312."}
{"input": "How do I cancel MTN subscription services?", "response": "To cancel a subscription service, dial *141# and follow the prompts to unsubscribe from any active subscriptions. You can also manage services via the myMTN app."}
{"input": "How can I check if my MTN SIM card is registered?", "response": "To check if your MTN SIM card is registered, dial *789# or visit any MTN store with a valid ID for verification and registration if necessary."}
{"input": "How do I update my MTN SIM registration details?", "response": "To update your SIM registration details, visit an MTN store with your identification document for the necessary changes to be made."}
{"input": "What is MTN\u0092s security service, SafetyNet?", "response": "MTN SafetyNet is a service that offers protection against malware, viruses, and other mobile security threats, including device tracking and remote lock capabilities."}
{"input": "How do I activate MTN SafetyNet?", "response": "Dial 1313# to activate MTN SafetyNet, or download the MTN SafetyNet app from your device\u0092s app store to activate and set up mobile security."}
{"input": "What is MTN\u0092s \"Free Wi-Fi\" offer?", "response": "MTN\u0092s Free Wi-Fi offer gives customers access to free Wi-Fi in select public areas for a limited period, allowing users to browse the internet without data charges."}
{"input": "How do I access MTN\u0092s Free Wi-Fi?", "response": "To access MTN\u0092s Free Wi-Fi, find an MTN Wi-Fi hotspot location, connect to the network, and enjoy free internet for a limited time based on the location and terms."}
{"input": "What is MTN\u0092s customer loyalty program?", "response": "MTN has a customer loyalty program that rewards long-term customers with discounts, special offers, and exclusive services based on usage and engagement."}
{"input": "How can I participate in MTN's loyalty program?", "response": "You can participate in MTN\u0092s loyalty program by accumulating points through continued usage of MTN services. The more points you collect, the better the rewards."}
{"input": "How do I reset my MTN PIN?", "response": "To reset your MTN PIN, dial 1216# and follow the prompts to securely reset your PIN for account protection."}
{"input": "How do I access MTN\u0092s mobile internet on my laptop?", "response": "To access MTN\u0092s mobile internet on your laptop, you can use an MTN mobile hotspot or USB modem to connect your laptop to MTN's data network."}
{"input": "What is MTN\u0092s SIM swap policy?", "response": "MTN allows users to swap their SIM cards in case of loss, theft, or damage. You must visit an MTN store with valid identification to complete the swap process."}
{"input": "How do I perform a SIM swap on MTN?", "response": "To perform a SIM swap, visit an MTN service center with a valid ID and fill out the required forms to swap your SIM card for a new one."}
{"input": "How does MTN\u0092s e-commerce service work?", "response": "MTN\u0092s e-commerce service includes platforms where users can purchase goods and services, ranging from electronics to digital content, using MTN\u0092s mobile money or airtime."}
{"input": "How do I pay for goods through MTN\u0092s e-commerce platform?", "response": "To pay for goods via MTN\u0092s e-commerce platform, you can use MTN MoMo, mobile airtime, or bank card depending on the vendor\u0092s payment options."}
{"input": "What is MTN's \"Digital Services\" offering?", "response": "MTN's Digital Services include mobile banking, entertainment, streaming, gaming, and education content, designed to provide customers with more value through mobile technology."}
{"input": "How do I subscribe to MTN\u0092s Digital Services?", "response": "To subscribe to MTN\u0092s Digital Services, you can visit their digital content platform or dial specific USSD codes for services like music, movies, and educational content."}
{"input": "How can I register my SIM card in Nigeria?", "response": "To register a SIM card in Nigeria, you need to provide your National Identification Number (NIN), along with biometric information (fingerprint and face capture) at an authorized registration center."}
{"input": "What is the National Identification Number (NIN)?", "response": "The National Identification Number (NIN) is a unique identification number assigned to Nigerian citizens by the National Identity Management Commission (NIMC) for national security and identity purposes."}
{"input": "How do I link my NIN to my MTN SIM?", "response": "To link your NIN to your MTN SIM, dial *785# and follow the prompts to provide your NIN details. Alternatively, visit an MTN center for manual registration."}
{"input": "What documents are needed for SIM registration in Nigeria?", "response": "For SIM registration in Nigeria, you need a valid NIN, a form of identification (e.g., passport, driver\u0092s license), and biometric details (fingerprint and face capture)."}
{"input": "What happens if my NIN is not linked to my SIM card?", "response": "If your NIN is not linked to your SIM card, you risk having your number deactivated, as the Nigerian government has mandated all SIM cards to be linked to the NIN."}
{"input": "How can I perform a SIM swap?", "response": "To perform a SIM swap, visit an MTN service center with a valid form of ID. You will need to fill out a form and provide details for the swap."}
{"input": "What is SIM swapping?", "response": "SIM swapping refers to the process of replacing your old SIM card with a new one, typically when your old SIM is lost, damaged, or stolen."}
{"input": "How do I retrieve a lost or stolen MTN SIM card?", "response": "To retrieve a lost or stolen MTN SIM card, visit an MTN service center with valid ID and request a replacement SIM. You may need to provide proof of ownership."}
{"input": "How do I upgrade my SIM card to 4G?", "response": "To upgrade your SIM card to 4G, visit an MTN store or use the MTN app, providing your valid ID and requesting a 4G-compatible SIM."}
{"input": "What is a SIM card upgrade?", "response": "A SIM card upgrade refers to moving from a 3G SIM to a 4G or 5G-compatible SIM to enjoy faster internet speeds and enhanced services."}
{"input": "Can I perform a SIM upgrade online?", "response": "You can request a SIM upgrade online by visiting MTN\u0092s website or using their mobile app, though you may need to visit an MTN store for verification and to collect your new SIM."}
{"input": "How do I know if my SIM is compatible with 4G?", "response": "To know if your SIM is 4G compatible, check the SIM card packaging or visit an MTN store for a compatibility check. Additionally, dial 1314# to check for 4G availability in your area."}
{"input": "What is the process for SIM card registration in Nigeria?", "response": "SIM card registration in Nigeria requires providing a valid NIN, biometric data (fingerprints and facial recognition), and a valid ID card, which must be done at authorized centers."}
{"input": "How do I link my NIN to my MTN account?", "response": "To link your NIN to your MTN account, dial *785#, or visit the MTN website or app to link your details. Ensure your NIN is updated in the National Identity Database."}
{"input": "How can I check if my NIN is linked to my SIM?", "response": "You can check if your NIN is linked to your MTN SIM by dialing 7851# or visiting an MTN service center for assistance."}
{"input": "What happens if my SIM is not registered or linked to NIN?", "response": "If your SIM is not registered or linked to NIN, it may be deactivated by the Nigerian Communications Commission (NCC) as part of the government's NIN-SIM linkage policy."}
{"input": "Can I register a new SIM without an NIN?", "response": "No, according to Nigerian law, it is now mandatory to provide an NIN for SIM registration, and this requirement is enforced by the NCC."}
{"input": "What should I do if I forget my SIM card PIN?", "response": "If you forget your SIM card PIN, you can unblock it by entering the PUK (Personal Unblocking Key) code, which is usually provided with your SIM card packaging or by contacting MTN customer service."}
{"input": "How do I block a SIM card if it\u0092s lost or stolen?", "response": "To block a lost or stolen MTN SIM card, contact MTN customer service by dialing 180 and request that they block your SIM to prevent unauthorized use."}
{"input": "How can I deactivate my MTN SIM card?", "response": "To deactivate your MTN SIM card, you must contact MTN customer service to request a deactivation or visit an MTN store for assistance."}
{"input": "What is the MTN SIM replacement policy?", "response": "MTN allows SIM replacements due to loss, damage, or theft. You will need to provide valid identification and possibly fill out a form at a service center for a replacement."}
{"input": "How can I upgrade my SIM to 5G on MTN?", "response": "To upgrade your SIM to 5G, visit an MTN store with valid identification, and the staff will assist you in swapping your SIM for a 5G-compatible one."}
{"input": "Can I upgrade my SIM online to 5G?", "response": "Currently, SIM upgrades to 5G are available at physical MTN stores. You may contact MTN customer service for more details on how to request an upgrade."}
{"input": "What happens if my SIM is blocked for not linking NIN?", "response": "If your SIM is blocked due to not linking your NIN, you will need to visit an MTN store to provide your NIN and get your SIM reactivated."}
{"input": "How long does it take to link my NIN to my SIM?", "response": "The NIN linking process is usually quick and can be done within a few minutes by dialing *785# or visiting an MTN store."}
{"input": "Can I change my SIM card number?", "response": "Yes, you can request a SIM number change by visiting an MTN service center with your ID and completing the necessary form for a new number."}
{"input": "How do I retrieve my NIN if I\u0092ve forgotten it?", "response": "If you forget your NIN, you can retrieve it by visiting the NIMC website or contacting their support for assistance."}
{"input": "How can I update my NIN information with MTN?", "response": "To update your NIN information with MTN, visit an MTN store with your NIN slip and request an update to your registered details."}
{"input": "What is MTN\u0092s SIM card registration process for foreigners?", "response": "Foreigners can register an MTN SIM card by providing their passport, visa, or residence permit, along with a valid NIN and biometric data at an authorized MTN registration center."}
{"input": "How do I perform an international SIM swap?", "response": "For international SIM swaps, contact MTN customer service or visit an MTN store to request a swap while ensuring that you provide valid identification and proof of ownership."}
{"input": "How do I activate my new MTN SIM card?", "response": "After swapping or receiving a new SIM card, insert it into your phone and dial *123# to activate it. You may also need to enter a PIN for activation."}
{"input": "Can I use my MTN SIM in another device after activation?", "response": "Yes, you can use your MTN SIM in any unlocked device after activation. Just ensure the device supports the network frequency of MTN."}
{"input": "What are the benefits of SIM registration in Nigeria?", "response": "SIM registration helps in identifying subscribers, improving national security, preventing fraud, and complying with the government\u0092s policies."}
{"input": "How do I know if my MTN SIM has been activated?", "response": "Once you have inserted your SIM into your phone and dialed *123# or *131#, your MTN SIM will be activated if you receive a response."}
{"input": "How can I retrieve my MTN SIM PIN?", "response": "The PIN can be retrieved from your SIM packaging or by contacting MTN customer service if you\u0092ve forgotten it."}
{"input": "Can I change my SIM PIN?", "response": "Yes, you can change your SIM PIN by dialing *789# and following the instructions for PIN management. You will need to know your current PIN to make the change."}
{"input": "How do I transfer my MTN number to another network?", "response": "To port your MTN number to another network, visit your desired network\u0092s customer service center, complete a form, and provide your MTN account details."}
{"input": "What should I do if my SIM is not working?", "response": "If your SIM is not working, first check if your phone is compatible and supports the network. You may also need to check if your SIM is properly inserted or visit an MTN store."}
{"input": "How do I check if my SIM swap was successful?", "response": "You can check if your SIM swap was successful by dialing *123# to check if your old number is active or if your new SIM is working properly."}
{"input": "What should I do if my SIM is damaged?", "response": "If your SIM card is damaged, visit an MTN store with a valid ID and request a replacement. You may also need to provide your NIN for verification."}
{"input": "How do I update my NIN details if there is a change?", "response": "If you need to update your NIN, visit the nearest NIMC office, fill out the necessary form, and provide valid documents for the update."}
{"input": "How long does it take to link NIN to my MTN SIM?", "response": "Linking your NIN to your MTN SIM is usually completed within minutes by dialing *785# or visiting an MTN service center."}
{"input": "What happens if I don\u0092t update my NIN?", "response": "If you don\u0092t update your NIN, you risk your SIM being deactivated, as all SIM cards in Nigeria must be linked to NIN according to government regulations."}
{"input": "Can I link multiple SIM cards to my NIN?", "response": "Yes, you can link multiple SIM cards to your NIN, but each SIM card must be individually registered and linked to your NIN through the appropriate process."}
{"input": "How can I check the status of my NIN link to my MTN SIM?", "response": "To check if your NIN is linked to your MTN SIM, dial 7851# or visit an MTN service center."}
{"input": "What happens if I use a SIM after it's been deactivated?", "response": "If your SIM is deactivated, it will not work for making calls, sending messages, or accessing data until reactivation is done by linking the NIN or following the reactivation steps."}
{"input": "Can I reactivate my MTN SIM without visiting a service center?", "response": "Yes, you can reactivate your MTN SIM by dialing *785#, but if you face difficulties, visiting an MTN store may be necessary for further assistance."}
{"input": "What is the difference between SIM swapping and SIM retrieval?", "response": "SIM swapping involves replacing your SIM with a new one, while SIM retrieval means getting a replacement for a lost or damaged SIM, often involving a new SIM card with the same number."}
{"input": "How can I retrieve my SIM if I am abroad?", "response": "If you are abroad and need to retrieve your SIM, you can contact MTN customer service to arrange for the SIM replacement or visit an MTN branch in the country where you reside."}
{"input": "Can I upgrade from 3G to 4G without changing my number?", "response": "Yes, you can upgrade from 3G to 4G without changing your number. Simply visit an MTN store and request a 4G-compatible SIM card replacement."}
{"input": "How can I check my current SIM card type (3G/4G)?", "response": "You can check your current SIM type by dialing 1314# or by visiting an MTN service center."}
{"input": "What happens if my SIM card is not compatible with 4G?", "response": "If your SIM is not compatible with 4G, you need to swap your current SIM for a 4G-compatible one at an MTN store or authorized service center."}
{"input": "How can I track my NIN status in Nigeria?", "response": "You can track your NIN status by visiting the NIMC official website or contacting their customer service center for updates regarding your NIN registration and status."}
{"input": "What is the process for upgrading my SIM to 5G?", "response": "To upgrade to 5G, visit an MTN store with a valid ID, and request a 5G-compatible SIM. The process requires you to complete the necessary steps at the service center."}
{"input": "How can I ensure my NIN is correctly linked to my SIM?", "response": "To ensure your NIN is correctly linked, visit an MTN service center with your NIN slip and other documents for validation and correction if necessary."}
{"input": "What is the MTN SIM swap policy?", "response": "The MTN SIM swap policy allows for SIM replacement due to theft, damage, or loss, and requires you to provide identity verification before issuing a new SIM."}
{"input": "How long does it take to get a new SIM after swapping?", "response": "After initiating a SIM swap, it may take up to 24 hours to receive the new SIM card. The process can be faster if done in an MTN store or authorized service center."}
{"input": "Can I swap my MTN SIM card online?", "response": "SIM swaps generally require visiting an MTN store or authorized center. However, some initial verification steps can be done online via the MTN website or app."}
{"input": "How can I upgrade my SIM card for better data speeds?", "response": "To upgrade your SIM for better data speeds, visit an MTN store, request a SIM swap, and ensure that you select a higher capacity SIM that supports 4G or 5G networks."}
{"input": "What are the benefits of SIM registration?", "response": "SIM registration ensures security, prevents fraud, helps in national security, and ensures that your phone number remains in your possession for communications."}
{"input": "How do I know if my MTN SIM is 5G enabled?", "response": "To check if your MTN SIM is 5G-enabled, visit an MTN store or use the *131# service to check compatibility with the latest 5G technology."}
{"input": "What should I do if I forget my SIM card PUK?", "response": "If you forget your SIM card PUK, contact MTN customer service or check the original SIM packaging for the PUK code to unblock your SIM."}
{"input": "How do I activate my new MTN SIM card?", "response": "To activate your new MTN SIM card, insert it into your phone and dial *123# or follow the activation instructions provided with the SIM."}
{"input": "Can I link my NIN to more than one SIM card?", "response": "Yes, you can link your NIN to multiple SIM cards, but you must complete the linking process for each SIM individually."}
{"input": "What should I do if my SIM is blocked after linking my NIN?", "response": "If your SIM is blocked, ensure that the correct NIN was linked. If necessary, visit an MTN store for assistance and reactivation of the SIM card."}
{"input": "How do I perform a SIM retrieval for a damaged SIM?", "response": "For a damaged SIM retrieval, visit an MTN store with your ID, and provide details for a replacement SIM. If the SIM is under warranty, you may be eligible for a free replacement."}
{"input": "How can I know if my NIN is valid?", "response": "You can verify your NIN\u0092s validity by visiting the NIMC website, or by using any online services provided by NIMC to check its status and authenticity."}
{"input": "What is the SIM upgrade process for a different network?", "response": "The SIM upgrade process for a different network involves getting a new SIM card from the desired network provider, completing their registration, and possibly porting your old number."}
{"input": "Can I retrieve my MTN SIM card from any service center?", "response": "You can retrieve your MTN SIM card from any MTN service center, but ensure that you provide the necessary identification and proof of ownership for verification."}
{"input": "How can I check if my MTN SIM is linked to my NIN?", "response": "Dial 7851# to check if your NIN is linked to your MTN SIM. If there is any issue, visit the nearest MTN service center for verification."}
{"input": "What should I do if my SIM card is blocked?", "response": "If your SIM is blocked, you need to visit an MTN store with a valid ID to resolve the issue, or you can dial *785# to initiate the unblocking process."}
{"input": "Can I retrieve my lost MTN SIM without a NIN?", "response": "No, you must have your NIN linked to retrieve your lost MTN SIM. Visit an MTN service center with your NIN and ID for SIM retrieval."}
{"input": "How do I upgrade from a 3G SIM to a 4G SIM?", "response": "You can upgrade your 3G SIM to a 4G SIM at any MTN store or service center by requesting a new SIM card with 4G compatibility."}
{"input": "How long does it take for a new SIM to be activated?", "response": "A new SIM is typically activated within a few minutes of insertion into your phone. However, it may take up to 24 hours in some cases."}
{"input": "Can I change the number on my MTN SIM?", "response": "You cannot change the number of your current MTN SIM. If you want a new number, you will need to get a new SIM card and update your contact information."}
{"input": "What is the difference between a SIM swap and SIM retrieval?", "response": "SIM swap refers to replacing a SIM due to theft or loss, while SIM retrieval is when you get a replacement SIM if yours is damaged or lost but still have your number."}
{"input": "Can I upgrade my SIM from 4G to 5G?", "response": "Yes, you can upgrade your SIM to 5G by visiting an MTN service center and requesting a 5G-compatible SIM. Availability depends on network coverage in your area."}
{"input": "How can I register my NIN with MTN?", "response": "To register your NIN with MTN, dial *785# and follow the prompts. Alternatively, visit an MTN store with your NIN for in-person registration."}
{"input": "What should I do if I lose my phone with an MTN SIM?", "response": "If you lose your phone, immediately contact MTN customer service or visit an MTN store to block your SIM and prevent unauthorized use."}
{"input": "How do I update my personal information on MTN?", "response": "To update your personal details, visit an MTN store with the necessary documents, such as an ID or proof of address, to complete the update process."}
{"input": "Can I link my NIN to my MTN SIM if I am using a different network?", "response": "Yes, you can link your NIN to your MTN SIM even if you're using a different network. However, you may need to swap the SIM if it\u0092s incompatible with MTN's NIN registration."}
{"input": "How do I verify my NIN status for SIM registration?", "response": "You can verify your NIN status by visiting the NIMC portal or contacting their customer service. MTN will also confirm this when you attempt to link it to your SIM."}
{"input": "Can I upgrade to 5G from a 4G SIM?", "response": "Yes, if you have a 4G SIM, you can upgrade it to 5G at an MTN store. The store will issue a new SIM card that is compatible with the 5G network."}
{"input": "What documents are required for SIM swap?", "response": "For a SIM swap, you need to provide a valid ID (such as a National ID or driver\u0092s license), and in some cases, proof of identity via biometric verification."}
{"input": "Can I retrieve my MTN SIM if I don\u0092t have the original documents?", "response": "You must have some form of valid identification to retrieve your SIM. MTN may request biometric verification or other forms of ID for identification purposes."}
{"input": "How can I cancel my SIM swap request?", "response": "To cancel a SIM swap request, contact MTN customer service immediately, or visit an MTN store to request cancellation."}
{"input": "How long does it take to complete a SIM swap?", "response": "A SIM swap is generally completed within 24 hours, but the process may be faster if completed at an MTN service center."}
{"input": "Can I transfer my MTN number to a different network?", "response": "Yes, you can transfer your MTN number to a different network via Mobile Number Portability (MNP), which requires initiating the process with your new network provider."}
{"input": "Can I retrieve a deactivated SIM card?", "response": "If your SIM has been deactivated due to NIN linking issues or inactivity, visit an MTN store with your valid ID to check if it can be reactivated."}
{"input": "What happens if I don't register my SIM card?", "response": "If you don't register your SIM card with your NIN, you risk having it deactivated as per government regulations requiring all SIM cards to be linked to a valid NIN."}
{"input": "How can I get a replacement for my damaged SIM card?", "response": "To get a replacement for your damaged SIM, visit an MTN store with a valid ID, and they will issue you a new SIM card, often for free if the damage is not due to misuse."}
{"input": "How do I link my NIN to multiple MTN SIM cards?", "response": "To link your NIN to multiple MTN SIM cards, visit an MTN store with your NIN, where they will link each SIM to the same NIN. You can also dial *785# for linkage."}
{"input": "What are the benefits of registering my SIM with NIN?", "response": "Registering your SIM with NIN ensures that your SIM card is valid, secure, and compliant with government regulations. It also helps to protect against fraudulent activities."}
{"input": "How can I upgrade my SIM to a higher capacity?", "response": "To upgrade your SIM to a higher capacity, visit an MTN service center, where they will assess your current SIM card and provide you with a higher-capacity one."}
{"input": "Can I swap my SIM online?", "response": "Currently, SIM swaps cannot be completed entirely online. However, you can start the process on the MTN website or app and complete it at an MTN service center."}
{"input": "How do I upgrade my SIM card for better data services?", "response": "Visit an MTN service center, request a SIM upgrade to a higher capacity, and they will issue a new SIM card with improved data services and faster speeds."}
{"input": "What should I do if my SIM is showing 'No Service'?", "response": "If your SIM is showing 'No Service', try restarting your phone or checking if the SIM is properly inserted. If the issue persists, visit an MTN store for assistance."}
{"input": "What if my SIM is permanently damaged?", "response": "If your SIM is permanently damaged, you will need to visit an MTN store to get a new SIM card. Ensure you bring a valid ID for verification."}
{"input": "How can I prevent my MTN SIM from being deactivated?", "response": "To prevent your MTN SIM from being deactivated, ensure that it is registered with a valid NIN. Also, regularly top up your account and use the services to avoid deactivation."}
{"input": "Can I upgrade my SIM card to access new services?", "response": "Yes, upgrading your SIM card may allow you to access newer technologies like 4G and 5G networks, as well as improved data speeds and other network services."}
{"input": "How do I confirm that my SIM has been successfully swapped?", "response": "After a SIM swap, you should receive a confirmation message from MTN. If you don't, visit an MTN store or dial *123# to confirm your new SIM activation."}
{"input": "What steps should I follow to link my NIN to my MTN SIM?", "response": "Visit the MTN store with your NIN slip, present your ID for verification, and request that the NIN be linked to your SIM card. Alternatively, dial *785# for automatic linking."}
{"input": "How can I activate MTN\u0092s Caller Tune service?", "response": "To activate MTN Caller Tune, dial 4101# to subscribe or 4102# for more options. You can also visit the MTN website or app to select a preferred tune for your number."}
{"input": "How do I use MTN Music+?", "response": "MTN Music+ is an app that gives access to a wide variety of music. You can download the app from your phone\u0092s app store, register, and stream your favorite songs."}
{"input": "What is MTN MoMo?", "response": "MTN MoMo (Mobile Money) is a secure mobile financial service that allows users to transfer money, pay bills, and perform other financial services via their MTN phones."}
{"input": "How do I activate MTN\u0092s mobile banking service?", "response": "To activate MTN\u0092s mobile banking service, dial *170# and follow the prompts. You can link your bank account or perform transactions directly from your phone."}
{"input": "How can I block unsolicited MTN messages?", "response": "You can block unsolicited MTN messages by dialing *123# to manage preferences or visiting an MTN store to request blocking."}
{"input": "How do I get an MTN data bundle on a new device?", "response": "To get a data bundle on a new device, simply dial 3211# to view available data plans and subscribe, or use the myMTN app for easy access to data options."}
{"input": "How do I access MTN\u0092s customer care services?", "response": "You can reach MTN customer care by dialing 180 from your MTN line or visiting an MTN service center for assistance."}
{"input": "What is MTN\u0092s 5G network service?", "response": "MTN\u0092s 5G network service offers high-speed internet with reduced latency. You need a compatible device and 5G coverage to enjoy the benefits. Visit an MTN store for details."}
{"input": "Can I subscribe to MTN\u0092s international roaming service?", "response": "Yes, to subscribe to MTN\u0092s international roaming service, dial *470# or visit the nearest MTN store to activate roaming services for your travel."}
{"input": "How do I check my MTN data balance?", "response": "To check your MTN data balance, dial *131# or use the myMTN app for real-time data usage information."}
{"input": "How do I access MTN\u0092s mobile internet service?", "response": "To access MTN\u0092s mobile internet, ensure you have an active data plan by dialing *321# or using the myMTN app to subscribe to your preferred bundle."}
{"input": "Can I change my MTN plan or service?", "response": "Yes, you can change your MTN plan or service by visiting an MTN service center, calling customer care, or using the myMTN app to explore available plan options."}
{"input": "How do I activate MTN\u0092s daily data plan?", "response": "To activate MTN\u0092s daily data plan, dial 3211# or subscribe to other daily plans using the myMTN app for flexibility."}
{"input": "How can I request a refund for incorrect MTN charges?", "response": "If you are charged incorrectly, call MTN customer care or visit an MTN store to request a refund after providing the necessary details of the transaction."}
{"input": "How do I activate MTN\u0092s voice bundles?", "response": "To activate MTN\u0092s voice bundles, dial *310# and select from available options or visit the MTN website for more information about your voice plan."}
{"input": "How do I purchase MTN airtime online?", "response": "You can purchase MTN airtime online by using MTN\u0092s app, third-party apps, or directly from mobile banking platforms available on your phone."}
{"input": "How can I transfer data from my MTN account to another user?", "response": "You can transfer data to another MTN user by dialing 1311# and following the instructions, or use the myMTN app to easily transfer data between accounts."}
{"input": "What should I do if I experience poor MTN network quality?", "response": "If you experience poor network quality, try restarting your phone, checking your signal strength, or contacting MTN customer care to report the issue."}
{"input": "How do I activate MTN\u0092s family and friends service?", "response": "To activate MTN\u0092s family and friends service, dial *311# and follow the prompts to select numbers to add to your family and friends list for discounted rates."}
{"input": "What is MTN\u0092s #100 bundle?", "response": "MTN\u0092s #100 bundle offers affordable options for voice and data services. To subscribe, dial *100# or visit the myMTN app for more bundle details."}
{"input": "How do I change my MTN number?", "response": "To change your MTN number, you need to visit an MTN service center with valid identification. A new SIM will be issued with your requested number."}
{"input": "How can I track my MTN mobile data usage?", "response": "You can track your data usage by dialing *131# or using the myMTN app to monitor your data consumption and plan adjustments."}
{"input": "What is MTN\u0092s Auto-Renewal service?", "response": "MTN\u0092s Auto-Renewal service allows you to automatically renew your data or voice plan as it expires. To activate, dial *321# or manage it through the myMTN app."}
{"input": "How can I stop an MTN subscription service?", "response": "To stop a subscription service, dial *123# or use the myMTN app to manage and cancel active services or subscriptions."}
{"input": "What is MTN\u0092s SME service?", "response": "MTN\u0092s SME service offers customized plans and solutions for small and medium enterprises, including data, voice, and business solutions tailored to company needs."}
{"input": "How can I check my MTN airtime balance?", "response": "You can check your MTN airtime balance by dialing *123# or using the myMTN app for updated balance information."}
{"input": "How do I activate MTN\u0092s Super Saver plan?", "response": "To activate MTN\u0092s Super Saver plan, dial *151# and follow the prompts for voice and data savings."}
{"input": "How do I make an MTN international call?", "response": "To make an international call, dial the international number with the country code, or visit an MTN store for more information on international calling options."}
{"input": "How do I get MTN\u0092s internet access for businesses?", "response": "Businesses can access MTN\u0092s internet services by contacting MTN\u0092s business solutions department or visiting the MTN business website for tailored internet packages."}
{"input": "Can I change my MTN data bundle mid-month?", "response": "Yes, you can change your MTN data bundle mid-month by dialing *321# or through the myMTN app to choose a new data plan."}
{"input": "What is MTN\u0092s prepaid mobile service?", "response": "MTN\u0092s prepaid mobile service allows you to top up your account as needed, without any monthly commitments. You can choose from a variety of voice and data bundles."}
{"input": "How do I report a stolen or lost MTN SIM card?", "response": "To report a stolen or lost MTN SIM card, call MTN customer care immediately or visit an MTN store to block your SIM and prevent unauthorized use."}
{"input": "What is MTN\u0092s prepaid data offer?", "response": "MTN offers various prepaid data plans, from daily to monthly bundles. Dial 3211# for options or use the myMTN app for easy selection and activation."}
{"input": "How can I activate MTN\u0092s music streaming service?", "response": "To activate MTN\u0092s music streaming service, download the Music+ app, sign up, and stream music directly from your phone with an active MTN data plan."}
{"input": "Can I use MTN data bundles abroad?", "response": "Yes, MTN\u0092s data bundles can be used abroad if you activate international roaming. Dial *470# to enable international roaming before traveling."}
{"input": "How can I reduce my MTN data usage?", "response": "To reduce your MTN data usage, you can activate data-saving modes on your phone, monitor your data usage with *131#, and subscribe to lower data plans."}
{"input": "How can I check my MTN roaming charges?", "response": "To check your MTN roaming charges, dial *470# or use the myMTN app to get updated roaming rates and details of charges while abroad."}
{"input": "What is MTN\u0092s USSD code for balance checking?", "response": "To check your MTN balance, simply dial *123# and your current balance will be displayed on your screen."}
{"input": "How can I activate MTN\u0092s data share service?", "response": "To activate data sharing, dial *131# and follow the instructions. You can share your data with other MTN users by selecting the share option."}
{"input": "How do I stop a recurring MTN subscription?", "response": "To stop a recurring MTN subscription, you can dial 1232# and follow the prompts to manage or cancel active subscriptions."}
{"input": "Can I use MTN data bundles for international use?", "response": "Yes, MTN data bundles can be used internationally if you have activated international roaming services. Dial *470# to activate roaming before traveling."}
{"input": "How do I activate MTN\u0092s Night Plan?", "response": "To activate MTN\u0092s Night Plan, dial *406# and select your preferred plan. This plan offers discounted data for usage during off-peak hours."}
{"input": "What is MTN\u0092s data rollover service?", "response": "MTN\u0092s data rollover service allows you to carry over unused data from your previous plan to the next month. This helps ensure that you do not lose unused data."}
{"input": "How do I change my MTN tariff plan?", "response": "To change your MTN tariff plan, dial 1211# or visit an MTN store to explore other available options for new tariff plans that suit your needs."}
{"input": "How can I activate MTN\u0092s Pay-As-You-Go service?", "response": "To activate MTN\u0092s Pay-As-You-Go service, dial *311# and select the option to activate. This service allows you to pay as you go without any monthly commitments."}
{"input": "How do I check MTN\u0092s customer service contact details?", "response": "You can find MTN\u0092s customer service contact details on the MTN website or dial 180 from your MTN phone for immediate assistance."}
{"input": "How can I use MTN\u0092s Family and Friends offer?", "response": "To use MTN\u0092s Family and Friends offer, dial *311# to add contacts to your list. You can enjoy discounted rates for calls and texts to those contacts."}
{"input": "How do I request a MTN SIM replacement?", "response": "To request a SIM replacement, visit an MTN service center with a valid ID and provide your account details. Your new SIM will be activated immediately after processing."}
{"input": "How do I get a new MTN SIM card for a new phone?", "response": "You can visit an MTN store with a valid ID and request a new SIM card. You will be issued a new SIM and can activate it by following the necessary steps provided."}
{"input": "What is MTN\u0092s data auto-renewal feature?", "response": "MTN\u0092s data auto-renewal feature allows you to automatically renew your data plan when it expires. To enable it, dial *321# and choose the auto-renewal option."}
{"input": "How do I opt out of MTN\u0092s value-added services?", "response": "To opt out of MTN\u0092s value-added services, you can dial *123# and select the unsubscribe option or use the myMTN app to manage subscriptions."}
{"input": "What is MTN\u0092s Hotspot feature?", "response": "MTN\u0092s Hotspot feature allows you to share your mobile data connection with other devices. To activate, go to your phone\u0092s settings and enable the hotspot option."}
{"input": "How can I upgrade my MTN internet plan?", "response": "To upgrade your MTN internet plan, dial *321# or use the myMTN app to explore better and higher data plans that suit your internet needs."}
{"input": "What should I do if I am unable to make calls with MTN?", "response": "If you are unable to make calls, check your network settings, ensure your line is active, or dial *123# to check your balance. If the issue persists, contact MTN support."}
{"input": "How do I activate MTN\u0092s weekend data plan?", "response": "To activate MTN\u0092s weekend data plan, dial *405# and choose your preferred data option for weekend usage."}
{"input": "Can I transfer MTN data to another user?", "response": "Yes, you can transfer data to another MTN user by dialing 1311# and following the prompts to send data to a friend or family member."}
{"input": "How can I track my MTN subscription services?", "response": "You can track your MTN subscription services by dialing *123# or using the myMTN app to view your active services and make changes if needed."}
{"input": "How can I activate MTN\u0092s Video and Music service?", "response": "To activate MTN\u0092s Video and Music service, visit the MTN Music+ or MTN Video app and subscribe for access to exclusive content."}
{"input": "How do I access MTN\u0092s education content?", "response": "MTN provides access to educational content through its MTN Education bundles. You can access this by visiting the myMTN app and subscribing to the education plans."}
{"input": "How can I activate MTN\u0092s Sports content bundle?", "response": "To activate MTN\u0092s Sports content bundle, visit the myMTN app or dial *321# to explore available sports subscription options and activate your preferred plan."}
{"input": "How do I enable MTN\u0092s call forwarding service?", "response": "To enable call forwarding, dial 21 followed by the phone number where you want your calls to be forwarded. You can also manage call forwarding through the settings."}
{"input": "What is MTN\u0092s short code for airtime transfer?", "response": "To transfer airtime to another MTN number, dial 600recipient\u0092s numberamount#. For example, to send ?100, dial 60008012345678100# and follow the prompts."}
{"input": "How can I activate MTN\u0092s 3G/4G network services?", "response": "To activate 3G/4G services, ensure you have a 3G/4G-compatible device and SIM. Dial *131# to activate your network or visit an MTN store for assistance."}
{"input": "How do I stop MTN\u0092s data notifications?", "response": "To stop MTN\u0092s data notifications, you can send a request to customer care via SMS or dial *123# and follow the options to manage your notification preferences."}
{"input": "How do I upgrade my MTN tariff plan to a higher one?", "response": "You can upgrade your MTN tariff plan by visiting the MTN website, using the myMTN app, or dialing 1211# to explore higher-value plans suited to your needs."}
{"input": "How do I get MTN\u0092s Wi-Fi service for home use?", "response": "You can get MTN\u0092s Wi-Fi service for home by visiting an MTN store or contacting MTN\u0092s customer service to inquire about their home internet and Wi-Fi packages."}
{"input": "How do I stop MTN\u0092s promotional messages?", "response": "To stop receiving MTN\u0092s promotional messages, dial 1234# or unsubscribe directly through the myMTN app."}
{"input": "How can I get my MTN number?", "response": "You can find your MTN number by dialing *123# or *131# on your phone. It will display your MTN phone number on the screen."}
{"input": "How do I update my MTN NIN information?", "response": "To update your NIN information with MTN, you can visit any MTN store with your National Identification Number (NIN) and other relevant documents for verification and update."}
{"input": "Can I use MTN data bundles on my tablet?", "response": "Yes, you can use MTN data bundles on any device that supports mobile data, including tablets. Ensure your device is compatible with MTN\u0092s network, and insert the MTN SIM card."}
{"input": "How can I deactivate MTN\u0092s International Roaming?", "response": "To deactivate MTN\u0092s international roaming, dial *470# and select the option to deactivate or contact MTN customer care for assistance."}
{"input": "How can I opt-out of MTN\u0092s value-added services?", "response": "You can opt-out of MTN\u0092s value-added services by dialing *123# and following the prompts to unsubscribe from active services or by contacting MTN customer care."}
{"input": "How can I check if my MTN SIM card is 4G enabled?", "response": "To check if your MTN SIM card is 4G-enabled, dial *121# and follow the prompts to check your SIM\u0092s network compatibility or contact MTN customer service for confirmation."}
{"input": "What is MTN\u0092s customer service contact number?", "response": "MTN\u0092s customer service can be reached by dialing 180 from your MTN line for assistance. You can also visit MTN's official website for other support options."}
{"input": "Can I use MTN\u0092s mobile data without a SIM card?", "response": "No, you cannot use MTN\u0092s mobile data without a SIM card. A valid SIM card is required to access the mobile network and activate data services."}
{"input": "How do I activate MTN\u0092s 5GB data plan?", "response": "To activate MTN\u0092s 5GB data plan, dial *321# or visit the MTN website to explore the available data options and select the 5GB plan for activation."}
{"input": "How do I deactivate MTN\u0092s SMS subscription?", "response": "To deactivate MTN\u0092s SMS subscription, dial 1234# or send a request to MTN customer care to unsubscribe from any unwanted SMS services."}
{"input": "How can I request a new MTN SIM if mine is damaged?", "response": "If your SIM card is damaged, visit an MTN store with valid identification to request a replacement SIM. Your old number will be transferred to the new SIM once processed."}
{"input": "How can I check if my MTN SIM is registered?", "response": "You can check if your MTN SIM is registered by dialing *789# or by visiting an MTN store to confirm the registration status of your SIM card."}
{"input": "How can I stop auto-renewal on my MTN data plan?", "response": "To stop the auto-renewal feature on your MTN data plan, dial *321# and follow the prompts to disable automatic renewal for your data plans."}
{"input": "How do I recharge my MTN line?", "response": "To recharge your MTN line, purchase an MTN recharge card and dial 555PIN# to recharge. Alternatively, you can recharge via the myMTN app or online banking services."}
{"input": "How do I activate MTN\u0092s Smart Tariff plan?", "response": "To activate MTN\u0092s Smart Tariff plan, dial 1211# and follow the prompts to select and activate the Smart Plan option that suits your needs."}
{"input": "How do I check my MTN data usage?", "response": "To check your MTN data usage, dial 1314# or visit the myMTN app for real-time updates on your data consumption and remaining balance."}
{"input": "How do I activate MTN\u0092s Call Me Back service?", "response": "To activate the MTN Call Me Back service, dial *133# and follow the instructions to send a free call-back request to any MTN number."}
{"input": "How do I upgrade to an MTN 4G LTE network?", "response": "To upgrade to an MTN 4G LTE network, ensure your device is 4G-enabled, then dial *131# to activate 4G services or visit an MTN store for further assistance."}
{"input": "Can I transfer data between different MTN accounts?", "response": "Yes, you can transfer data from your MTN account to another MTN user by dialing 1311# and following the prompts to send data."}
{"input": "How do I activate MTN\u0092s Super Weekend data plan?", "response": "To activate MTN\u0092s Super Weekend data plan, dial *141# and select the Super Weekend plan for affordable data usage over the weekend."}
{"input": "What is MTN\u0092s emergency airtime service?", "response": "MTN\u0092s emergency airtime service allows you to borrow airtime when your balance is low. To activate, dial *606# to request a loan and repay when your balance is refilled."}
{"input": "How can I transfer airtime to another MTN user?", "response": "To transfer airtime to another MTN user, dial 600recipient\u0092s phone number*amount# and follow the prompts to complete the transfer."}
{"input": "How do I deactivate MTN\u0092s call barring service?", "response": "To deactivate MTN\u0092s call barring service, dial 33PIN# and follow the instructions to disable the service. You can also contact MTN customer service for assistance."}
{"input": "How do I activate MTN\u0092s night browsing plan?", "response": "To activate MTN\u0092s night browsing plan, dial *406# and select your preferred data plan, which allows you to browse at discounted rates during off-peak hours."}
{"input": "How do I activate MTN\u0092s Family & Friends offer?", "response": "To activate MTN\u0092s Family & Friends offer, dial *311# and follow the instructions to add numbers to your list and enjoy discounted rates for calls to those numbers."}
{"input": "How do I change my MTN tariff plan?", "response": "To change your MTN tariff plan, dial 1211# and select a new plan that suits your needs. You can also visit an MTN store for assistance in choosing the best tariff for you."}
{"input": "How can I subscribe to MTN\u0092s internet data plan?", "response": "You can subscribe to MTN\u0092s internet data plan by dialing *321# or visiting the myMTN app to select the plan that best meets your internet usage needs."}
{"input": "What is MTN Data bundle?", "response": "MTN Data bundles are affordable data plans designed to give access to the internet through data-enabled devices. They are offered at a pre-determined price for a defined period."}
{"input": "Who can subscribe to MTN Data bundle?", "response": "All MTN Customers can subscribe to any MTN Data bundle."}
{"input": "What are the different MTN Data bundle plans available?", "response": "They are Daily, Weekly, Monthly, Bi-monthly, Quarterly, Bi-annually, and Yearly."}
{"input": "How do I subscribe to MTN Data bundles?", "response": "You can subscribe via USSD, SMS, myMTN App, or the MTN website."}
{"input": "What is MTN MoMo?", "response": "MTN MoMo is a mobile money service that allows you to send and receive money, pay bills, and perform other financial transactions."}
{"input": "How can I register for MTN MoMo?", "response": "You can register for MTN MoMo at any MTN outlet or by dialing *502#."}
{"input": "What are the charges for using MTN MoMo?", "response": "Charges vary depending on the transaction type, such as transfers, withdrawals, or payments."}
{"input": "Can I use MTN MoMo without a smartphone?", "response": "Yes, MTN MoMo can be accessed via USSD codes on any mobile phone."}
{"input": "What is MTN Pulse?", "response": "MTN Pulse is a prepaid tariff plan that allows you to enjoy discounted call rates and other lifestyle benefits."}
{"input": "How can I migrate to MTN Pulse?", "response": "Dial *406# to migrate to MTN Pulse."}
{"input": "What is MTN XtraTime?", "response": "MTN XtraTime allows eligible customers to borrow airtime and pay back on their next recharge."}
{"input": "How do I check my airtime balance on MTN?", "response": "Dial *556# to check your airtime balance."}
{"input": "What is the MTN Welcome Back Offer?", "response": "The MTN Welcome Back Offer provides discounts on calls, data, and SMS to inactive subscribers."}
{"input": "How do I check my eligibility for MTN Welcome Back Offer?", "response": "Dial *121# to check your eligibility."}
{"input": "What is the MTN Data Bonus?", "response": "MTN Data Bonus gives you extra data on specific bundle purchases as a reward."}
{"input": "Can I combine MTN promotional offers?", "response": "Yes, you can combine certain offers, subject to terms and conditions."}
